[Killed] ObjectLiteral
src/lib/api/client.ts:5:32
 import { useAuthStore } from "@/stores/authStore"
 import { type AuthHandledAxiosError, isAuthErrorStatus } from "./auth-error"
 
-const apiClient = axios.create({
-  baseURL: "/backend-api",
-  headers: {
-    "Content-Type": "application/json",
-  },
-})
+const apiClient = axios.create({})
 export const appApiClient = axios.create()
 
killedBy: BuyerPaymentMethodsPage summarises the default card and the auto order card
statusReason: Unable to find an element with the text: Visa •••• 4532. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<article
  class="rounded-xl border border-border-soft bg-surface p-4"
>
  <div
    class="mb-3 flex h-10 w-10 items-center justify-center

[Killed] StringLiteral
src/lib/api/client.ts:6:12
 import { type AuthHandledAxiosError, isAuthErrorStatus } from "./auth-error"
 
 const apiClient = axios.create({
-  baseURL: "/backend-api",
+  baseURL: "",
   headers: {
     "Content-Type": "application/json",
killedBy: FinalReview places the order, confirms the card and advances to the confirmation step
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Survived] ObjectLiteral
src/lib/api/client.ts:7:12
 
 const apiClient = axios.create({
   baseURL: "/backend-api",
-  headers: {
-    "Content-Type": "application/json",
-  },
+  headers: {},
 })
 export const appApiClient = axios.create()

[Killed] BlockStatement
src/lib/api/client.ts:15:37
 
 let authFailurePromise: Promise<void> | null = null
 
-const buildLoginUrl = (): string => {
-  if (typeof window === "undefined") {
-    return "/login"
-  }
-
-  const loginUrl = new URL("/login", window.location.origin)
-  const currentPath = `${window.location.pathname}${window.location.search}`
-
-  if (currentPath && currentPath !== "/" && !currentPath.startsWith("/login")) {
-    loginUrl.searchParams.set("redirect", currentPath)
-  }
-
-  loginUrl.searchParams.set("reason", "session-expired")
-  return loginUrl.toString()
-}
+const buildLoginUrl = (): string => {}
 
 const handleAuthFailure = async (): Promise<void> => {
killedBy: PurchaseOptions leaves an unauthorised cart write to the interceptor's redirect
statusReason: expected 'undefined' to contain '/login'

[Killed] EqualityOperator
src/lib/api/client.ts:16:7
 let authFailurePromise: Promise<void> | null = null
 
 const buildLoginUrl = (): string => {
-  if (typeof window === "undefined") {
+  if (typeof window !== "undefined") {
     return "/login"
   }
killedBy: 401 handling logs out, marks the error as handled and redirects to /login
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   "http://localhost:3000/login?reason=session-expired",

[Killed] ConditionalExpression
src/lib/api/client.ts:16:7
 let authFailurePromise: Promise<void> | null = null
 
 const buildLoginUrl = (): string => {
-  if (typeof window === "undefined") {
+  if (true) {
     return "/login"
   }
killedBy: 401 handling logs out, marks the error as handled and redirects to /login
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   "http://localhost:3000/login?reason=session-expired",

[Killed] EqualityOperator
src/lib/api/client.ts:23:22
   const loginUrl = new URL("/login", window.location.origin)
   const currentPath = `${window.location.pathname}${window.location.search}`
 
-  if (currentPath && currentPath !== "/" && !currentPath.startsWith("/login")) {
+  if (currentPath && currentPath === "/" && !currentPath.startsWith("/login")) {
     loginUrl.searchParams.set("redirect", currentPath)
   }
killedBy: 401 handling logs out, marks the error as handled and redirects to /login
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   "http://localhost:3000/login?reason=session-expired",

[Killed] BooleanLiteral
src/lib/api/client.ts:23:45
   const loginUrl = new URL("/login", window.location.origin)
   const currentPath = `${window.location.pathname}${window.location.search}`
 
-  if (currentPath && currentPath !== "/" && !currentPath.startsWith("/login")) {
+  if (currentPath && currentPath !== "/" && currentPath.startsWith("/login")) {
     loginUrl.searchParams.set("redirect", currentPath)
   }
killedBy: 401 handling carries the current path and query into the redirect param
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   "http://localhost:3000/login?redirect=%2Fproducts%3Fpage%3D2&reason=session-expired",

[Killed] StringLiteral
src/lib/api/client.ts:27:29
     loginUrl.searchParams.set("redirect", currentPath)
   }
 
-  loginUrl.searchParams.set("reason", "session-expired")
+  loginUrl.searchParams.set("", "session-expired")
   return loginUrl.toString()
 }
killedBy: 401 handling logs out, marks the error as handled and redirects to /login
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   "http://localhost:3000/login?reason=session-expired",

[Killed] BlockStatement
src/lib/api/client.ts:31:54
   return loginUrl.toString()
 }
 
-const handleAuthFailure = async (): Promise<void> => {
-  if (typeof window === "undefined") {
-    return
-  }
-
-  if (!authFailurePromise) {
-    authFailurePromise = (async () => {
-      const { logout } = useAuthStore.getState()
-      await logout()
-
-      const target = buildLoginUrl()
-      if (window.location.href !== target) {
-        window.location.assign(target)
-      }
-    })().finally(() => {
-      authFailurePromise = null
-    })
-  }
-
-  await authFailurePromise
-}
+const handleAuthFailure = async (): Promise<void> => {}
 
 const resolveAccessToken = (): string | null => {
killedBy: 401 handling logs out, marks the error as handled and redirects to /login
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/lib/api/client.ts:32:7
 }
 
 const handleAuthFailure = async (): Promise<void> => {
-  if (typeof window === "undefined") {
+  if (false) {
     return
   }
killedBy: server-side rendering guard attaches no token and performs no navigation when window is unavailable
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array []

[Killed] BlockStatement
src/lib/api/client.ts:32:38
 }
 
 const handleAuthFailure = async (): Promise<void> => {
-  if (typeof window === "undefined") {
-    return
-  }
+  if (typeof window === "undefined") {}
 
   if (!authFailurePromise) {
killedBy: server-side rendering guard attaches no token and performs no navigation when window is unavailable
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array []

[Killed] ConditionalExpression
src/lib/api/client.ts:36:7
     return
   }
 
-  if (!authFailurePromise) {
+  if (false) {
     authFailurePromise = (async () => {
       const { logout } = useAuthStore.getState()
killedBy: 401 handling logs out, marks the error as handled and redirects to /login
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/lib/api/client.ts:36:7
     return
   }
 
-  if (!authFailurePromise) {
+  if (true) {
     authFailurePromise = (async () => {
       const { logout } = useAuthStore.getState()
killedBy: 401 handling logs out exactly once for three concurrent 401s, then re-arms for the next one
statusReason: expected "spy" to be called 1 times, but got 3 times

[Killed] BlockStatement
src/lib/api/client.ts:37:39
   }
 
   if (!authFailurePromise) {
-    authFailurePromise = (async () => {
-      const { logout } = useAuthStore.getState()
-      await logout()
-
-      const target = buildLoginUrl()
-      if (window.location.href !== target) {
-        window.location.assign(target)
-      }
-    })().finally(() => {
+    authFailurePromise = (async () => {})().finally(() => {
       authFailurePromise = null
     })
killedBy: 401 handling logs out, marks the error as handled and redirects to /login
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/lib/api/client.ts:42:11
       await logout()
 
       const target = buildLoginUrl()
-      if (window.location.href !== target) {
+      if (false) {
         window.location.assign(target)
       }
killedBy: 401 handling logs out, marks the error as handled and redirects to /login
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/lib/api/client.ts:42:11
       await logout()
 
       const target = buildLoginUrl()
-      if (window.location.href !== target) {
+      if (true) {
         window.location.assign(target)
       }
killedBy: 401 handling does not navigate when the browser is already on the exact target URL
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      "http://localhost:3000/login?reason=session-expired",

[Killed] CallExpression
src/lib/api/client.ts:43:9
 
       const target = buildLoginUrl()
       if (window.location.href !== target) {
-        window.location.assign(target)
+        ;
       }
     })().finally(() => {
killedBy: 401 handling logs out, marks the error as handled and redirects to /login
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/lib/api/client.ts:45:24
       if (window.location.href !== target) {
         window.location.assign(target)
       }
-    })().finally(() => {
-      authFailurePromise = null
-    })
+    })().finally(() => {})
   }
 
killedBy: 401 handling carries the current path and query into the redirect param
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/lib/api/client.ts:54:7
 }
 
 const resolveAccessToken = (): string | null => {
-  if (typeof window === "undefined") {
+  if (true) {
     return null
   }
killedBy: token attachment sends the access token from the auth-storage cookie
statusReason: expected null to be 'Bearer cookie-token' // Object.is equality

[Killed] EqualityOperator
src/lib/api/client.ts:54:7
 }
 
 const resolveAccessToken = (): string | null => {
-  if (typeof window === "undefined") {
+  if (typeof window !== "undefined") {
     return null
   }
killedBy: token attachment sends the access token from the auth-storage cookie
statusReason: expected null to be 'Bearer cookie-token' // Object.is equality

[Killed] StringLiteral
src/lib/api/client.ts:58:16
     return null
   }
 
-  const name = "auth-storage="
+  const name = ""
   const decodedCookie = decodeURIComponent(document.cookie)
   const parts = decodedCookie.split(";")
killedBy: token attachment sends the access token from the auth-storage cookie
statusReason: expected null to be 'Bearer cookie-token' // Object.is equality

[Killed] UpdateOperator
src/lib/api/client.ts:62:45
   const decodedCookie = decodeURIComponent(document.cookie)
   const parts = decodedCookie.split(";")
 
-  for (let index = 0; index < parts.length; index++) {
+  for (let index = 0; index < parts.length; index--) {
     let cookiePart = parts[index]
     while (cookiePart.charAt(0) === " ") {
killedBy: token attachment falls back to the localStorage token when no auth-storage cookie exists
statusReason: Cannot read properties of undefined (reading 'charAt')

[Killed] ConditionalExpression
src/lib/api/client.ts:62:23
   const decodedCookie = decodeURIComponent(document.cookie)
   const parts = decodedCookie.split(";")
 
-  for (let index = 0; index < parts.length; index++) {
+  for (let index = 0; false; index++) {
     let cookiePart = parts[index]
     while (cookiePart.charAt(0) === " ") {
killedBy: token attachment sends the access token from the auth-storage cookie
statusReason: expected null to be 'Bearer cookie-token' // Object.is equality

[Survived] ConditionalExpression
src/lib/api/client.ts:64:12
 
   for (let index = 0; index < parts.length; index++) {
     let cookiePart = parts[index]
-    while (cookiePart.charAt(0) === " ") {
+    while (false) {
       cookiePart = cookiePart.substring(1)
     }

[Timeout] EqualityOperator
src/lib/api/client.ts:64:12
 
   for (let index = 0; index < parts.length; index++) {
     let cookiePart = parts[index]
-    while (cookiePart.charAt(0) === " ") {
+    while (cookiePart.charAt(0) !== " ") {
       cookiePart = cookiePart.substring(1)
     }

[NoCoverage] MethodExpression
src/lib/api/client.ts:65:20
   for (let index = 0; index < parts.length; index++) {
     let cookiePart = parts[index]
     while (cookiePart.charAt(0) === " ") {
-      cookiePart = cookiePart.substring(1)
+      cookiePart = cookiePart
     }
 

[Killed] BlockStatement
src/lib/api/client.ts:68:41
       cookiePart = cookiePart.substring(1)
     }
 
-    if (cookiePart.indexOf(name) !== 0) {
-      continue
-    }
+    if (cookiePart.indexOf(name) !== 0) {}
 
     try {
killedBy: token attachment falls back to the localStorage token when no auth-storage cookie exists
statusReason: expected null to be 'Bearer ls-token' // Object.is equality

[Killed] ConditionalExpression
src/lib/api/client.ts:68:9
       cookiePart = cookiePart.substring(1)
     }
 
-    if (cookiePart.indexOf(name) !== 0) {
+    if (true) {
       continue
     }
killedBy: token attachment sends the access token from the auth-storage cookie
statusReason: expected null to be 'Bearer cookie-token' // Object.is equality

[Killed] BlockStatement
src/lib/api/client.ts:72:9
       continue
     }
 
-    try {
-      const authData = JSON.parse(cookiePart.substring(name.length, cookiePart.length))
-      return authData.state?.accessToken || null
-    } catch {
+    try {} catch {
       return null
     }
killedBy: token attachment sends the access token from the auth-storage cookie
statusReason: expected null to be 'Bearer cookie-token' // Object.is equality

[Killed] MethodExpression
src/lib/api/client.ts:73:35
     }
 
     try {
-      const authData = JSON.parse(cookiePart.substring(name.length, cookiePart.length))
+      const authData = JSON.parse(cookiePart)
       return authData.state?.accessToken || null
     } catch {
killedBy: token attachment sends the access token from the auth-storage cookie
statusReason: expected null to be 'Bearer cookie-token' // Object.is equality

[Killed] LogicalOperator
src/lib/api/client.ts:74:14
 
     try {
       const authData = JSON.parse(cookiePart.substring(name.length, cookiePart.length))
-      return authData.state?.accessToken || null
+      return authData.state?.accessToken && null
     } catch {
       return null
killedBy: token attachment sends the access token from the auth-storage cookie
statusReason: expected null to be 'Bearer cookie-token' // Object.is equality

[Killed] ConditionalExpression
src/lib/api/client.ts:74:14
 
     try {
       const authData = JSON.parse(cookiePart.substring(name.length, cookiePart.length))
-      return authData.state?.accessToken || null
+      return false
     } catch {
       return null
killedBy: token attachment sends the access token from the auth-storage cookie
statusReason: expected null to be 'Bearer cookie-token' // Object.is equality

[Killed] BlockStatement
src/lib/api/client.ts:75:13
     try {
       const authData = JSON.parse(cookiePart.substring(name.length, cookiePart.length))
       return authData.state?.accessToken || null
-    } catch {
-      return null
-    }
+    } catch {}
   }
 
killedBy: token attachment degrades to no header — not a crash — when the auth cookie is unparseable
statusReason: expected 'Bearer ls-token' to be null

[Killed] StringLiteral
src/lib/api/client.ts:80:31
     }
   }
 
-  return localStorage.getItem("token")
+  return localStorage.getItem("")
 }
 
killedBy: token attachment falls back to the localStorage token when no auth-storage cookie exists
statusReason: expected null to be 'Bearer ls-token' // Object.is equality

[Killed] BlockStatement
src/lib/api/client.ts:83:100
   return localStorage.getItem("token")
 }
 
-const attachTokenInterceptor = (config: InternalAxiosRequestConfig): InternalAxiosRequestConfig => {
-  const token = resolveAccessToken()
-  if (token) {
-    config.headers.Authorization = `Bearer ${token}`
-  }
-
-  return config
-}
+const attachTokenInterceptor = (config: InternalAxiosRequestConfig): InternalAxiosRequestConfig => {}
 
 const attachAuthInterceptors = (client: typeof apiClient): void => {
killedBy: getProductDetailPageData — anonymous SSR returns the product payload with questions and sends no Authorization header
statusReason: Unable to connect to server. Please check your internet connection.

[Killed] BlockStatement
src/lib/api/client.ts:85:14
 
 const attachTokenInterceptor = (config: InternalAxiosRequestConfig): InternalAxiosRequestConfig => {
   const token = resolveAccessToken()
-  if (token) {
-    config.headers.Authorization = `Bearer ${token}`
-  }
+  if (token) {}
 
   return config
killedBy: token attachment sends the access token from the auth-storage cookie
statusReason: expected null to be 'Bearer cookie-token' // Object.is equality

[Killed] ConditionalExpression
src/lib/api/client.ts:85:7
 
 const attachTokenInterceptor = (config: InternalAxiosRequestConfig): InternalAxiosRequestConfig => {
   const token = resolveAccessToken()
-  if (token) {
+  if (true) {
     config.headers.Authorization = `Bearer ${token}`
   }
killedBy: getProductDetailPageData — anonymous SSR returns the product payload with questions and sends no Authorization header
statusReason: expected 'Bearer null' to be null

[Killed] BlockStatement
src/lib/api/client.ts:92:68
   return config
 }
 
-const attachAuthInterceptors = (client: typeof apiClient): void => {
-  client.interceptors.request.use(attachTokenInterceptor, (error) => Promise.reject(error))
-
-  client.interceptors.response.use(
-    (response) => response,
-    async (error: AuthHandledAxiosError) => {
-      const status = error.response?.status
-
-      if (isAuthErrorStatus(status)) {
-        error.authHandled = true
-        await handleAuthFailure()
-      }
-
-      return Promise.reject(error)
-    },
-  )
-}
+const attachAuthInterceptors = (client: typeof apiClient): void => {}
 
 attachAuthInterceptors(apiClient)
killedBy: paymentMethodsAPI.getSavedCards contract flags a 401 as auth-handled
statusReason: expected undefined to be true // Object.is equality

[Survived] ArrowFunction
src/lib/api/client.ts:93:59
 }
 
 const attachAuthInterceptors = (client: typeof apiClient): void => {
-  client.interceptors.request.use(attachTokenInterceptor, (error) => Promise.reject(error))
+  client.interceptors.request.use(attachTokenInterceptor, () => undefined)
 
   client.interceptors.response.use(

[Killed] CallExpression
src/lib/api/client.ts:95:3
 const attachAuthInterceptors = (client: typeof apiClient): void => {
   client.interceptors.request.use(attachTokenInterceptor, (error) => Promise.reject(error))
 
-  client.interceptors.response.use(
-    (response) => response,
-    async (error: AuthHandledAxiosError) => {
-      const status = error.response?.status
-
-      if (isAuthErrorStatus(status)) {
-        error.authHandled = true
-        await handleAuthFailure()
-      }
-
-      return Promise.reject(error)
-    },
-  )
+  ;
 }
 
killedBy: PurchaseOptions leaves an unauthorised cart write to the interceptor's redirect
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html
  class="light"
  style="color-scheme: light;"
>
  <head />

[Killed] ArrowFunction
src/lib/api/client.ts:96:5
   client.interceptors.request.use(attachTokenInterceptor, (error) => Promise.reject(error))
 
   client.interceptors.response.use(
-    (response) => response,
+    () => undefined,
     async (error: AuthHandledAxiosError) => {
       const status = error.response?.status
killedBy: getProductDetailPageData — anonymous SSR returns the product payload with questions and sends no Authorization header
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/lib/api/client.ts:97:45
 
   client.interceptors.response.use(
     (response) => response,
-    async (error: AuthHandledAxiosError) => {
-      const status = error.response?.status
-
-      if (isAuthErrorStatus(status)) {
-        error.authHandled = true
-        await handleAuthFailure()
-      }
-
-      return Promise.reject(error)
-    },
+    async (error: AuthHandledAxiosError) => {},
   )
 }
killedBy: PurchaseOptions leaves an unauthorised cart write to the interceptor's redirect
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html
  class="light"
  style="color-scheme: light;"
>
  <head />

[Killed] OptionalChaining
src/lib/api/client.ts:98:22
   client.interceptors.response.use(
     (response) => response,
     async (error: AuthHandledAxiosError) => {
-      const status = error.response?.status
+      const status = error.response.status
 
       if (isAuthErrorStatus(status)) {
killedBy: buyerOrdersAPI pagination and filter serialisation aborts in flight when the caller's signal fires
statusReason: expected undefined to be 'ERR_CANCELED' // Object.is equality

[Killed] BlockStatement
src/lib/api/client.ts:100:38
     async (error: AuthHandledAxiosError) => {
       const status = error.response?.status
 
-      if (isAuthErrorStatus(status)) {
-        error.authHandled = true
-        await handleAuthFailure()
-      }
+      if (isAuthErrorStatus(status)) {}
 
       return Promise.reject(error)
killedBy: 401 handling logs out, marks the error as handled and redirects to /login
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/lib/api/client.ts:100:11
     async (error: AuthHandledAxiosError) => {
       const status = error.response?.status
 
-      if (isAuthErrorStatus(status)) {
+      if (true) {
         error.authHandled = true
         await handleAuthFailure()
killedBy: useCartPage mount surfaces a store error as an error toast
statusReason: expected "spy" to be called with arguments: [ 'Cart unavailable', Any<String> ]

Received: 



Number of calls: 0

[Killed] BooleanLiteral
src/lib/api/client.ts:101:29
       const status = error.response?.status
 
       if (isAuthErrorStatus(status)) {
-        error.authHandled = true
+        error.authHandled = false
         await handleAuthFailure()
       }
killedBy: 401 handling logs out, marks the error as handled and redirects to /login
statusReason: expected false to be true // Object.is equality

[Killed] CallExpression
src/lib/api/client.ts:110:1
   )
 }
 
-attachAuthInterceptors(apiClient)
+;
 attachAuthInterceptors(appApiClient)
 
killedBy: PurchaseOptions leaves an unauthorised cart write to the interceptor's redirect
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html
  class="light"
  style="color-scheme: light;"
>
  <head />

[Killed] CallExpression
src/lib/api/client.ts:111:1
 }
 
 attachAuthInterceptors(apiClient)
-attachAuthInterceptors(appApiClient)
+;
 
 export default apiClient
killedBy: productsAPI.createProduct contract rejects on 401 and marks authHandled
statusReason: expected false to be true // Object.is equality
