[Killed] BlockStatement
src/lib/api/cart.ts:54:34
 }
 
 class CartAPI {
-  async getCart(): Promise<Cart> {
-    const response = await apiClient.get<Cart>("/cart")
-    return response.data
-  }
+  async getCart(): Promise<Cart> {}
 
   async getTaxEstimate(payload: TaxEstimatePayload): Promise<TaxEstimate> {
killedBy: cartStore fetchCart de-duplication window skips the request when a second fetch lands 500ms after the first
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/api/cart.ts:59:75
     return response.data
   }
 
-  async getTaxEstimate(payload: TaxEstimatePayload): Promise<TaxEstimate> {
-    const response = await apiClient.post<TaxEstimate>("/cart/tax-estimate", payload)
-    return response.data
-  }
+  async getTaxEstimate(payload: TaxEstimatePayload): Promise<TaxEstimate> {}
 
   /**
killedBy: useCartPage derived data adds shipping and the heavy surcharge per unit and takes tax from the estimate
statusReason: expected +0 to be 7 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
src/lib/api/cart.ts:60:56
   }
 
   async getTaxEstimate(payload: TaxEstimatePayload): Promise<TaxEstimate> {
-    const response = await apiClient.post<TaxEstimate>("/cart/tax-estimate", payload)
+    const response = await apiClient.post<TaxEstimate>("", payload)
     return response.data
   }
killedBy: useCartPage derived data adds shipping and the heavy surcharge per unit and takes tax from the estimate
statusReason: expected +0 to be 7 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/lib/api/cart.ts:69:115
    * every write, so both calls always send it explicitly — omitting it would
    * silently clear a schedule the buyer already picked.
    */
-  async addItem(userProductId: string, quantity: number, autoOrder: AutoOrderPeriod | null = null): Promise<void> {
-    await apiClient.post("/cart/items", { userProductId, quantity, autoOrder })
-  }
+  async addItem(userProductId: string, quantity: number, autoOrder: AutoOrderPeriod | null = null): Promise<void> {}
 
   async updateItemQuantity(
killedBy: cartStore resolveAutoOrder falls back to null when the product is not in the cart
statusReason: expected null to deeply equal { userProductId: 'up-unknown', …(2) }

[Killed] BlockStatement
src/lib/api/cart.ts:77:20
     userProductId: string,
     quantity: number,
     autoOrder: AutoOrderPeriod | null = null,
-  ): Promise<void> {
-    await apiClient.put("/cart/items", { userProductId, quantity, autoOrder })
-  }
+  ): Promise<void> {}
 
   async removeItem(userProductId: string): Promise<void> {
killedBy: cartStore resolveAutoOrder resends the schedule already on the item when autoOrder is omitted
statusReason: expected null to deeply equal { userProductId: 'up-1', …(2) }

[Killed] ObjectLiteral
src/lib/api/cart.ts:78:40
     quantity: number,
     autoOrder: AutoOrderPeriod | null = null,
   ): Promise<void> {
-    await apiClient.put("/cart/items", { userProductId, quantity, autoOrder })
+    await apiClient.put("/cart/items", {})
   }
 
killedBy: cartStore resolveAutoOrder resends the schedule already on the item when autoOrder is omitted
statusReason: expected {} to deeply equal { userProductId: 'up-1', …(2) }

[Killed] BlockStatement
src/lib/api/cart.ts:81:58
     await apiClient.put("/cart/items", { userProductId, quantity, autoOrder })
   }
 
-  async removeItem(userProductId: string): Promise<void> {
-    await apiClient.delete("/cart/items", { data: { userProductId } })
-  }
+  async removeItem(userProductId: string): Promise<void> {}
 
   async clearCart(cartId: string): Promise<void> {
killedBy: cartStore setItemAutoOrder delegates to removeFromCart when the resolved quantity is zero
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ObjectLiteral
src/lib/api/cart.ts:82:51
   }
 
   async removeItem(userProductId: string): Promise<void> {
-    await apiClient.delete("/cart/items", { data: { userProductId } })
+    await apiClient.delete("/cart/items", { data: {} })
   }
 
killedBy: useCartPage removing items drops the last item and falls back to the empty view
statusReason: expected [ {} ] to deeply equal [ { userProductId: 'up-1' } ]

[Killed] BlockStatement
src/lib/api/cart.ts:85:50
     await apiClient.delete("/cart/items", { data: { userProductId } })
   }
 
-  async clearCart(cartId: string): Promise<void> {
-    await apiClient.delete("/cart", { data: { cartId } })
-  }
+  async clearCart(cartId: string): Promise<void> {}
 }
 
killedBy: useCartPage clearing the cart empties the cart, closes the confirmation and drops pending writes
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ObjectLiteral
src/lib/api/cart.ts:86:37
   }
 
   async clearCart(cartId: string): Promise<void> {
-    await apiClient.delete("/cart", { data: { cartId } })
+    await apiClient.delete("/cart", {})
   }
 }
killedBy: cartAPI request shapes sends the cart id in the body when clearing the cart
statusReason: Request failed with status code 500

[Killed] StringLiteral
src/lib/api/cart.ts:86:28
   }
 
   async clearCart(cartId: string): Promise<void> {
-    await apiClient.delete("/cart", { data: { cartId } })
+    await apiClient.delete("", { data: { cartId } })
   }
 }
killedBy: useCartPage clearing the cart empties the cart, closes the confirmation and drops pending writes
statusReason: expected +0 to be 1 // Object.is equality
