[Killed] BlockStatement
src/lib/api/orders.ts:95:77
 }
 
 class OrdersAPI {
-  async placeOrder(payload: PlaceOrderPayload): Promise<PlaceOrderResponse> {
-    const response = await apiClient.post<PlaceOrderResponse>("/orders", payload)
-    return response.data
-  }
+  async placeOrder(payload: PlaceOrderPayload): Promise<PlaceOrderResponse> {}
 
   async getPaymentStatus(paymentIntentId: string): Promise<GetPaymentStatusResponse> {
killedBy: FinalReview places the order, confirms the card and advances to the confirmation step
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] StringLiteral
src/lib/api/orders.ts:96:63
 
 class OrdersAPI {
   async placeOrder(payload: PlaceOrderPayload): Promise<PlaceOrderResponse> {
-    const response = await apiClient.post<PlaceOrderResponse>("/orders", payload)
+    const response = await apiClient.post<PlaceOrderResponse>("", payload)
     return response.data
   }
killedBy: FinalReview places the order, confirms the card and advances to the confirmation step
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/lib/api/orders.ts:100:86
     return response.data
   }
 
-  async getPaymentStatus(paymentIntentId: string): Promise<GetPaymentStatusResponse> {
-    const response = await apiClient.get<GetPaymentStatusResponse>(`/orders/payment/${paymentIntentId}`)
-    return response.data
-  }
+  async getPaymentStatus(paymentIntentId: string): Promise<GetPaymentStatusResponse> {}
 
   async getSavedCards(): Promise<SavedCardsResponse> {
killedBy: FinalReview places the order, confirms the card and advances to the confirmation step
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/lib/api/orders.ts:105:54
     return response.data
   }
 
-  async getSavedCards(): Promise<SavedCardsResponse> {
-    const response = await apiClient.get<SavedCardsResponse>("/orders/saved-cards")
-    return response.data
-  }
+  async getSavedCards(): Promise<SavedCardsResponse> {}
 }
 
killedBy: useBillingInformation — saved card loading exposes the saved cards, with the default one first as the backend ordered them
statusReason: expected [] to deeply equal [ 'c1', 'c2' ]
