[Killed] MethodExpression
src/lib/api/client.ts:64:12
 
   for (let index = 0; index < parts.length; index++) {
     let cookiePart = parts[index]
-    while (cookiePart.charAt(0) === " ") {
+    while (cookiePart === " ") {
       cookiePart = cookiePart.substring(1)
     }
killedBy: token attachment trims every leading space from a cookie segment before matching its name, not just one
statusReason: expected null to be 'Bearer trim-token' // Object.is equality
