[Killed] BlockStatement
src/lib/api/payment-methods.ts:54:56
 
 // ── Mapping ──────────────────────────────────────────────────────────────────
 
-function brandToType(brand: string): PaymentMethodType {
-  const lower = brand.toLowerCase()
-  if (lower === "visa") return "visa"
-  if (lower === "mastercard") return "mastercard"
-  if (lower === "amex" || lower === "american express") return "amex"
-  return "bank"
-}
+function brandToType(brand: string): PaymentMethodType {}
 
 export function mapApiCard(card: ApiSavedCard): SavedPaymentMethod {
killedBy: mapApiCard normalisation maps a visa card onto the UI shape
statusReason: expected { id: 'pm-1', type: undefined, …(11) } to deeply equal { id: 'pm-1', type: 'visa', …(11) }

[Killed] MethodExpression
src/lib/api/payment-methods.ts:55:17
 // ── Mapping ──────────────────────────────────────────────────────────────────
 
 function brandToType(brand: string): PaymentMethodType {
-  const lower = brand.toLowerCase()
+  const lower = brand.toUpperCase()
   if (lower === "visa") return "visa"
   if (lower === "mastercard") return "mastercard"
killedBy: mapApiCard normalisation maps a visa card onto the UI shape
statusReason: expected { id: 'pm-1', type: 'bank', …(11) } to deeply equal { id: 'pm-1', type: 'visa', …(11) }

[Killed] EqualityOperator
src/lib/api/payment-methods.ts:56:7
 
 function brandToType(brand: string): PaymentMethodType {
   const lower = brand.toLowerCase()
-  if (lower === "visa") return "visa"
+  if (lower !== "visa") return "visa"
   if (lower === "mastercard") return "mastercard"
   if (lower === "amex" || lower === "american express") return "amex"
killedBy: mapApiCard normalisation maps a visa card onto the UI shape
statusReason: expected { id: 'pm-1', type: 'bank', …(11) } to deeply equal { id: 'pm-1', type: 'visa', …(11) }

[Killed] ConditionalExpression
src/lib/api/payment-methods.ts:56:7
 
 function brandToType(brand: string): PaymentMethodType {
   const lower = brand.toLowerCase()
-  if (lower === "visa") return "visa"
+  if (false) return "visa"
   if (lower === "mastercard") return "mastercard"
   if (lower === "amex" || lower === "american express") return "amex"
killedBy: mapApiCard normalisation maps a visa card onto the UI shape
statusReason: expected { id: 'pm-1', type: 'bank', …(11) } to deeply equal { id: 'pm-1', type: 'visa', …(11) }

[Killed] ConditionalExpression
src/lib/api/payment-methods.ts:57:7
 function brandToType(brand: string): PaymentMethodType {
   const lower = brand.toLowerCase()
   if (lower === "visa") return "visa"
-  if (lower === "mastercard") return "mastercard"
+  if (true) return "mastercard"
   if (lower === "amex" || lower === "american express") return "amex"
   return "bank"
killedBy: mapApiCard normalisation maps brand amex to type amex
statusReason: expected 'mastercard' to be 'amex' // Object.is equality

[Killed] ConditionalExpression
src/lib/api/payment-methods.ts:57:7
 function brandToType(brand: string): PaymentMethodType {
   const lower = brand.toLowerCase()
   if (lower === "visa") return "visa"
-  if (lower === "mastercard") return "mastercard"
+  if (false) return "mastercard"
   if (lower === "amex" || lower === "american express") return "amex"
   return "bank"
killedBy: mapApiCard normalisation maps brand mastercard to type mastercard
statusReason: expected 'bank' to be 'mastercard' // Object.is equality

[Killed] EqualityOperator
src/lib/api/payment-methods.ts:58:27
   const lower = brand.toLowerCase()
   if (lower === "visa") return "visa"
   if (lower === "mastercard") return "mastercard"
-  if (lower === "amex" || lower === "american express") return "amex"
+  if (lower === "amex" || lower !== "american express") return "amex"
   return "bank"
 }
killedBy: mapApiCard normalisation maps brand American Express to type amex
statusReason: expected 'bank' to be 'amex' // Object.is equality

[Killed] LogicalOperator
src/lib/api/payment-methods.ts:58:7
   const lower = brand.toLowerCase()
   if (lower === "visa") return "visa"
   if (lower === "mastercard") return "mastercard"
-  if (lower === "amex" || lower === "american express") return "amex"
+  if (lower === "amex" && lower === "american express") return "amex"
   return "bank"
 }
killedBy: mapApiCard normalisation maps brand amex to type amex
statusReason: expected 'bank' to be 'amex' // Object.is equality

[Killed] BlockStatement
src/lib/api/payment-methods.ts:62:68
   return "bank"
 }
 
-export function mapApiCard(card: ApiSavedCard): SavedPaymentMethod {
-  return {
-    id: card.id,
-    type: brandToType(card.brand),
-    brandLabel: card.brand.charAt(0).toUpperCase() + card.brand.slice(1),
-    nickname: card.name,
-    last4: card.last4,
-    cardholder: "",
-    expiryMonth: String(card.expMonth).padStart(2, "0"),
-    expiryYear: String(card.expYear),
-    billingAddress: "",
-    status: card.isDefault ? "default" : "active",
-    stripePaymentMethodId: card.stripeCardId,
-    openToAutoPayment: Boolean(card.openToAutoPayment),
-    autoOrderCard: Boolean(card.autoOrderCard),
-  }
-}
+export function mapApiCard(card: ApiSavedCard): SavedPaymentMethod {}
 
 // ── API Client ───────────────────────────────────────────────────────────────
killedBy: mapApiCard normalisation maps a visa card onto the UI shape
statusReason: expected undefined to deeply equal { id: 'pm-1', type: 'visa', …(11) }

[Killed] ObjectLiteral
src/lib/api/payment-methods.ts:63:10
 }
 
 export function mapApiCard(card: ApiSavedCard): SavedPaymentMethod {
-  return {
-    id: card.id,
-    type: brandToType(card.brand),
-    brandLabel: card.brand.charAt(0).toUpperCase() + card.brand.slice(1),
-    nickname: card.name,
-    last4: card.last4,
-    cardholder: "",
-    expiryMonth: String(card.expMonth).padStart(2, "0"),
-    expiryYear: String(card.expYear),
-    billingAddress: "",
-    status: card.isDefault ? "default" : "active",
-    stripePaymentMethodId: card.stripeCardId,
-    openToAutoPayment: Boolean(card.openToAutoPayment),
-    autoOrderCard: Boolean(card.autoOrderCard),
-  }
+  return {}
 }
 
killedBy: mapApiCard normalisation maps a visa card onto the UI shape
statusReason: expected {} to deeply equal { id: 'pm-1', type: 'visa', …(11) }

[Killed] MethodExpression
src/lib/api/payment-methods.ts:66:54
   return {
     id: card.id,
     type: brandToType(card.brand),
-    brandLabel: card.brand.charAt(0).toUpperCase() + card.brand.slice(1),
+    brandLabel: card.brand.charAt(0).toUpperCase() + card.brand,
     nickname: card.name,
     last4: card.last4,
killedBy: mapApiCard normalisation maps a visa card onto the UI shape
statusReason: expected { id: 'pm-1', type: 'visa', …(11) } to deeply equal { id: 'pm-1', type: 'visa', …(11) }

[Killed] ArithmeticOperator
src/lib/api/payment-methods.ts:66:17
   return {
     id: card.id,
     type: brandToType(card.brand),
-    brandLabel: card.brand.charAt(0).toUpperCase() + card.brand.slice(1),
+    brandLabel: card.brand.charAt(0).toUpperCase() - card.brand.slice(1),
     nickname: card.name,
     last4: card.last4,
killedBy: mapApiCard normalisation maps a visa card onto the UI shape
statusReason: expected { id: 'pm-1', type: 'visa', …(11) } to deeply equal { id: 'pm-1', type: 'visa', …(11) }

[Killed] StringLiteral
src/lib/api/payment-methods.ts:73:42
     expiryMonth: String(card.expMonth).padStart(2, "0"),
     expiryYear: String(card.expYear),
     billingAddress: "",
-    status: card.isDefault ? "default" : "active",
+    status: card.isDefault ? "default" : "",
     stripePaymentMethodId: card.stripeCardId,
     openToAutoPayment: Boolean(card.openToAutoPayment),
killedBy: mapApiCard normalisation marks a non-default card as active
statusReason: expected '' to be 'active' // Object.is equality

[Killed] BlockStatement
src/lib/api/payment-methods.ts:83:56
 // ── API Client ───────────────────────────────────────────────────────────────
 
 class PaymentMethodsAPI {
-  async getSavedCards(): Promise<SavedPaymentMethod[]> {
-    const response = await apiClient.get<SavedCardListResponse>("/cards")
-    return response.data.cards.map(mapApiCard)
-  }
+  async getSavedCards(): Promise<SavedPaymentMethod[]> {}
 
   /**
killedBy: paymentMethodsAPI.getSavedCards contract returns every card mapped onto the UI shape
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/lib/api/payment-methods.ts:93:85
    * ignores query strings here. It decides the Stripe mandate (off_session vs
    * on_session) and must match what is later sent to `saveCard`.
    */
-  async createSetupIntent(openToAutoPayment: boolean): Promise<SetupIntentResponse> {
-    const response = await apiClient.post<SetupIntentResponse>(`/cards/setup-intent/${openToAutoPayment}`)
-    return response.data
-  }
+  async createSetupIntent(openToAutoPayment: boolean): Promise<SetupIntentResponse> {}
 
   async saveCard(payload: SaveCardPayload): Promise<SavedPaymentMethod> {
killedBy: paymentMethodsAPI SetupIntent flow puts openToAutoPayment=true in the path, not the query string
statusReason: expected null to be '/backend-api/cards/setup-intent/true' // Object.is equality

[Killed] BlockStatement
src/lib/api/payment-methods.ts:98:73
     return response.data
   }
 
-  async saveCard(payload: SaveCardPayload): Promise<SavedPaymentMethod> {
-    const response = await apiClient.post<ApiSavedCard>("/cards", payload)
-    return mapApiCard(response.data)
-  }
+  async saveCard(payload: SaveCardPayload): Promise<SavedPaymentMethod> {}
 
   async deleteCard(cardId: string): Promise<void> {
killedBy: BuyerPaymentMethodsPage saves a new card through a SetupIntent and never posts raw card data
statusReason: expected "spy" to be called with arguments: [ 'Card added', …(1) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/lib/api/payment-methods.ts:103:51
     return mapApiCard(response.data)
   }
 
-  async deleteCard(cardId: string): Promise<void> {
-    await apiClient.delete(`/cards/${cardId}`)
-  }
+  async deleteCard(cardId: string): Promise<void> {}
 
   async updateNickname(cardId: string, payload: UpdateNicknamePayload): Promise<SavedPaymentMethod> {
killedBy: paymentMethodsAPI card mutations deletes by id with no body
statusReason: expected null to be 'DELETE' // Object.is equality

[Killed] BlockStatement
src/lib/api/payment-methods.ts:107:101
     await apiClient.delete(`/cards/${cardId}`)
   }
 
-  async updateNickname(cardId: string, payload: UpdateNicknamePayload): Promise<SavedPaymentMethod> {
-    const response = await apiClient.patch<ApiSavedCard>(`/cards/${cardId}/nickname`, payload)
-    return mapApiCard(response.data)
-  }
+  async updateNickname(cardId: string, payload: UpdateNicknamePayload): Promise<SavedPaymentMethod> {}
 
   async setDefault(cardId: string): Promise<SavedPaymentMethod> {
killedBy: paymentMethodsAPI card mutations sends only the nickname when renaming
statusReason: expected null to be 'PATCH' // Object.is equality

[Killed] BlockStatement
src/lib/api/payment-methods.ts:112:65
     return mapApiCard(response.data)
   }
 
-  async setDefault(cardId: string): Promise<SavedPaymentMethod> {
-    const response = await apiClient.patch<ApiSavedCard>(`/cards/${cardId}/default`)
-    return mapApiCard(response.data)
-  }
+  async setDefault(cardId: string): Promise<SavedPaymentMethod> {}
 
   /**
killedBy: paymentMethodsAPI card mutations sends no body when making a card the default
statusReason: expected null to be '/backend-api/cards/card-2/default' // Object.is equality

[Killed] BlockStatement
src/lib/api/payment-methods.ts:122:95
    * designation. Dropping it (or promoting a different card away from this one)
    * pauses every standing auto order, so callers must confirm first.
    */
-  async setAutoOrderCard(cardId: string, autoOrderCard: boolean): Promise<SavedPaymentMethod> {
-    const response = await apiClient.patch<ApiSavedCard>(`/cards/${cardId}/auto-order-card`, { autoOrderCard })
-    return mapApiCard(response.data)
-  }
+  async setAutoOrderCard(cardId: string, autoOrderCard: boolean): Promise<SavedPaymentMethod> {}
 
   /**
killedBy: paymentMethodsAPI card mutations sends autoOrderCard=true as the only body field
statusReason: expected null to be '/backend-api/cards/card-3/auto-order-…' // Object.is equality

[Killed] StringLiteral
src/lib/api/payment-methods.ts:123:58
    * pauses every standing auto order, so callers must confirm first.
    */
   async setAutoOrderCard(cardId: string, autoOrderCard: boolean): Promise<SavedPaymentMethod> {
-    const response = await apiClient.patch<ApiSavedCard>(`/cards/${cardId}/auto-order-card`, { autoOrderCard })
+    const response = await apiClient.patch<ApiSavedCard>(``, { autoOrderCard })
     return mapApiCard(response.data)
   }
killedBy: paymentMethodsAPI card mutations sends autoOrderCard=true as the only body field
statusReason: Network Error

[Killed] BlockStatement
src/lib/api/payment-methods.ts:132:91
    * charge happens; the client must confirm the returned clientSecret with
    * Stripe (which may prompt for 3D Secure) before calling `confirmAutoPaymentUpgrade`.
    */
-  async createAutoPaymentUpgradeSetupIntent(cardId: string): Promise<SetupIntentResponse> {
-    const response = await apiClient.post<SetupIntentResponse>(`/cards/${cardId}/auto-payment-upgrade/setup-intent`)
-    return response.data
-  }
+  async createAutoPaymentUpgradeSetupIntent(cardId: string): Promise<SetupIntentResponse> {}
 
   /**
killedBy: paymentMethodsAPI auto payment upgrade creates the upgrade SetupIntent with no body
statusReason: expected null to be '/backend-api/cards/card-1/auto-paymen…' // Object.is equality

[Killed] StringLiteral
src/lib/api/payment-methods.ts:133:64
    * Stripe (which may prompt for 3D Secure) before calling `confirmAutoPaymentUpgrade`.
    */
   async createAutoPaymentUpgradeSetupIntent(cardId: string): Promise<SetupIntentResponse> {
-    const response = await apiClient.post<SetupIntentResponse>(`/cards/${cardId}/auto-payment-upgrade/setup-intent`)
+    const response = await apiClient.post<SetupIntentResponse>(``)
     return response.data
   }
killedBy: paymentMethodsAPI auto payment upgrade creates the upgrade SetupIntent with no body
statusReason: Network Error

[Killed] BlockStatement
src/lib/api/payment-methods.ts:142:103
    * `setup_intent.succeeded` webhook is delayed. The backend re-verifies it
    * with Stripe before flipping `openToAutoPayment`.
    */
-  async confirmAutoPaymentUpgrade(cardId: string, setupIntentId: string): Promise<SavedPaymentMethod> {
-    const response = await apiClient.post<ApiSavedCard>(`/cards/${cardId}/auto-payment-upgrade/confirm`, {
-      setupIntentId,
-    })
-    return mapApiCard(response.data)
-  }
+  async confirmAutoPaymentUpgrade(cardId: string, setupIntentId: string): Promise<SavedPaymentMethod> {}
 }
 
killedBy: paymentMethodsAPI auto payment upgrade confirms the upgrade with only the setup intent id and returns the flipped card
statusReason: expected null to be '/backend-api/cards/card-1/auto-paymen…' // Object.is equality
