[Killed] BooleanLiteral
src/stores/authStore.ts:45:24
       user: null,
       accessToken: null,
       refreshToken: null,
-      isAuthenticated: false,
+      isAuthenticated: true,
       isAdminImpersonating: false,
       isLoading: false,
killedBy: authStore defaults starts every session flag false before any action runs
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/stores/authStore.ts:46:29
       accessToken: null,
       refreshToken: null,
       isAuthenticated: false,
-      isAdminImpersonating: false,
+      isAdminImpersonating: true,
       isLoading: false,
       error: null,
killedBy: authStore defaults starts every session flag false before any action runs
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/stores/authStore.ts:47:18
       refreshToken: null,
       isAuthenticated: false,
       isAdminImpersonating: false,
-      isLoading: false,
+      isLoading: true,
       error: null,
 
killedBy: authStore defaults starts every session flag false before any action runs
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/stores/authStore.ts:50:16
       isLoading: false,
       error: null,
 
-      setUser: (user) =>
-        set({
-          user,
-          isAuthenticated: true,
-          error: null,
-        }),
+      setUser: () => undefined,
 
       setTokens: (accessToken, refreshToken) =>
killedBy: authStore small setters setUser authenticates without touching the tokens
statusReason: expected null to deeply equal { id: 'user-1', name: 'Serhat', …(9) }

[Killed] BooleanLiteral
src/stores/authStore.ts:53:28
       setUser: (user) =>
         set({
           user,
-          isAuthenticated: true,
+          isAuthenticated: false,
           error: null,
         }),
killedBy: authStore small setters setUser authenticates without touching the tokens
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/stores/authStore.ts:57:18
           error: null,
         }),
 
-      setTokens: (accessToken, refreshToken) =>
-        set({
-          accessToken,
-          refreshToken,
-        }),
+      setTokens: () => undefined,
 
       setAuth: (user, accessToken, refreshToken, isAdminImpersonating = false) =>
killedBy: authStore small setters setTokens stores both tokens
statusReason: expected { Object (user, accessToken, ...) } to match object { accessToken: 'access-1', …(1) }
(13 matching properties omitted from actual)

[Killed] ArrowFunction
src/stores/authStore.ts:63:16
           refreshToken,
         }),
 
-      setAuth: (user, accessToken, refreshToken, isAdminImpersonating = false) =>
-        set({
-          user,
-          accessToken,
-          refreshToken,
-          isAuthenticated: true,
-          isAdminImpersonating,
-          error: null,
-        }),
+      setAuth: () => undefined,
 
       setIsAdminImpersonating: (isAdminImpersonating) => set({ isAdminImpersonating }),
killedBy: authStore setAuth marks the session authenticated and clears any previous error
statusReason: expected { Object (user, accessToken, ...) } to match object { user: { id: 'user-1', …(10) }, …(4) }
(10 matching properties omitted from actual)

[Killed] BooleanLiteral
src/stores/authStore.ts:63:73
           refreshToken,
         }),
 
-      setAuth: (user, accessToken, refreshToken, isAdminImpersonating = false) =>
+      setAuth: (user, accessToken, refreshToken, isAdminImpersonating = true) =>
         set({
           user,
killedBy: authStore setAuth defaults isAdminImpersonating to false
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/stores/authStore.ts:68:28
           user,
           accessToken,
           refreshToken,
-          isAuthenticated: true,
+          isAuthenticated: false,
           isAdminImpersonating,
           error: null,
killedBy: BuyerOrdersProvider / context hooks exposes every selector/action and keeps selectors in sync with the sliced state
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ArrowFunction
src/stores/authStore.ts:73:32
           error: null,
         }),
 
-      setIsAdminImpersonating: (isAdminImpersonating) => set({ isAdminImpersonating }),
+      setIsAdminImpersonating: () => undefined,
 
       clearAuth: () =>
killedBy: authStore small setters setIsAdminImpersonating toggles the flag on its own
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/stores/authStore.ts:75:18
 
       setIsAdminImpersonating: (isAdminImpersonating) => set({ isAdminImpersonating }),
 
-      clearAuth: () =>
-        set({
-          user: null,
-          accessToken: null,
-          refreshToken: null,
-          isAuthenticated: false,
-          isAdminImpersonating: false,
-          error: null,
-        }),
+      clearAuth: () => undefined,
 
       logout: async () => {
killedBy: authStore small setters setUser authenticates without touching the tokens
statusReason: expected 'access-2' to be null

[Killed] BlockStatement
src/stores/authStore.ts:87:13
 
       logout: async () => {
         const currentState = get()
-        try {
-          if (currentState.refreshToken && currentState.accessToken) {
-            const { authAPIDirect } = await import("@/lib/api/auth-direct")
-            await authAPIDirect.logout({ refreshToken: currentState.refreshToken }, currentState.accessToken)
-          }
-        } catch {
+        try {} catch {
           // Hata olsa bile local state'i temizle
         } finally {
killedBy: authStore logout calls the backend with the refresh token and bearer access token
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/stores/authStore.ts:88:15
       logout: async () => {
         const currentState = get()
         try {
-          if (currentState.refreshToken && currentState.accessToken) {
+          if (true) {
             const { authAPIDirect } = await import("@/lib/api/auth-direct")
             await authAPIDirect.logout({ refreshToken: currentState.refreshToken }, currentState.accessToken)
killedBy: authStore logout issues only one logout request when called twice in sequence
statusReason: expected [ { …(2) }, …(1) ] to have a length of 1 but got 2

[Killed] BlockStatement
src/stores/authStore.ts:88:70
       logout: async () => {
         const currentState = get()
         try {
-          if (currentState.refreshToken && currentState.accessToken) {
-            const { authAPIDirect } = await import("@/lib/api/auth-direct")
-            await authAPIDirect.logout({ refreshToken: currentState.refreshToken }, currentState.accessToken)
-          }
+          if (currentState.refreshToken && currentState.accessToken) {}
         } catch {
           // Hata olsa bile local state'i temizle
killedBy: authStore logout calls the backend with the refresh token and bearer access token
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/stores/authStore.ts:94:19
           }
         } catch {
           // Hata olsa bile local state'i temizle
-        } finally {
-          // Clear auth state
-          set({
-            user: null,
-            accessToken: null,
-            refreshToken: null,
-            isAuthenticated: false,
-            isAdminImpersonating: false,
-            error: null,
-          })
-
-          // Clear cart state
-          const { useCartStore } = await import("./cartStore")
-          useCartStore.getState().resetCart()
-
-          // Router push operation will be handled in components
-        }
+        } finally {}
       },
 
killedBy: authStore logout clears the session state
statusReason: expected { Object (user, accessToken, ...) } to match object { user: null, accessToken: null, …(4) }
(9 matching properties omitted from actual)

[Killed] CallExpression
src/stores/authStore.ts:107:11
 
           // Clear cart state
           const { useCartStore } = await import("./cartStore")
-          useCartStore.getState().resetCart()
+          ;
 
           // Router push operation will be handled in components
killedBy: authStore logout resets the cart store so the next user never sees the previous cart
statusReason: expected { …(13) } to match object { items: [], cartCount: +0, …(2) }
(9 matching properties omitted from actual)

[Killed] ArrowFunction
src/stores/authStore.ts:113:19
         }
       },
 
-      setLoading: (loading) =>
-        set({
-          isLoading: loading,
-        }),
+      setLoading: () => undefined,
 
       setError: (error) =>
killedBy: authStore small setters setLoading and setError are independent of the session flags
statusReason: expected { Object (user, accessToken, ...) } to match object { isLoading: true, …(2) }
(23 matching properties omitted from actual)

[Killed] ArrowFunction
src/stores/authStore.ts:118:17
           isLoading: loading,
         }),
 
-      setError: (error) =>
-        set({
-          error,
-        }),
+      setError: () => undefined,
     }),
     {
killedBy: authStore small setters setLoading and setError are independent of the session flags
statusReason: expected { Object (user, accessToken, ...) } to match object { isLoading: true, …(2) }
(23 matching properties omitted from actual)

[Killed] StringLiteral
src/stores/authStore.ts:124:13
         }),
     }),
     {
-      name: "auth-storage",
+      name: "",
       // biome-ignore lint/suspicious/noExplicitAny: Zustand persist storage type compatibility
       storage: cookieStorage as any,
killedBy: authStore clearAuth leaves an emptied auth-storage cookie behind rather than deleting it
statusReason: expected null not to be null

[Killed] ArrowFunction
src/stores/authStore.ts:127:19
       name: "auth-storage",
       // biome-ignore lint/suspicious/noExplicitAny: Zustand persist storage type compatibility
       storage: cookieStorage as any,
-      partialize: (state) => ({
-        user: state.user,
-        accessToken: state.accessToken,
-        refreshToken: state.refreshToken,
-        isAuthenticated: state.isAuthenticated,
-        isAdminImpersonating: state.isAdminImpersonating,
-      }),
+      partialize: () => undefined,
       onRehydrateStorage: () => (state) => {
         // After rehydration, ensure isAuthenticated matches user presence
killedBy: authStore clearAuth leaves an emptied auth-storage cookie behind rather than deleting it
statusReason: Cannot read properties of undefined (reading 'user')

[Killed] ObjectLiteral
src/stores/authStore.ts:127:31
       name: "auth-storage",
       // biome-ignore lint/suspicious/noExplicitAny: Zustand persist storage type compatibility
       storage: cookieStorage as any,
-      partialize: (state) => ({
-        user: state.user,
-        accessToken: state.accessToken,
-        refreshToken: state.refreshToken,
-        isAuthenticated: state.isAuthenticated,
-        isAdminImpersonating: state.isAdminImpersonating,
-      }),
+      partialize: (state) => ({}),
       onRehydrateStorage: () => (state) => {
         // After rehydration, ensure isAuthenticated matches user presence
killedBy: authStore clearAuth leaves an emptied auth-storage cookie behind rather than deleting it
statusReason: expected undefined to be null

[Killed] ArrowFunction
src/stores/authStore.ts:134:27
         isAuthenticated: state.isAuthenticated,
         isAdminImpersonating: state.isAdminImpersonating,
       }),
-      onRehydrateStorage: () => (state) => {
-        // After rehydration, ensure isAuthenticated matches user presence
-        if (state) {
-          if (state.user && state.accessToken) {
-            state.isAuthenticated = true
-          } else {
-            state.isAuthenticated = false
-            state.isAdminImpersonating = false
-          }
-        }
-      },
+      onRehydrateStorage: () => undefined,
     },
   ),
killedBy: authStore onRehydrateStorage marks the session authenticated when both user and accessToken survived rehydration
statusReason: onRehydrateStorage did not return a listener

[Killed] BlockStatement
src/stores/authStore.ts:134:44
         isAuthenticated: state.isAuthenticated,
         isAdminImpersonating: state.isAdminImpersonating,
       }),
-      onRehydrateStorage: () => (state) => {
-        // After rehydration, ensure isAuthenticated matches user presence
-        if (state) {
-          if (state.user && state.accessToken) {
-            state.isAuthenticated = true
-          } else {
-            state.isAuthenticated = false
-            state.isAdminImpersonating = false
-          }
-        }
-      },
+      onRehydrateStorage: () => (state) => {},
     },
   ),
killedBy: authStore onRehydrateStorage marks the session authenticated when both user and accessToken survived rehydration
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/stores/authStore.ts:136:13
       }),
       onRehydrateStorage: () => (state) => {
         // After rehydration, ensure isAuthenticated matches user presence
-        if (state) {
+        if (true) {
           if (state.user && state.accessToken) {
             state.isAuthenticated = true
killedBy: authStore onRehydrateStorage does nothing when rehydration produced no state at all
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ConditionalExpression
src/stores/authStore.ts:136:13
       }),
       onRehydrateStorage: () => (state) => {
         // After rehydration, ensure isAuthenticated matches user presence
-        if (state) {
+        if (false) {
           if (state.user && state.accessToken) {
             state.isAuthenticated = true
killedBy: authStore onRehydrateStorage marks the session authenticated when both user and accessToken survived rehydration
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/stores/authStore.ts:137:15
       onRehydrateStorage: () => (state) => {
         // After rehydration, ensure isAuthenticated matches user presence
         if (state) {
-          if (state.user && state.accessToken) {
+          if (true) {
             state.isAuthenticated = true
           } else {
killedBy: authStore onRehydrateStorage clears isAuthenticated and isAdminImpersonating when the user and token did not both survive
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/stores/authStore.ts:137:15
       onRehydrateStorage: () => (state) => {
         // After rehydration, ensure isAuthenticated matches user presence
         if (state) {
-          if (state.user && state.accessToken) {
+          if (state.user || state.accessToken) {
             state.isAuthenticated = true
           } else {
killedBy: authStore onRehydrateStorage does not authenticate a user with no access token, even with a stale isAuthenticated flag
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/stores/authStore.ts:138:37
         // After rehydration, ensure isAuthenticated matches user presence
         if (state) {
           if (state.user && state.accessToken) {
-            state.isAuthenticated = true
+            state.isAuthenticated = false
           } else {
             state.isAuthenticated = false
killedBy: authStore onRehydrateStorage marks the session authenticated when both user and accessToken survived rehydration
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/stores/authStore.ts:139:18
         if (state) {
           if (state.user && state.accessToken) {
             state.isAuthenticated = true
-          } else {
-            state.isAuthenticated = false
-            state.isAdminImpersonating = false
-          }
+          } else {}
         }
       },
killedBy: authStore onRehydrateStorage clears isAuthenticated and isAdminImpersonating when the user and token did not both survive
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/stores/authStore.ts:140:37
           if (state.user && state.accessToken) {
             state.isAuthenticated = true
           } else {
-            state.isAuthenticated = false
+            state.isAuthenticated = true
             state.isAdminImpersonating = false
           }
killedBy: authStore onRehydrateStorage clears isAuthenticated and isAdminImpersonating when the user and token did not both survive
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/stores/authStore.ts:141:42
             state.isAuthenticated = true
           } else {
             state.isAuthenticated = false
-            state.isAdminImpersonating = false
+            state.isAdminImpersonating = true
           }
         }
killedBy: authStore onRehydrateStorage clears isAuthenticated and isAdminImpersonating when the user and token did not both survive
statusReason: expected true to be false // Object.is equality
