[Killed] ArrayDeclaration
features/checkout/hooks/useFinalReview.ts:19:52
   onPlaceOrder: () => Promise<void>
 }
 
-const SUCCESSFUL_PAYMENT_INTENT_STATUSES = new Set(["succeeded", "processing", "requires_capture"])
+const SUCCESSFUL_PAYMENT_INTENT_STATUSES = new Set([])
 const POLL_INTERVAL_MS = 3000
 const MAX_PAYMENT_STATUS_RETRIES = 3
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected { orderId: 'order-1', …(6) } to match object { orderId: 'order-1', …(2) }
(4 matching properties omitted from actual)

[Killed] StringLiteral
features/checkout/hooks/useFinalReview.ts:19:66
   onPlaceOrder: () => Promise<void>
 }
 
-const SUCCESSFUL_PAYMENT_INTENT_STATUSES = new Set(["succeeded", "processing", "requires_capture"])
+const SUCCESSFUL_PAYMENT_INTENT_STATUSES = new Set(["succeeded", "", "requires_capture"])
 const POLL_INTERVAL_MS = 3000
 const MAX_PAYMENT_STATUS_RETRIES = 3
killedBy: useFinalReview — status polling gives up after three attempts and falls back to Stripe's own intent status
statusReason: expected { orderId: 'order-1', …(6) } to match object { status: 'PAYMENT_PROCESSING', …(1) }
(5 matching properties omitted from actual)

[Survived] StringLiteral
features/checkout/hooks/useFinalReview.ts:24:37
 const MAX_PAYMENT_STATUS_RETRIES = 3
 /** Sentinel returned by `pollPaymentStatus` when the session died mid-poll, so the caller
  * cannot mistake an unconfirmed payment for a successful one. */
-const PAYMENT_STATUS_AUTH_FAILURE = "auth-failure"
+const PAYMENT_STATUS_AUTH_FAILURE = ""
 
 function mapPaymentIntentStatusToOrderStatus(paymentIntentStatus: string): string {

[Killed] BlockStatement
features/checkout/hooks/useFinalReview.ts:26:83
  * cannot mistake an unconfirmed payment for a successful one. */
 const PAYMENT_STATUS_AUTH_FAILURE = "auth-failure"
 
-function mapPaymentIntentStatusToOrderStatus(paymentIntentStatus: string): string {
-  if (paymentIntentStatus === "canceled") {
-    return "PAYMENT_FAILED"
-  }
-
-  if (paymentIntentStatus === "succeeded" || paymentIntentStatus === "requires_capture") {
-    return "PAYMENT_SUCCESS"
-  }
-
-  if (paymentIntentStatus === "processing") {
-    return "PAYMENT_PROCESSING"
-  }
-
-  return "PENDING_PAYMENT"
-}
+function mapPaymentIntentStatusToOrderStatus(paymentIntentStatus: string): string {}
 
 function wait(ms: number): Promise<void> {
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected { orderId: 'order-1', …(6) } to match object { orderId: 'order-1', …(2) }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:27:7
 const PAYMENT_STATUS_AUTH_FAILURE = "auth-failure"
 
 function mapPaymentIntentStatusToOrderStatus(paymentIntentStatus: string): string {
-  if (paymentIntentStatus === "canceled") {
+  if (false) {
     return "PAYMENT_FAILED"
   }
killedBy: useFinalReview — declines and failures still reaches the confirmation screen, flagged as failed, when the intent is canceled
statusReason: expected { orderId: 'order-1', …(6) } to match object { status: 'PAYMENT_FAILED', …(1) }
(5 matching properties omitted from actual)

[Killed] EqualityOperator
features/checkout/hooks/useFinalReview.ts:27:7
 const PAYMENT_STATUS_AUTH_FAILURE = "auth-failure"
 
 function mapPaymentIntentStatusToOrderStatus(paymentIntentStatus: string): string {
-  if (paymentIntentStatus === "canceled") {
+  if (paymentIntentStatus !== "canceled") {
     return "PAYMENT_FAILED"
   }
killedBy: FinalReview places the order, confirms the card and advances to the confirmation step
statusReason: expected 'PAYMENT_FAILED' to be 'PAYMENT_SUCCESS' // Object.is equality

[Killed] StringLiteral
features/checkout/hooks/useFinalReview.ts:28:12
 
 function mapPaymentIntentStatusToOrderStatus(paymentIntentStatus: string): string {
   if (paymentIntentStatus === "canceled") {
-    return "PAYMENT_FAILED"
+    return ""
   }
 
killedBy: useFinalReview — declines and failures still reaches the confirmation screen, flagged as failed, when the intent is canceled
statusReason: expected { orderId: 'order-1', …(6) } to match object { status: 'PAYMENT_FAILED', …(1) }
(5 matching properties omitted from actual)

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:31:7
     return "PAYMENT_FAILED"
   }
 
-  if (paymentIntentStatus === "succeeded" || paymentIntentStatus === "requires_capture") {
+  if (false) {
     return "PAYMENT_SUCCESS"
   }
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected { orderId: 'order-1', …(6) } to match object { orderId: 'order-1', …(2) }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:31:7
     return "PAYMENT_FAILED"
   }
 
-  if (paymentIntentStatus === "succeeded" || paymentIntentStatus === "requires_capture") {
+  if (false || paymentIntentStatus === "requires_capture") {
     return "PAYMENT_SUCCESS"
   }
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected { orderId: 'order-1', …(6) } to match object { orderId: 'order-1', …(2) }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:35:7
     return "PAYMENT_SUCCESS"
   }
 
-  if (paymentIntentStatus === "processing") {
+  if (false) {
     return "PAYMENT_PROCESSING"
   }
killedBy: useFinalReview — status polling gives up after three attempts and falls back to Stripe's own intent status
statusReason: expected { orderId: 'order-1', …(6) } to match object { status: 'PAYMENT_PROCESSING', …(1) }
(5 matching properties omitted from actual)

[Killed] EqualityOperator
features/checkout/hooks/useFinalReview.ts:35:7
     return "PAYMENT_SUCCESS"
   }
 
-  if (paymentIntentStatus === "processing") {
+  if (paymentIntentStatus !== "processing") {
     return "PAYMENT_PROCESSING"
   }
killedBy: useFinalReview — status polling gives up after three attempts and falls back to Stripe's own intent status
statusReason: expected { orderId: 'order-1', …(6) } to match object { status: 'PAYMENT_PROCESSING', …(1) }
(5 matching properties omitted from actual)

[NoCoverage] StringLiteral
features/checkout/hooks/useFinalReview.ts:39:10
     return "PAYMENT_PROCESSING"
   }
 
-  return "PENDING_PAYMENT"
+  return ""
 }
 

[Killed] BlockStatement
features/checkout/hooks/useFinalReview.ts:42:42
   return "PENDING_PAYMENT"
 }
 
-function wait(ms: number): Promise<void> {
-  return new Promise((resolve) => {
-    setTimeout(resolve, ms)
-  })
-}
+function wait(ms: number): Promise<void> {}
 
 export function useFinalReview(): UseFinalReviewResult {
killedBy: useFinalReview — status polling waits for a real timer between attempts instead of retrying immediately
statusReason: expected "spy" to be called 1 times, but got 3 times

[Killed] BlockStatement
features/checkout/hooks/useFinalReview.ts:43:35
 }
 
 function wait(ms: number): Promise<void> {
-  return new Promise((resolve) => {
-    setTimeout(resolve, ms)
-  })
+  return new Promise((resolve) => {})
 }
 
killedBy: useFinalReview — happy path treats requires_capture as a successful charge
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] CallExpression
features/checkout/hooks/useFinalReview.ts:44:5
 
 function wait(ms: number): Promise<void> {
   return new Promise((resolve) => {
-    setTimeout(resolve, ms)
+    ;
   })
 }
killedBy: useFinalReview — happy path treats requires_capture as a successful charge
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
features/checkout/hooks/useFinalReview.ts:67:56
   const { hasAutoOrderItems, autoOrderLines } = useCheckoutAutoOrder()
   const stripe = useStripe()
 
-  const [isPlacingOrder, setIsPlacingOrder] = useState(false)
+  const [isPlacingOrder, setIsPlacingOrder] = useState(true)
   // Re-entrancy guard: a ref, because a state update is asynchronous and would not close the
   // window between two synchronous calls (form onSubmit, Enter key, a caller that ignores
killedBy: useFinalReview — double submit disables the submit button for the whole in-flight order
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
features/checkout/hooks/useFinalReview.ts:71:36
   // Re-entrancy guard: a ref, because a state update is asynchronous and would not close the
   // window between two synchronous calls (form onSubmit, Enter key, a caller that ignores
   // `submitDisabled`) — each of which would otherwise create a second order and a second charge.
-  const isPlacingOrderRef = useRef(false)
+  const isPlacingOrderRef = useRef(true)
 
   const submitDisabled = useMemo(() => {
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
features/checkout/hooks/useFinalReview.ts:73:40
   // `submitDisabled`) — each of which would otherwise create a second order and a second charge.
   const isPlacingOrderRef = useRef(false)
 
-  const submitDisabled = useMemo(() => {
-    if (isPlacingOrder) return true
-    if (paymentMethod.type === "card" && !stripe) return true
-    if (paymentMethod.type === "card" && !paymentMethodId) return true
-    return false
-  }, [isPlacingOrder, paymentMethod.type, paymentMethodId, stripe])
+  const submitDisabled = useMemo(() => {}, [isPlacingOrder, paymentMethod.type, paymentMethodId, stripe])
 
   const pollPaymentStatus = useCallback(async (paymentIntentId: string): Promise<string | null> => {
killedBy: useFinalReview — 3D Secure creates no order at all when the Stripe SDK never loaded
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
features/checkout/hooks/useFinalReview.ts:74:32
   const isPlacingOrderRef = useRef(false)
 
   const submitDisabled = useMemo(() => {
-    if (isPlacingOrder) return true
+    if (isPlacingOrder) return false
     if (paymentMethod.type === "card" && !stripe) return true
     if (paymentMethod.type === "card" && !paymentMethodId) return true
killedBy: useFinalReview — double submit disables the submit button for the whole in-flight order
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:74:9
   const isPlacingOrderRef = useRef(false)
 
   const submitDisabled = useMemo(() => {
-    if (isPlacingOrder) return true
+    if (false) return true
     if (paymentMethod.type === "card" && !stripe) return true
     if (paymentMethod.type === "card" && !paymentMethodId) return true
killedBy: useFinalReview — double submit disables the submit button for the whole in-flight order
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
features/checkout/hooks/useFinalReview.ts:75:42
 
   const submitDisabled = useMemo(() => {
     if (isPlacingOrder) return true
-    if (paymentMethod.type === "card" && !stripe) return true
+    if (paymentMethod.type === "card" && stripe) return true
     if (paymentMethod.type === "card" && !paymentMethodId) return true
     return false
killedBy: useFinalReview — 3D Secure creates no order at all when the Stripe SDK never loaded
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
features/checkout/hooks/useFinalReview.ts:75:9
 
   const submitDisabled = useMemo(() => {
     if (isPlacingOrder) return true
-    if (paymentMethod.type === "card" && !stripe) return true
+    if (paymentMethod.type !== "card" && !stripe) return true
     if (paymentMethod.type === "card" && !paymentMethodId) return true
     return false
killedBy: useFinalReview — 3D Secure creates no order at all when the Stripe SDK never loaded
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
features/checkout/hooks/useFinalReview.ts:76:42
   const submitDisabled = useMemo(() => {
     if (isPlacingOrder) return true
     if (paymentMethod.type === "card" && !stripe) return true
-    if (paymentMethod.type === "card" && !paymentMethodId) return true
+    if (paymentMethod.type === "card" && paymentMethodId) return true
     return false
   }, [isPlacingOrder, paymentMethod.type, paymentMethodId, stripe])
killedBy: useFinalReview — double submit disables the submit button for the whole in-flight order
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
features/checkout/hooks/useFinalReview.ts:76:9
   const submitDisabled = useMemo(() => {
     if (isPlacingOrder) return true
     if (paymentMethod.type === "card" && !stripe) return true
-    if (paymentMethod.type === "card" && !paymentMethodId) return true
+    if (paymentMethod.type === "card" || !paymentMethodId) return true
     return false
   }, [isPlacingOrder, paymentMethod.type, paymentMethodId, stripe])
killedBy: useFinalReview — double submit disables the submit button for the whole in-flight order
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
features/checkout/hooks/useFinalReview.ts:77:12
     if (isPlacingOrder) return true
     if (paymentMethod.type === "card" && !stripe) return true
     if (paymentMethod.type === "card" && !paymentMethodId) return true
-    return false
+    return true
   }, [isPlacingOrder, paymentMethod.type, paymentMethodId, stripe])
 
killedBy: useFinalReview — double submit disables the submit button for the whole in-flight order
statusReason: expected true to be false // Object.is equality

[Killed] ArrayDeclaration
features/checkout/hooks/useFinalReview.ts:78:6
     if (paymentMethod.type === "card" && !stripe) return true
     if (paymentMethod.type === "card" && !paymentMethodId) return true
     return false
-  }, [isPlacingOrder, paymentMethod.type, paymentMethodId, stripe])
+  }, [])
 
   const pollPaymentStatus = useCallback(async (paymentIntentId: string): Promise<string | null> => {
killedBy: useFinalReview — double submit disables the submit button for the whole in-flight order
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
features/checkout/hooks/useFinalReview.ts:81:80
   }, [isPlacingOrder, paymentMethod.type, paymentMethodId, stripe])
 
   const pollPaymentStatus = useCallback(async (paymentIntentId: string): Promise<string | null> => {
-    for (let attempt = 1; attempt <= MAX_PAYMENT_STATUS_RETRIES; attempt += 1) {
-      try {
-        const paymentStatusResponse = await ordersAPI.getPaymentStatus(paymentIntentId)
-        const normalizedStatus = paymentStatusResponse.status.toLowerCase()
-
-        if (normalizedStatus === "canceled" || normalizedStatus === "succeeded") {
-          return normalizedStatus
-        }
-      } catch (error: unknown) {
-        if (isAuthHandledError(error) || isAuthErrorStatus(extractErrorStatus(error))) {
-          // The session expired: the axios interceptor already logs the buyer out, so stop
-          // immediately instead of burning the remaining attempts and falling back to Stripe's
-          // optimistic status.
-          return PAYMENT_STATUS_AUTH_FAILURE
-        }
-
-        // Transient failure (5xx, network): keep retrying, but do not swallow it silently.
-        console.warn("Payment status polling attempt failed", error)
-      }
-
-      if (attempt < MAX_PAYMENT_STATUS_RETRIES) {
-        await wait(POLL_INTERVAL_MS)
-      }
-    }
+    for (let attempt = 1; attempt <= MAX_PAYMENT_STATUS_RETRIES; attempt += 1) {}
 
     return null
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] AssignmentOperator
features/checkout/hooks/useFinalReview.ts:81:66
   }, [isPlacingOrder, paymentMethod.type, paymentMethodId, stripe])
 
   const pollPaymentStatus = useCallback(async (paymentIntentId: string): Promise<string | null> => {
-    for (let attempt = 1; attempt <= MAX_PAYMENT_STATUS_RETRIES; attempt += 1) {
+    for (let attempt = 1; attempt <= MAX_PAYMENT_STATUS_RETRIES; attempt -= 1) {
       try {
         const paymentStatusResponse = await ordersAPI.getPaymentStatus(paymentIntentId)
killedBy: useFinalReview — happy path treats requires_capture as a successful charge
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
features/checkout/hooks/useFinalReview.ts:82:11
 
   const pollPaymentStatus = useCallback(async (paymentIntentId: string): Promise<string | null> => {
     for (let attempt = 1; attempt <= MAX_PAYMENT_STATUS_RETRIES; attempt += 1) {
-      try {
-        const paymentStatusResponse = await ordersAPI.getPaymentStatus(paymentIntentId)
-        const normalizedStatus = paymentStatusResponse.status.toLowerCase()
-
-        if (normalizedStatus === "canceled" || normalizedStatus === "succeeded") {
-          return normalizedStatus
-        }
-      } catch (error: unknown) {
+      try {} catch (error: unknown) {
         if (isAuthHandledError(error) || isAuthErrorStatus(extractErrorStatus(error))) {
           // The session expired: the axios interceptor already logs the buyer out, so stop
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] MethodExpression
features/checkout/hooks/useFinalReview.ts:84:34
     for (let attempt = 1; attempt <= MAX_PAYMENT_STATUS_RETRIES; attempt += 1) {
       try {
         const paymentStatusResponse = await ordersAPI.getPaymentStatus(paymentIntentId)
-        const normalizedStatus = paymentStatusResponse.status.toLowerCase()
+        const normalizedStatus = paymentStatusResponse.status.toUpperCase()
 
         if (normalizedStatus === "canceled" || normalizedStatus === "succeeded") {
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected "spy" to be called 1 times, but got 3 times

[Killed] EqualityOperator
features/checkout/hooks/useFinalReview.ts:86:48
         const paymentStatusResponse = await ordersAPI.getPaymentStatus(paymentIntentId)
         const normalizedStatus = paymentStatusResponse.status.toLowerCase()
 
-        if (normalizedStatus === "canceled" || normalizedStatus === "succeeded") {
+        if (normalizedStatus === "canceled" || normalizedStatus !== "succeeded") {
           return normalizedStatus
         }
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected "spy" to be called 1 times, but got 3 times

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:86:13
         const paymentStatusResponse = await ordersAPI.getPaymentStatus(paymentIntentId)
         const normalizedStatus = paymentStatusResponse.status.toLowerCase()
 
-        if (normalizedStatus === "canceled" || normalizedStatus === "succeeded") {
+        if (false) {
           return normalizedStatus
         }
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected "spy" to be called 1 times, but got 3 times

[Killed] BlockStatement
features/checkout/hooks/useFinalReview.ts:89:32
         if (normalizedStatus === "canceled" || normalizedStatus === "succeeded") {
           return normalizedStatus
         }
-      } catch (error: unknown) {
-        if (isAuthHandledError(error) || isAuthErrorStatus(extractErrorStatus(error))) {
-          // The session expired: the axios interceptor already logs the buyer out, so stop
-          // immediately instead of burning the remaining attempts and falling back to Stripe's
-          // optimistic status.
-          return PAYMENT_STATUS_AUTH_FAILURE
-        }
-
-        // Transient failure (5xx, network): keep retrying, but do not swallow it silently.
-        console.warn("Payment status polling attempt failed", error)
-      }
+      } catch (error: unknown) {}
 
       if (attempt < MAX_PAYMENT_STATUS_RETRIES) {
killedBy: useFinalReview — status polling stops polling on a 401 and refuses to mark the order paid
statusReason: expected "spy" to be called 1 times, but got 3 times

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:90:13
           return normalizedStatus
         }
       } catch (error: unknown) {
-        if (isAuthHandledError(error) || isAuthErrorStatus(extractErrorStatus(error))) {
+        if (true) {
           // The session expired: the axios interceptor already logs the buyer out, so stop
           // immediately instead of burning the remaining attempts and falling back to Stripe's
killedBy: useFinalReview — status polling recovers when only the first poll fails
statusReason: expected "spy" to be called 2 times, but got 1 times

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:90:13
           return normalizedStatus
         }
       } catch (error: unknown) {
-        if (isAuthHandledError(error) || isAuthErrorStatus(extractErrorStatus(error))) {
+        if (false) {
           // The session expired: the axios interceptor already logs the buyer out, so stop
           // immediately instead of burning the remaining attempts and falling back to Stripe's
killedBy: useFinalReview — status polling stops polling on a 401 and refuses to mark the order paid
statusReason: expected "spy" to be called 1 times, but got 3 times

[Killed] EqualityOperator
features/checkout/hooks/useFinalReview.ts:101:11
         console.warn("Payment status polling attempt failed", error)
       }
 
-      if (attempt < MAX_PAYMENT_STATUS_RETRIES) {
+      if (attempt >= MAX_PAYMENT_STATUS_RETRIES) {
         await wait(POLL_INTERVAL_MS)
       }
killedBy: useFinalReview — status polling waits for a real timer between attempts instead of retrying immediately
statusReason: expected "spy" to be called 1 times, but got 3 times

[Killed] BlockStatement
features/checkout/hooks/useFinalReview.ts:101:49
         console.warn("Payment status polling attempt failed", error)
       }
 
-      if (attempt < MAX_PAYMENT_STATUS_RETRIES) {
-        await wait(POLL_INTERVAL_MS)
-      }
+      if (attempt < MAX_PAYMENT_STATUS_RETRIES) {}
     }
 
killedBy: useFinalReview — status polling waits for a real timer between attempts instead of retrying immediately
statusReason: expected "spy" to be called 1 times, but got 3 times

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:110:9
   }, [])
 
   const onPlaceOrder = useCallback(async () => {
-    if (isPlacingOrderRef.current) {
+    if (false) {
       return
     }
killedBy: useFinalReview — double submit ignores a direct re-entrant call instead of placing a second order
statusReason: expected "spy" to be called 1 times, but got 2 times

[Killed] BlockStatement
features/checkout/hooks/useFinalReview.ts:110:36
   }, [])
 
   const onPlaceOrder = useCallback(async () => {
-    if (isPlacingOrderRef.current) {
-      return
-    }
+    if (isPlacingOrderRef.current) {}
     isPlacingOrderRef.current = true
 
killedBy: useFinalReview — double submit ignores a direct re-entrant call instead of placing a second order
statusReason: expected "spy" to be called 1 times, but got 2 times

[Killed] BooleanLiteral
features/checkout/hooks/useFinalReview.ts:113:33
     if (isPlacingOrderRef.current) {
       return
     }
-    isPlacingOrderRef.current = true
+    isPlacingOrderRef.current = false
 
     try {
killedBy: useFinalReview — double submit ignores a direct re-entrant call instead of placing a second order
statusReason: expected "spy" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:116:11
     isPlacingOrderRef.current = true
 
     try {
-      if (!orderPayload) {
+      if (false) {
         showToast.error("Order information is missing. Please go back and review your shipping details.")
         return
killedBy: useFinalReview — declines and failures refuses to start without an order payload
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
features/checkout/hooks/useFinalReview.ts:116:26
     isPlacingOrderRef.current = true
 
     try {
-      if (!orderPayload) {
-        showToast.error("Order information is missing. Please go back and review your shipping details.")
-        return
-      }
+      if (!orderPayload) {}
 
       // Everything that decides whether the charge can happen at all is checked BEFORE the order
killedBy: useFinalReview — declines and failures refuses to start without an order payload
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] StringLiteral
features/checkout/hooks/useFinalReview.ts:117:25
 
     try {
       if (!orderPayload) {
-        showToast.error("Order information is missing. Please go back and review your shipping details.")
+        showToast.error("")
         return
       }
killedBy: useFinalReview — declines and failures refuses to start without an order payload
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   "Order information is missing. Please go back and review your shipping details.",

[Killed] BlockStatement
features/checkout/hooks/useFinalReview.ts:123:42
 
       // Everything that decides whether the charge can happen at all is checked BEFORE the order
       // is created, so a missing SDK or card can never leave an unpaid order behind.
-      if (paymentMethod.type === "card") {
-        if (!paymentMethodId) {
-          showToast.error("Payment details are missing. Please go back to Billing and re-enter your card.")
-          return
-        }
-
-        if (!stripe) {
-          showToast.error("Stripe is not ready. Please refresh and try again.")
-          return
-        }
-      }
+      if (paymentMethod.type === "card") {}
 
       setIsPlacingOrder(true)
killedBy: useFinalReview — 3D Secure creates no order at all when the Stripe SDK never loaded
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      Object {

[Killed] EqualityOperator
features/checkout/hooks/useFinalReview.ts:123:11
 
       // Everything that decides whether the charge can happen at all is checked BEFORE the order
       // is created, so a missing SDK or card can never leave an unpaid order behind.
-      if (paymentMethod.type === "card") {
+      if (paymentMethod.type !== "card") {
         if (!paymentMethodId) {
           showToast.error("Payment details are missing. Please go back to Billing and re-enter your card.")
killedBy: useFinalReview — 3D Secure creates no order at all when the Stripe SDK never loaded
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      Object {

[Killed] BlockStatement
features/checkout/hooks/useFinalReview.ts:124:31
       // Everything that decides whether the charge can happen at all is checked BEFORE the order
       // is created, so a missing SDK or card can never leave an unpaid order behind.
       if (paymentMethod.type === "card") {
-        if (!paymentMethodId) {
-          showToast.error("Payment details are missing. Please go back to Billing and re-enter your card.")
-          return
-        }
+        if (!paymentMethodId) {}
 
         if (!stripe) {
killedBy: useFinalReview — 3D Secure creates no order when the card payment method is missing
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   "Payment details are missing. Please go back to Billing and re-enter your card.",

[Killed] BooleanLiteral
features/checkout/hooks/useFinalReview.ts:124:13
       // Everything that decides whether the charge can happen at all is checked BEFORE the order
       // is created, so a missing SDK or card can never leave an unpaid order behind.
       if (paymentMethod.type === "card") {
-        if (!paymentMethodId) {
+        if (paymentMethodId) {
           showToast.error("Payment details are missing. Please go back to Billing and re-enter your card.")
           return
killedBy: FinalReview places the order, confirms the card and advances to the confirmation step
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] StringLiteral
features/checkout/hooks/useFinalReview.ts:125:27
       // is created, so a missing SDK or card can never leave an unpaid order behind.
       if (paymentMethod.type === "card") {
         if (!paymentMethodId) {
-          showToast.error("Payment details are missing. Please go back to Billing and re-enter your card.")
+          showToast.error("")
           return
         }
killedBy: useFinalReview — 3D Secure creates no order when the card payment method is missing
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   "Payment details are missing. Please go back to Billing and re-enter your card.",
