[Killed] BlockStatement
features/checkout/hooks/useFinalReview.ts:129:22
           return
         }
 
-        if (!stripe) {
-          showToast.error("Stripe is not ready. Please refresh and try again.")
-          return
-        }
+        if (!stripe) {}
       }
 
killedBy: useFinalReview — 3D Secure creates no order at all when the Stripe SDK never loaded
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      Object {

[Killed] BooleanLiteral
features/checkout/hooks/useFinalReview.ts:129:13
           return
         }
 
-        if (!stripe) {
+        if (stripe) {
           showToast.error("Stripe is not ready. Please refresh and try again.")
           return
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] StringLiteral
features/checkout/hooks/useFinalReview.ts:130:27
         }
 
         if (!stripe) {
-          showToast.error("Stripe is not ready. Please refresh and try again.")
+          showToast.error("")
           return
         }
killedBy: useFinalReview — 3D Secure creates no order at all when the Stripe SDK never loaded
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   "Stripe is not ready. Please refresh and try again.",

[Killed] BooleanLiteral
features/checkout/hooks/useFinalReview.ts:135:25
         }
       }
 
-      setIsPlacingOrder(true)
+      setIsPlacingOrder(false)
       const payload = {
         ...orderPayload,
killedBy: useFinalReview — double submit disables the submit button for the whole in-flight order
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:138:17
       setIsPlacingOrder(true)
       const payload = {
         ...orderPayload,
-        cartId: cartId || "",
+        cartId: false,
       }
 
killedBy: useFinalReview — double submit uses the current cartId instead of a stale one captured on the first render
statusReason: expected false to be 'cart-2' // Object.is equality

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:138:17
       setIsPlacingOrder(true)
       const payload = {
         ...orderPayload,
-        cartId: cartId || "",
+        cartId: true,
       }
 
killedBy: useFinalReview — double submit uses the current cartId instead of a stale one captured on the first render
statusReason: expected true to be 'cart-2' // Object.is equality

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:141:11
         cartId: cartId || "",
       }
 
-      if (paymentMethod.type === "card") {
+      if (false) {
         payload.paymentMethodId = paymentMethodId
 
killedBy: useFinalReview — declines and failures stops before creating the order when a card that must be saved has no name
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] EqualityOperator
features/checkout/hooks/useFinalReview.ts:141:11
         cartId: cartId || "",
       }
 
-      if (paymentMethod.type === "card") {
+      if (paymentMethod.type !== "card") {
         payload.paymentMethodId = paymentMethodId
 
killedBy: useFinalReview — declines and failures stops before creating the order when a card that must be saved has no name
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] EqualityOperator
features/checkout/hooks/useFinalReview.ts:144:27
       if (paymentMethod.type === "card") {
         payload.paymentMethodId = paymentMethodId
 
-        const isNewCard = selectedSavedCardId === ""
+        const isNewCard = selectedSavedCardId !== ""
         // Repeat items can only be charged later from a saved card, so the
         // backend refuses a new card that is not saved with an off-session mandate.
killedBy: useFinalReview — happy path snapshots the repeat lines before handing the buyer to the confirmation screen
statusReason: expected [] to deeply equal [ 'up-auto' ]

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:144:27
       if (paymentMethod.type === "card") {
         payload.paymentMethodId = paymentMethodId
 
-        const isNewCard = selectedSavedCardId === ""
+        const isNewCard = false
         // Repeat items can only be charged later from a saved card, so the
         // backend refuses a new card that is not saved with an off-session mandate.
killedBy: useFinalReview — declines and failures stops before creating the order when a card that must be saved has no name
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:147:30
         const isNewCard = selectedSavedCardId === ""
         // Repeat items can only be charged later from a saved card, so the
         // backend refuses a new card that is not saved with an off-session mandate.
-        const mustSaveCard = saveCard || (isNewCard && hasAutoOrderItems)
+        const mustSaveCard = true
 
         if (mustSaveCard) {
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] LogicalOperator
features/checkout/hooks/useFinalReview.ts:147:43
         const isNewCard = selectedSavedCardId === ""
         // Repeat items can only be charged later from a saved card, so the
         // backend refuses a new card that is not saved with an off-session mandate.
-        const mustSaveCard = saveCard || (isNewCard && hasAutoOrderItems)
+        const mustSaveCard = saveCard || (isNewCard || hasAutoOrderItems)
 
         if (mustSaveCard) {
killedBy: useFinalReview — happy path snapshots the repeat lines before handing the buyer to the confirmation screen
statusReason: expected [] to deeply equal [ 'up-auto' ]

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:149:13
         // backend refuses a new card that is not saved with an off-session mandate.
         const mustSaveCard = saveCard || (isNewCard && hasAutoOrderItems)
 
-        if (mustSaveCard) {
+        if (true) {
           const trimmedCardName = cardName.trim()
           if (!trimmedCardName) {
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:149:13
         // backend refuses a new card that is not saved with an off-session mandate.
         const mustSaveCard = saveCard || (isNewCard && hasAutoOrderItems)
 
-        if (mustSaveCard) {
+        if (false) {
           const trimmedCardName = cardName.trim()
           if (!trimmedCardName) {
killedBy: useFinalReview — declines and failures stops before creating the order when a card that must be saved has no name
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] MethodExpression
features/checkout/hooks/useFinalReview.ts:150:35
         const mustSaveCard = saveCard || (isNewCard && hasAutoOrderItems)
 
         if (mustSaveCard) {
-          const trimmedCardName = cardName.trim()
+          const trimmedCardName = cardName
           if (!trimmedCardName) {
             showToast.error("Please enter a card name to save this card.")
killedBy: useFinalReview — declines and failures stops before creating the order when a card that must be saved has no name
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
features/checkout/hooks/useFinalReview.ts:151:33
 
         if (mustSaveCard) {
           const trimmedCardName = cardName.trim()
-          if (!trimmedCardName) {
-            showToast.error("Please enter a card name to save this card.")
-            return
-          }
+          if (!trimmedCardName) {}
           payload.cardSave = true
           payload.cardName = trimmedCardName
killedBy: useFinalReview — declines and failures stops before creating the order when a card that must be saved has no name
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BooleanLiteral
features/checkout/hooks/useFinalReview.ts:151:15
 
         if (mustSaveCard) {
           const trimmedCardName = cardName.trim()
-          if (!trimmedCardName) {
+          if (trimmedCardName) {
             showToast.error("Please enter a card name to save this card.")
             return
killedBy: useFinalReview — declines and failures stops before creating the order when a card that must be saved has no name
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BooleanLiteral
features/checkout/hooks/useFinalReview.ts:155:30
             showToast.error("Please enter a card name to save this card.")
             return
           }
-          payload.cardSave = true
+          payload.cardSave = false
           payload.cardName = trimmedCardName
           payload.cardOpenToAutoPayment = hasAutoOrderItems || newCardAutoPaymentConsent
killedBy: useFinalReview — payload saves a new card with the buyer's off-session consent
statusReason: expected { addressId: 'address-1', …(8) } to match object { paymentMethodId: 'pm_new', …(4) }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:157:43
           }
           payload.cardSave = true
           payload.cardName = trimmedCardName
-          payload.cardOpenToAutoPayment = hasAutoOrderItems || newCardAutoPaymentConsent
+          payload.cardOpenToAutoPayment = true
           payload.cardAutoOrderCard = hasAutoOrderItems || newCardAutoPaymentConsent
         } else {
killedBy: useFinalReview — payload does not open a new card to off-session payments when nothing needs it
statusReason: expected { addressId: 'address-1', …(8) } to match object { cardOpenToAutoPayment: false, …(1) }
(7 matching properties omitted from actual)

[Killed] LogicalOperator
features/checkout/hooks/useFinalReview.ts:157:43
           }
           payload.cardSave = true
           payload.cardName = trimmedCardName
-          payload.cardOpenToAutoPayment = hasAutoOrderItems || newCardAutoPaymentConsent
+          payload.cardOpenToAutoPayment = hasAutoOrderItems && newCardAutoPaymentConsent
           payload.cardAutoOrderCard = hasAutoOrderItems || newCardAutoPaymentConsent
         } else {
killedBy: useFinalReview — payload saves a new card with the buyer's off-session consent
statusReason: expected { addressId: 'address-1', …(8) } to match object { paymentMethodId: 'pm_new', …(4) }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:158:39
           payload.cardSave = true
           payload.cardName = trimmedCardName
           payload.cardOpenToAutoPayment = hasAutoOrderItems || newCardAutoPaymentConsent
-          payload.cardAutoOrderCard = hasAutoOrderItems || newCardAutoPaymentConsent
+          payload.cardAutoOrderCard = false
         } else {
           payload.cardSave = false
killedBy: useFinalReview — payload saves a new card with the buyer's off-session consent
statusReason: expected { addressId: 'address-1', …(8) } to match object { paymentMethodId: 'pm_new', …(4) }
(4 matching properties omitted from actual)

[Killed] LogicalOperator
features/checkout/hooks/useFinalReview.ts:158:39
           payload.cardSave = true
           payload.cardName = trimmedCardName
           payload.cardOpenToAutoPayment = hasAutoOrderItems || newCardAutoPaymentConsent
-          payload.cardAutoOrderCard = hasAutoOrderItems || newCardAutoPaymentConsent
+          payload.cardAutoOrderCard = hasAutoOrderItems && newCardAutoPaymentConsent
         } else {
           payload.cardSave = false
killedBy: useFinalReview — payload saves a new card with the buyer's off-session consent
statusReason: expected { addressId: 'address-1', …(8) } to match object { paymentMethodId: 'pm_new', …(4) }
(4 matching properties omitted from actual)

[Killed] BlockStatement
features/checkout/hooks/useFinalReview.ts:159:16
           payload.cardName = trimmedCardName
           payload.cardOpenToAutoPayment = hasAutoOrderItems || newCardAutoPaymentConsent
           payload.cardAutoOrderCard = hasAutoOrderItems || newCardAutoPaymentConsent
-        } else {
-          payload.cardSave = false
-          payload.cardName = ""
-        }
+        } else {}
 
         // Only consulted for a saved card that is not open to auto payments yet.
killedBy: useFinalReview — payload sends the cart id and the saved card as a plain paymentMethodId
statusReason: expected { addressId: 'address-1', …(4) } to match object { addressId: 'address-1', …(4) }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
features/checkout/hooks/useFinalReview.ts:160:30
           payload.cardOpenToAutoPayment = hasAutoOrderItems || newCardAutoPaymentConsent
           payload.cardAutoOrderCard = hasAutoOrderItems || newCardAutoPaymentConsent
         } else {
-          payload.cardSave = false
+          payload.cardSave = true
           payload.cardName = ""
         }
killedBy: useFinalReview — payload sends the cart id and the saved card as a plain paymentMethodId
statusReason: expected { addressId: 'address-1', …(6) } to match object { addressId: 'address-1', …(4) }
(2 matching properties omitted from actual)

[Killed] LogicalOperator
features/checkout/hooks/useFinalReview.ts:165:13
         }
 
         // Only consulted for a saved card that is not open to auto payments yet.
-        if (!isNewCard && hasAutoOrderItems && autoOrderConsent) {
+        if (!isNewCard || hasAutoOrderItems && autoOrderConsent) {
           payload.openToAutoOrder = true
         }
killedBy: useFinalReview — payload never sets the off-session upgrade flag for a brand-new card, even with auto-order consent
statusReason: expected { addressId: 'address-1', …(9) } to not have property "openToAutoOrder"

[Killed] LogicalOperator
features/checkout/hooks/useFinalReview.ts:165:13
         }
 
         // Only consulted for a saved card that is not open to auto payments yet.
-        if (!isNewCard && hasAutoOrderItems && autoOrderConsent) {
+        if (!isNewCard && hasAutoOrderItems || autoOrderConsent) {
           payload.openToAutoOrder = true
         }
killedBy: useFinalReview — payload omits the off-session upgrade when consent was not given
statusReason: expected { addressId: 'address-1', …(7) } to not have property "openToAutoOrder"

[Killed] BooleanLiteral
features/checkout/hooks/useFinalReview.ts:166:37
 
         // Only consulted for a saved card that is not open to auto payments yet.
         if (!isNewCard && hasAutoOrderItems && autoOrderConsent) {
-          payload.openToAutoOrder = true
+          payload.openToAutoOrder = false
         }
       }
killedBy: useFinalReview — payload upgrades a saved card to off-session only when the buyer consented
statusReason: expected { addressId: 'address-1', …(7) } to match object { openToAutoOrder: true, …(1) }
(6 matching properties omitted from actual)

[Killed] ArrowFunction
features/checkout/hooks/useFinalReview.ts:174:53
 
       // Snapshot before the cart is cleared, so the confirmation screen can wait
       // for exactly these schedules to appear
-      setAutoOrderUserProductIds(autoOrderLines.map((line) => line.userProductId))
+      setAutoOrderUserProductIds(autoOrderLines.map(() => undefined))
 
       let finalOrderStatus = response.status
killedBy: useFinalReview — happy path snapshots the repeat lines before handing the buyer to the confirmation screen
statusReason: expected [ undefined ] to deeply equal [ 'up-auto' ]

[Killed] BooleanLiteral
features/checkout/hooks/useFinalReview.ts:178:31
 
       let finalOrderStatus = response.status
       let paymentStatus = response.status
-      let isPaymentCanceled = false
+      let isPaymentCanceled = true
 
       if (paymentMethod.type === "card") {
killedBy: useFinalReview — payload skips every card-specific field for a non-card payment method
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:180:11
       let paymentStatus = response.status
       let isPaymentCanceled = false
 
-      if (paymentMethod.type === "card") {
+      if (true) {
         if (!response.clientSecret) {
           // Backend contract violation: the order row exists but no payment can be started.
killedBy: useFinalReview — payload skips every card-specific field for a non-card payment method
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      "pi_1_secret_abc",

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:181:13
       let isPaymentCanceled = false
 
       if (paymentMethod.type === "card") {
-        if (!response.clientSecret) {
+        if (false) {
           // Backend contract violation: the order row exists but no payment can be started.
           // Say so plainly instead of a vague toast, and record the unpaid order.
killedBy: useFinalReview — declines and failures tells the buyer the order is unpaid when the backend returns no client secret
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BooleanLiteral
features/checkout/hooks/useFinalReview.ts:181:13
       let isPaymentCanceled = false
 
       if (paymentMethod.type === "card") {
-        if (!response.clientSecret) {
+        if (response.clientSecret) {
           // Backend contract violation: the order row exists but no payment can be started.
           // Say so plainly instead of a vague toast, and record the unpaid order.
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected "spy" to be called with arguments: [ 'pi_1_secret_abc', …(1) ]

Received: 



Number of calls: 0

[Killed] StringLiteral
features/checkout/hooks/useFinalReview.ts:187:49
           showToast.error(
             `Payment could not be initiated. Order ${response.orderId} was created but not paid — please contact support before trying again.`,
           )
-          setOrderResult({ ...response, status: "PENDING_PAYMENT", paymentStatus: "PENDING_PAYMENT" })
+          setOrderResult({ ...response, status: "", paymentStatus: "PENDING_PAYMENT" })
           return
         }
killedBy: useFinalReview — declines and failures tells the buyer the order is unpaid when the backend returns no client secret
statusReason: expected { orderId: 'order-1', …(6) } to match object { orderId: 'order-1', …(2) }
(4 matching properties omitted from actual)

[Killed] BooleanLiteral
features/checkout/hooks/useFinalReview.ts:192:33
         }
 
         // Both were verified before the order was created; kept as type guards.
-        if (!paymentMethodId || !stripe) {
+        if (!paymentMethodId || stripe) {
           showToast.error("Stripe is not ready. Please refresh and try again.")
           return
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected "spy" to be called with arguments: [ 'pi_1_secret_abc', …(1) ]

Received: 



Number of calls: 0

[Killed] BooleanLiteral
features/checkout/hooks/useFinalReview.ts:192:13
         }
 
         // Both were verified before the order was created; kept as type guards.
-        if (!paymentMethodId || !stripe) {
+        if (paymentMethodId || !stripe) {
           showToast.error("Stripe is not ready. Please refresh and try again.")
           return
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected "spy" to be called with arguments: [ 'pi_1_secret_abc', …(1) ]

Received: 



Number of calls: 0

[Killed] ObjectLiteral
features/checkout/hooks/useFinalReview.ts:197:83
           return
         }
 
-        const cardResult = await stripe.confirmCardPayment(response.clientSecret, {
-          payment_method: paymentMethodId,
-        })
+        const cardResult = await stripe.confirmCardPayment(response.clientSecret, {})
         if (cardResult.error) {
           showToast.error(cardResult.error.message || "Payment failed. Please try again.")
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected "spy" to be called with arguments: [ 'pi_1_secret_abc', …(1) ]

Received: 

  1st spy call:

  Array [
    "pi_1_secret_abc",

[Killed] BlockStatement
features/checkout/hooks/useFinalReview.ts:200:31
         const cardResult = await stripe.confirmCardPayment(response.clientSecret, {
           payment_method: paymentMethodId,
         })
-        if (cardResult.error) {
-          showToast.error(cardResult.error.message || "Payment failed. Please try again.")
-          return
-        }
+        if (cardResult.error) {}
 
         if (!cardResult.paymentIntent) {
killedBy: useFinalReview — 3D Secure keeps the cart intact when the buyer abandons the 3DS challenge
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   "We are unable to authenticate your payment method.",

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:200:13
         const cardResult = await stripe.confirmCardPayment(response.clientSecret, {
           payment_method: paymentMethodId,
         })
-        if (cardResult.error) {
+        if (true) {
           showToast.error(cardResult.error.message || "Payment failed. Please try again.")
           return
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:201:27
           payment_method: paymentMethodId,
         })
         if (cardResult.error) {
-          showToast.error(cardResult.error.message || "Payment failed. Please try again.")
+          showToast.error(true)
           return
         }
killedBy: useFinalReview — 3D Secure keeps the cart intact when the buyer abandons the 3DS challenge
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   "We are unable to authenticate your payment method.",

[Killed] LogicalOperator
features/checkout/hooks/useFinalReview.ts:201:27
           payment_method: paymentMethodId,
         })
         if (cardResult.error) {
-          showToast.error(cardResult.error.message || "Payment failed. Please try again.")
+          showToast.error(cardResult.error.message && "Payment failed. Please try again.")
           return
         }
killedBy: useFinalReview — 3D Secure keeps the cart intact when the buyer abandons the 3DS challenge
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   "We are unable to authenticate your payment method.",

[Killed] BlockStatement
features/checkout/hooks/useFinalReview.ts:205:40
           return
         }
 
-        if (!cardResult.paymentIntent) {
-          showToast.error("Payment could not be completed. Please use a different card and try again.")
-          return
-        }
+        if (!cardResult.paymentIntent) {}
 
         const initialPaymentIntentStatus = cardResult.paymentIntent.status
killedBy: useFinalReview — declines and failures bails out when Stripe returns neither an error nor a payment intent
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   "Payment could not be completed. Please use a different card and try again.",

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:205:13
           return
         }
 
-        if (!cardResult.paymentIntent) {
+        if (true) {
           showToast.error("Payment could not be completed. Please use a different card and try again.")
           return
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] StringLiteral
features/checkout/hooks/useFinalReview.ts:206:27
         }
 
         if (!cardResult.paymentIntent) {
-          showToast.error("Payment could not be completed. Please use a different card and try again.")
+          showToast.error("")
           return
         }
killedBy: useFinalReview — declines and failures bails out when Stripe returns neither an error nor a payment intent
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   "Payment could not be completed. Please use a different card and try again.",

[Killed] BlockStatement
features/checkout/hooks/useFinalReview.ts:213:67
         const initialPaymentIntentStatus = cardResult.paymentIntent.status
         const terminalPolledStatus = await pollPaymentStatus(cardResult.paymentIntent.id)
 
-        if (terminalPolledStatus === PAYMENT_STATUS_AUTH_FAILURE) {
-          showToast.error(
-            `Your session expired before the payment could be confirmed. Order ${response.orderId} is not confirmed — please sign in again and check it before paying twice.`,
-          )
-          setOrderResult({ ...response, status: "PENDING_PAYMENT", paymentStatus: "unknown" })
-          return
-        }
+        if (terminalPolledStatus === PAYMENT_STATUS_AUTH_FAILURE) {}
 
         const resolvedPaymentIntentStatus = terminalPolledStatus ?? initialPaymentIntentStatus
killedBy: useFinalReview — status polling stops polling on a 401 and refuses to mark the order paid
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:213:13
         const initialPaymentIntentStatus = cardResult.paymentIntent.status
         const terminalPolledStatus = await pollPaymentStatus(cardResult.paymentIntent.id)
 
-        if (terminalPolledStatus === PAYMENT_STATUS_AUTH_FAILURE) {
+        if (false) {
           showToast.error(
             `Your session expired before the payment could be confirmed. Order ${response.orderId} is not confirmed — please sign in again and check it before paying twice.`,
killedBy: useFinalReview — status polling stops polling on a 401 and refuses to mark the order paid
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] ObjectLiteral
features/checkout/hooks/useFinalReview.ts:217:26
           showToast.error(
             `Your session expired before the payment could be confirmed. Order ${response.orderId} is not confirmed — please sign in again and check it before paying twice.`,
           )
-          setOrderResult({ ...response, status: "PENDING_PAYMENT", paymentStatus: "unknown" })
+          setOrderResult({})
           return
         }
killedBy: useFinalReview — status polling stops polling on a 401 and refuses to mark the order paid
statusReason: expected {} to match object { status: 'PENDING_PAYMENT', …(1) }

[Killed] StringLiteral
features/checkout/hooks/useFinalReview.ts:217:83
           showToast.error(
             `Your session expired before the payment could be confirmed. Order ${response.orderId} is not confirmed — please sign in again and check it before paying twice.`,
           )
-          setOrderResult({ ...response, status: "PENDING_PAYMENT", paymentStatus: "unknown" })
+          setOrderResult({ ...response, status: "PENDING_PAYMENT", paymentStatus: "" })
           return
         }
killedBy: useFinalReview — status polling stops polling on a 401 and refuses to mark the order paid
statusReason: expected { orderId: 'order-1', …(6) } to match object { status: 'PENDING_PAYMENT', …(1) }
(5 matching properties omitted from actual)

[Killed] LogicalOperator
features/checkout/hooks/useFinalReview.ts:221:45
           return
         }
 
-        const resolvedPaymentIntentStatus = terminalPolledStatus ?? initialPaymentIntentStatus
+        const resolvedPaymentIntentStatus = terminalPolledStatus && initialPaymentIntentStatus
         paymentStatus = resolvedPaymentIntentStatus
 
killedBy: useFinalReview — happy path treats requires_capture as a successful charge
statusReason: expected { orderId: 'order-1', …(6) } to match object { status: 'PAYMENT_SUCCESS', …(1) }
(5 matching properties omitted from actual)

[Killed] LogicalOperator
features/checkout/hooks/useFinalReview.ts:225:11
         paymentStatus = resolvedPaymentIntentStatus
 
         if (
-          !SUCCESSFUL_PAYMENT_INTENT_STATUSES.has(resolvedPaymentIntentStatus) &&
-          resolvedPaymentIntentStatus !== "canceled"
+          !SUCCESSFUL_PAYMENT_INTENT_STATUSES.has(resolvedPaymentIntentStatus) || resolvedPaymentIntentStatus !== "canceled"
         ) {
           finalOrderStatus = "PENDING_PAYMENT"
killedBy: FinalReview places the order, confirms the card and advances to the confirmation step
statusReason: expected 'PENDING_PAYMENT' to be 'PAYMENT_SUCCESS' // Object.is equality
