[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:225:11
         paymentStatus = resolvedPaymentIntentStatus
 
         if (
-          !SUCCESSFUL_PAYMENT_INTENT_STATUSES.has(resolvedPaymentIntentStatus) &&
-          resolvedPaymentIntentStatus !== "canceled"
+          true
         ) {
           finalOrderStatus = "PENDING_PAYMENT"
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected { orderId: 'order-1', …(6) } to match object { orderId: 'order-1', …(2) }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:226:11
 
         if (
           !SUCCESSFUL_PAYMENT_INTENT_STATUSES.has(resolvedPaymentIntentStatus) &&
-          resolvedPaymentIntentStatus !== "canceled"
+          true
         ) {
           finalOrderStatus = "PENDING_PAYMENT"
killedBy: useFinalReview — declines and failures still reaches the confirmation screen, flagged as failed, when the intent is canceled
statusReason: expected { orderId: 'order-1', …(6) } to match object { status: 'PAYMENT_FAILED', …(1) }
(5 matching properties omitted from actual)

[Killed] EqualityOperator
features/checkout/hooks/useFinalReview.ts:226:11
 
         if (
           !SUCCESSFUL_PAYMENT_INTENT_STATUSES.has(resolvedPaymentIntentStatus) &&
-          resolvedPaymentIntentStatus !== "canceled"
+          resolvedPaymentIntentStatus === "canceled"
         ) {
           finalOrderStatus = "PENDING_PAYMENT"
killedBy: useFinalReview — declines and failures still reaches the confirmation screen, flagged as failed, when the intent is canceled
statusReason: expected { orderId: 'order-1', …(6) } to match object { status: 'PAYMENT_FAILED', …(1) }
(5 matching properties omitted from actual)

[Survived] BlockStatement
features/checkout/hooks/useFinalReview.ts:227:11
         if (
           !SUCCESSFUL_PAYMENT_INTENT_STATUSES.has(resolvedPaymentIntentStatus) &&
           resolvedPaymentIntentStatus !== "canceled"
-        ) {
-          finalOrderStatus = "PENDING_PAYMENT"
-        } else {
+        ) {} else {
           finalOrderStatus = mapPaymentIntentStatusToOrderStatus(resolvedPaymentIntentStatus)
         }

[Killed] StringLiteral
features/checkout/hooks/useFinalReview.ts:228:30
           !SUCCESSFUL_PAYMENT_INTENT_STATUSES.has(resolvedPaymentIntentStatus) &&
           resolvedPaymentIntentStatus !== "canceled"
         ) {
-          finalOrderStatus = "PENDING_PAYMENT"
+          finalOrderStatus = ""
         } else {
           finalOrderStatus = mapPaymentIntentStatusToOrderStatus(resolvedPaymentIntentStatus)
killedBy: useFinalReview — status polling marks the order pending payment when neither the poll nor Stripe reached a good state
statusReason: expected { orderId: 'order-1', …(6) } to match object { status: 'PENDING_PAYMENT' }
(6 matching properties omitted from actual)

[Killed] BlockStatement
features/checkout/hooks/useFinalReview.ts:229:16
           resolvedPaymentIntentStatus !== "canceled"
         ) {
           finalOrderStatus = "PENDING_PAYMENT"
-        } else {
-          finalOrderStatus = mapPaymentIntentStatusToOrderStatus(resolvedPaymentIntentStatus)
-        }
+        } else {}
 
         isPaymentCanceled = resolvedPaymentIntentStatus === "canceled"
killedBy: FinalReview places the order, confirms the card and advances to the confirmation step
statusReason: expected 'PENDING_PAYMENT' to be 'PAYMENT_SUCCESS' // Object.is equality

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:233:29
           finalOrderStatus = mapPaymentIntentStatusToOrderStatus(resolvedPaymentIntentStatus)
         }
 
-        isPaymentCanceled = resolvedPaymentIntentStatus === "canceled"
+        isPaymentCanceled = true
       }
 
killedBy: FinalReview places the order, confirms the card and advances to the confirmation step
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] EqualityOperator
features/checkout/hooks/useFinalReview.ts:233:29
           finalOrderStatus = mapPaymentIntentStatusToOrderStatus(resolvedPaymentIntentStatus)
         }
 
-        isPaymentCanceled = resolvedPaymentIntentStatus === "canceled"
+        isPaymentCanceled = resolvedPaymentIntentStatus !== "canceled"
       }
 
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:236:11
         isPaymentCanceled = resolvedPaymentIntentStatus === "canceled"
       }
 
-      if (isPaymentCanceled) {
+      if (true) {
         showToast.error(`Order placed but payment was canceled. Order ID: ${response.orderId}`)
       } else {
killedBy: FinalReview places the order, confirms the card and advances to the confirmation step
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
features/checkout/hooks/useFinalReview.ts:236:30
         isPaymentCanceled = resolvedPaymentIntentStatus === "canceled"
       }
 
-      if (isPaymentCanceled) {
-        showToast.error(`Order placed but payment was canceled. Order ID: ${response.orderId}`)
-      } else {
+      if (isPaymentCanceled) {} else {
         showToast.success(`Order placed successfully. Order ID: ${response.orderId}`)
       }
killedBy: useFinalReview — declines and failures still reaches the confirmation screen, flagged as failed, when the intent is canceled
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
features/checkout/hooks/useFinalReview.ts:238:14
 
       if (isPaymentCanceled) {
         showToast.error(`Order placed but payment was canceled. Order ID: ${response.orderId}`)
-      } else {
-        showToast.success(`Order placed successfully. Order ID: ${response.orderId}`)
-      }
+      } else {}
 
       setOrderResult({ ...response, status: finalOrderStatus, paymentStatus })
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] CallExpression
features/checkout/hooks/useFinalReview.ts:243:7
       }
 
       setOrderResult({ ...response, status: finalOrderStatus, paymentStatus })
-      nextStep()
+      ;
     } catch (error: unknown) {
       const maybeError = error as { response?: { data?: { message?: string } } }
killedBy: FinalReview places the order, confirms the card and advances to the confirmation step
statusReason: expected 4 to be 5 // Object.is equality

[Killed] BlockStatement
features/checkout/hooks/useFinalReview.ts:244:30
 
       setOrderResult({ ...response, status: finalOrderStatus, paymentStatus })
       nextStep()
-    } catch (error: unknown) {
-      const maybeError = error as { response?: { data?: { message?: string } } }
-      showToast.error(maybeError.response?.data?.message || "Failed to place order. Please try again.")
-    } finally {
+    } catch (error: unknown) {} finally {
       isPlacingOrderRef.current = false
       setIsPlacingOrder(false)
killedBy: useFinalReview — declines and failures creates no order and never touches Stripe when the backend rejects with 409
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
features/checkout/hooks/useFinalReview.ts:246:23
       nextStep()
     } catch (error: unknown) {
       const maybeError = error as { response?: { data?: { message?: string } } }
-      showToast.error(maybeError.response?.data?.message || "Failed to place order. Please try again.")
+      showToast.error(false)
     } finally {
       isPlacingOrderRef.current = false
killedBy: useFinalReview — declines and failures creates no order and never touches Stripe when the backend rejects with 409
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   "One or more items are out of stock",

[Killed] OptionalChaining
features/checkout/hooks/useFinalReview.ts:246:23
       nextStep()
     } catch (error: unknown) {
       const maybeError = error as { response?: { data?: { message?: string } } }
-      showToast.error(maybeError.response?.data?.message || "Failed to place order. Please try again.")
+      showToast.error(maybeError.response?.data.message || "Failed to place order. Please try again.")
     } finally {
       isPlacingOrderRef.current = false
killedBy: useFinalReview — declines and failures uses a generic message when the backend failure has a response but no body at all
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] BlockStatement
features/checkout/hooks/useFinalReview.ts:247:15
     } catch (error: unknown) {
       const maybeError = error as { response?: { data?: { message?: string } } }
       showToast.error(maybeError.response?.data?.message || "Failed to place order. Please try again.")
-    } finally {
-      isPlacingOrderRef.current = false
-      setIsPlacingOrder(false)
-    }
+    } finally {}
   }, [
     autoOrderConsent,
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
features/checkout/hooks/useFinalReview.ts:248:35
       const maybeError = error as { response?: { data?: { message?: string } } }
       showToast.error(maybeError.response?.data?.message || "Failed to place order. Please try again.")
     } finally {
-      isPlacingOrderRef.current = false
+      isPlacingOrderRef.current = true
       setIsPlacingOrder(false)
     }
killedBy: useFinalReview — double submit allows a fresh order after a previous one fully completed
statusReason: expected "spy" to be called 2 times, but got 1 times

[Killed] BooleanLiteral
features/checkout/hooks/useFinalReview.ts:249:25
       showToast.error(maybeError.response?.data?.message || "Failed to place order. Please try again.")
     } finally {
       isPlacingOrderRef.current = false
-      setIsPlacingOrder(false)
+      setIsPlacingOrder(true)
     }
   }, [
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected true to be false // Object.is equality
