[Killed] BlockStatement
products/product-detail/hooks/usePurchaseCalculator.ts:40:53
   stockCount: number
 }
 
-const parsePrice = (priceString: string): number => {
-  if (!priceString) return 0
-  return Number.parseFloat(priceString.replace(/[$,]/g, "")) || 0
-}
+const parsePrice = (priceString: string): number => {}
 
 const resolveBulkPricing = (bulkPricing: BulkPricingOption[], quantity: number) => {
killedBy: usePurchaseCalculator tier resolution picks the first tier for the smallest quantity
statusReason: expected undefined to be 100 // Object.is equality

[Killed] BooleanLiteral
products/product-detail/hooks/usePurchaseCalculator.ts:41:7
 }
 
 const parsePrice = (priceString: string): number => {
-  if (!priceString) return 0
+  if (priceString) return 0
   return Number.parseFloat(priceString.replace(/[$,]/g, "")) || 0
 }
killedBy: usePurchaseCalculator tier resolution picks the first tier for the smallest quantity
statusReason: expected +0 to be 100 // Object.is equality

[Killed] ConditionalExpression
products/product-detail/hooks/usePurchaseCalculator.ts:41:7
 }
 
 const parsePrice = (priceString: string): number => {
-  if (!priceString) return 0
+  if (true) return 0
   return Number.parseFloat(priceString.replace(/[$,]/g, "")) || 0
 }
killedBy: usePurchaseCalculator tier resolution picks the first tier for the smallest quantity
statusReason: expected +0 to be 100 // Object.is equality

[Killed] ConditionalExpression
products/product-detail/hooks/usePurchaseCalculator.ts:42:10
 
 const parsePrice = (priceString: string): number => {
   if (!priceString) return 0
-  return Number.parseFloat(priceString.replace(/[$,]/g, "")) || 0
+  return false
 }
 
killedBy: usePurchaseCalculator tier resolution picks the first tier for the smallest quantity
statusReason: expected false to be 100 // Object.is equality

[Killed] ConditionalExpression
products/product-detail/hooks/usePurchaseCalculator.ts:42:10
 
 const parsePrice = (priceString: string): number => {
   if (!priceString) return 0
-  return Number.parseFloat(priceString.replace(/[$,]/g, "")) || 0
+  return true
 }
 
killedBy: usePurchaseCalculator tier resolution picks the first tier for the smallest quantity
statusReason: expected true to be 100 // Object.is equality

[Killed] BlockStatement
products/product-detail/hooks/usePurchaseCalculator.ts:45:84
   return Number.parseFloat(priceString.replace(/[$,]/g, "")) || 0
 }
 
-const resolveBulkPricing = (bulkPricing: BulkPricingOption[], quantity: number) => {
-  const sortedBulk = [...bulkPricing].sort((a, b) => {
-    const getMin = (range: string) => parseInt(range.split("-")[0].replace(/\+/g, ""), 10) || 0
-    return getMin(b.range) - getMin(a.range)
-  })
-
-  for (const tier of sortedBulk) {
-    const range = tier.range.toLowerCase()
-    if (range.includes("+")) {
-      const min = parseInt(range.replace(/\+/g, ""), 10)
-      if (quantity >= min) return tier
-    } else if (range.includes("-")) {
-      const [min, max] = range.split("-").map((value) => parseInt(value, 10))
-      if (quantity >= min && quantity <= max) return tier
-    } else if (range.includes("1 unit")) {
-      if (quantity === 1) return tier
-    }
-  }
-
-  return bulkPricing.find((tier) => tier.selected) || bulkPricing[0]
-}
+const resolveBulkPricing = (bulkPricing: BulkPricingOption[], quantity: number) => {}
 
 export const usePurchaseCalculator = ({
killedBy: usePurchaseCalculator tier resolution picks the first tier for the smallest quantity
statusReason: expected undefined to be '1-9' // Object.is equality

[Killed] MethodExpression
products/product-detail/hooks/usePurchaseCalculator.ts:46:22
 }
 
 const resolveBulkPricing = (bulkPricing: BulkPricingOption[], quantity: number) => {
-  const sortedBulk = [...bulkPricing].sort((a, b) => {
-    const getMin = (range: string) => parseInt(range.split("-")[0].replace(/\+/g, ""), 10) || 0
-    return getMin(b.range) - getMin(a.range)
-  })
+  const sortedBulk = [...bulkPricing]
 
   for (const tier of sortedBulk) {
killedBy: usePurchaseCalculator tier resolution checks the higher open-ended band first even when the caller declares it after the lower one
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
products/product-detail/hooks/usePurchaseCalculator.ts:46:54
 }
 
 const resolveBulkPricing = (bulkPricing: BulkPricingOption[], quantity: number) => {
-  const sortedBulk = [...bulkPricing].sort((a, b) => {
-    const getMin = (range: string) => parseInt(range.split("-")[0].replace(/\+/g, ""), 10) || 0
-    return getMin(b.range) - getMin(a.range)
-  })
+  const sortedBulk = [...bulkPricing].sort((a, b) => {})
 
   for (const tier of sortedBulk) {
killedBy: usePurchaseCalculator tier resolution checks the higher open-ended band first even when the caller declares it after the lower one
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ArrowFunction
products/product-detail/hooks/usePurchaseCalculator.ts:47:20
 
 const resolveBulkPricing = (bulkPricing: BulkPricingOption[], quantity: number) => {
   const sortedBulk = [...bulkPricing].sort((a, b) => {
-    const getMin = (range: string) => parseInt(range.split("-")[0].replace(/\+/g, ""), 10) || 0
+    const getMin = () => undefined
     return getMin(b.range) - getMin(a.range)
   })
killedBy: usePurchaseCalculator tier resolution checks the higher open-ended band first even when the caller declares it after the lower one
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
products/product-detail/hooks/usePurchaseCalculator.ts:47:39
 
 const resolveBulkPricing = (bulkPricing: BulkPricingOption[], quantity: number) => {
   const sortedBulk = [...bulkPricing].sort((a, b) => {
-    const getMin = (range: string) => parseInt(range.split("-")[0].replace(/\+/g, ""), 10) || 0
+    const getMin = (range: string) => true
     return getMin(b.range) - getMin(a.range)
   })
killedBy: usePurchaseCalculator tier resolution checks the higher open-ended band first even when the caller declares it after the lower one
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ArithmeticOperator
products/product-detail/hooks/usePurchaseCalculator.ts:48:12
 const resolveBulkPricing = (bulkPricing: BulkPricingOption[], quantity: number) => {
   const sortedBulk = [...bulkPricing].sort((a, b) => {
     const getMin = (range: string) => parseInt(range.split("-")[0].replace(/\+/g, ""), 10) || 0
-    return getMin(b.range) - getMin(a.range)
+    return getMin(b.range) + getMin(a.range)
   })
 
killedBy: usePurchaseCalculator tier resolution checks the higher open-ended band first even when the caller declares it after the lower one
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
products/product-detail/hooks/usePurchaseCalculator.ts:51:34
     return getMin(b.range) - getMin(a.range)
   })
 
-  for (const tier of sortedBulk) {
-    const range = tier.range.toLowerCase()
-    if (range.includes("+")) {
-      const min = parseInt(range.replace(/\+/g, ""), 10)
-      if (quantity >= min) return tier
-    } else if (range.includes("-")) {
-      const [min, max] = range.split("-").map((value) => parseInt(value, 10))
-      if (quantity >= min && quantity <= max) return tier
-    } else if (range.includes("1 unit")) {
-      if (quantity === 1) return tier
-    }
-  }
+  for (const tier of sortedBulk) {}
 
   return bulkPricing.find((tier) => tier.selected) || bulkPricing[0]
killedBy: usePurchaseCalculator tier resolution moves quantity 10 to the second tier
statusReason: expected '1-9' to be '10-49' // Object.is equality

[Killed] MethodExpression
products/product-detail/hooks/usePurchaseCalculator.ts:52:19
   })
 
   for (const tier of sortedBulk) {
-    const range = tier.range.toLowerCase()
+    const range = tier.range.toUpperCase()
     if (range.includes("+")) {
       const min = parseInt(range.replace(/\+/g, ""), 10)
killedBy: usePurchaseCalculator tier resolution the lone-wording branch is independently guarded matches the wording tier at quantity 1 instead of falling back to the decoy
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
products/product-detail/hooks/usePurchaseCalculator.ts:53:9
 
   for (const tier of sortedBulk) {
     const range = tier.range.toLowerCase()
-    if (range.includes("+")) {
+    if (false) {
       const min = parseInt(range.replace(/\+/g, ""), 10)
       if (quantity >= min) return tier
killedBy: usePurchaseCalculator tier resolution moves quantity 50 to the open-ended tier
statusReason: expected '1-9' to be '50+' // Object.is equality

[Killed] BlockStatement
products/product-detail/hooks/usePurchaseCalculator.ts:53:30
 
   for (const tier of sortedBulk) {
     const range = tier.range.toLowerCase()
-    if (range.includes("+")) {
-      const min = parseInt(range.replace(/\+/g, ""), 10)
-      if (quantity >= min) return tier
-    } else if (range.includes("-")) {
+    if (range.includes("+")) {} else if (range.includes("-")) {
       const [min, max] = range.split("-").map((value) => parseInt(value, 10))
       if (quantity >= min && quantity <= max) return tier
killedBy: usePurchaseCalculator tier resolution moves quantity 50 to the open-ended tier
statusReason: expected '1-9' to be '50+' // Object.is equality

[Survived] StringLiteral
products/product-detail/hooks/usePurchaseCalculator.ts:54:49
   for (const tier of sortedBulk) {
     const range = tier.range.toLowerCase()
     if (range.includes("+")) {
-      const min = parseInt(range.replace(/\+/g, ""), 10)
+      const min = parseInt(range.replace(/\+/g, "Stryker was here!"), 10)
       if (quantity >= min) return tier
     } else if (range.includes("-")) {

[Killed] EqualityOperator
products/product-detail/hooks/usePurchaseCalculator.ts:55:11
     const range = tier.range.toLowerCase()
     if (range.includes("+")) {
       const min = parseInt(range.replace(/\+/g, ""), 10)
-      if (quantity >= min) return tier
+      if (quantity > min) return tier
     } else if (range.includes("-")) {
       const [min, max] = range.split("-").map((value) => parseInt(value, 10))
killedBy: usePurchaseCalculator tier resolution moves quantity 50 to the open-ended tier
statusReason: expected '1-9' to be '50+' // Object.is equality

[Killed] ConditionalExpression
products/product-detail/hooks/usePurchaseCalculator.ts:55:11
     const range = tier.range.toLowerCase()
     if (range.includes("+")) {
       const min = parseInt(range.replace(/\+/g, ""), 10)
-      if (quantity >= min) return tier
+      if (false) return tier
     } else if (range.includes("-")) {
       const [min, max] = range.split("-").map((value) => parseInt(value, 10))
killedBy: usePurchaseCalculator tier resolution moves quantity 50 to the open-ended tier
statusReason: expected '1-9' to be '50+' // Object.is equality

[Killed] ConditionalExpression
products/product-detail/hooks/usePurchaseCalculator.ts:56:16
     if (range.includes("+")) {
       const min = parseInt(range.replace(/\+/g, ""), 10)
       if (quantity >= min) return tier
-    } else if (range.includes("-")) {
+    } else if (false) {
       const [min, max] = range.split("-").map((value) => parseInt(value, 10))
       if (quantity >= min && quantity <= max) return tier
killedBy: usePurchaseCalculator tier resolution moves quantity 10 to the second tier
statusReason: expected '1-9' to be '10-49' // Object.is equality

[Killed] ConditionalExpression
products/product-detail/hooks/usePurchaseCalculator.ts:56:16
     if (range.includes("+")) {
       const min = parseInt(range.replace(/\+/g, ""), 10)
       if (quantity >= min) return tier
-    } else if (range.includes("-")) {
+    } else if (true) {
       const [min, max] = range.split("-").map((value) => parseInt(value, 10))
       if (quantity >= min && quantity <= max) return tier
killedBy: usePurchaseCalculator tier resolution the lone-wording branch is independently guarded matches the wording tier at quantity 1 instead of falling back to the decoy
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ArrowFunction
products/product-detail/hooks/usePurchaseCalculator.ts:57:47
       const min = parseInt(range.replace(/\+/g, ""), 10)
       if (quantity >= min) return tier
     } else if (range.includes("-")) {
-      const [min, max] = range.split("-").map((value) => parseInt(value, 10))
+      const [min, max] = range.split("-").map(() => undefined)
       if (quantity >= min && quantity <= max) return tier
     } else if (range.includes("1 unit")) {
killedBy: usePurchaseCalculator tier resolution moves quantity 10 to the second tier
statusReason: expected '1-9' to be '10-49' // Object.is equality

[Killed] ConditionalExpression
products/product-detail/hooks/usePurchaseCalculator.ts:58:11
       if (quantity >= min) return tier
     } else if (range.includes("-")) {
       const [min, max] = range.split("-").map((value) => parseInt(value, 10))
-      if (quantity >= min && quantity <= max) return tier
+      if (false) return tier
     } else if (range.includes("1 unit")) {
       if (quantity === 1) return tier
killedBy: usePurchaseCalculator tier resolution moves quantity 10 to the second tier
statusReason: expected '1-9' to be '10-49' // Object.is equality

[Killed] ConditionalExpression
products/product-detail/hooks/usePurchaseCalculator.ts:58:30
       if (quantity >= min) return tier
     } else if (range.includes("-")) {
       const [min, max] = range.split("-").map((value) => parseInt(value, 10))
-      if (quantity >= min && quantity <= max) return tier
+      if (quantity >= min && true) return tier
     } else if (range.includes("1 unit")) {
       if (quantity === 1) return tier
killedBy: usePurchaseCalculator fallback chain when no tier matches falls back to the first tier when nothing is flagged as selected
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
products/product-detail/hooks/usePurchaseCalculator.ts:59:16
     } else if (range.includes("-")) {
       const [min, max] = range.split("-").map((value) => parseInt(value, 10))
       if (quantity >= min && quantity <= max) return tier
-    } else if (range.includes("1 unit")) {
+    } else if (false) {
       if (quantity === 1) return tier
     }
killedBy: usePurchaseCalculator tier resolution the lone-wording branch is independently guarded matches the wording tier at quantity 1 instead of falling back to the decoy
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
products/product-detail/hooks/usePurchaseCalculator.ts:59:42
     } else if (range.includes("-")) {
       const [min, max] = range.split("-").map((value) => parseInt(value, 10))
       if (quantity >= min && quantity <= max) return tier
-    } else if (range.includes("1 unit")) {
-      if (quantity === 1) return tier
-    }
+    } else if (range.includes("1 unit")) {}
   }
 
killedBy: usePurchaseCalculator tier resolution the lone-wording branch is independently guarded matches the wording tier at quantity 1 instead of falling back to the decoy
statusReason: expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
products/product-detail/hooks/usePurchaseCalculator.ts:60:11
       const [min, max] = range.split("-").map((value) => parseInt(value, 10))
       if (quantity >= min && quantity <= max) return tier
     } else if (range.includes("1 unit")) {
-      if (quantity === 1) return tier
+      if (quantity !== 1) return tier
     }
   }
killedBy: usePurchaseCalculator tier resolution the lone-wording branch is independently guarded matches the wording tier at quantity 1 instead of falling back to the decoy
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
products/product-detail/hooks/usePurchaseCalculator.ts:60:11
       const [min, max] = range.split("-").map((value) => parseInt(value, 10))
       if (quantity >= min && quantity <= max) return tier
     } else if (range.includes("1 unit")) {
-      if (quantity === 1) return tier
+      if (true) return tier
     }
   }
killedBy: usePurchaseCalculator tier resolution the lone-wording branch is independently guarded does not match the wording tier once quantity moves past 1, even though it is scanned first
statusReason: expected 1 to be 2 // Object.is equality

[Killed] LogicalOperator
products/product-detail/hooks/usePurchaseCalculator.ts:64:10
     }
   }
 
-  return bulkPricing.find((tier) => tier.selected) || bulkPricing[0]
+  return bulkPricing.find(tier => tier.selected) && bulkPricing[0]
 }
 
killedBy: usePurchaseCalculator tier resolution leaves a lone "1 unit" tier unmatched above quantity 1 and falls back to it anyway
statusReason: expected undefined to be '1 Unit' // Object.is equality

[Killed] ConditionalExpression
products/product-detail/hooks/usePurchaseCalculator.ts:64:10
     }
   }
 
-  return bulkPricing.find((tier) => tier.selected) || bulkPricing[0]
+  return false
 }
 
killedBy: usePurchaseCalculator tier resolution leaves a lone "1 unit" tier unmatched above quantity 1 and falls back to it anyway
statusReason: expected undefined to be '1 Unit' // Object.is equality

[Killed] BlockStatement
products/product-detail/hooks/usePurchaseCalculator.ts:76:41
   selectedSupplierHeavyShippingFee,
   stockCount,
 }: PurchaseCalculatorInput) => {
-  const defaultWarranty = useMemo(() => {
-    return warrantyOptions.find((w) => w.selected)?.value || warrantyOptions[0]?.value || "standard"
-  }, [warrantyOptions])
+  const defaultWarranty = useMemo(() => {}, [warrantyOptions])
 
   const [quantity, setQuantity] = useState(1)
killedBy: usePurchaseCalculator warranty selection starts on the option flagged as selected
statusReason: expected undefined to be 'standard' // Object.is equality

[Killed] ArrowFunction
products/product-detail/hooks/usePurchaseCalculator.ts:77:33
   stockCount,
 }: PurchaseCalculatorInput) => {
   const defaultWarranty = useMemo(() => {
-    return warrantyOptions.find((w) => w.selected)?.value || warrantyOptions[0]?.value || "standard"
+    return warrantyOptions.find(() => undefined)?.value || warrantyOptions[0]?.value || "standard"
   }, [warrantyOptions])
 
killedBy: usePurchaseCalculator warranty selection overwrites the user's pick when the resolved default warranty changes
statusReason: expected 'extended' to be 'premium' // Object.is equality

[Killed] LogicalOperator
products/product-detail/hooks/usePurchaseCalculator.ts:77:12
   stockCount,
 }: PurchaseCalculatorInput) => {
   const defaultWarranty = useMemo(() => {
-    return warrantyOptions.find((w) => w.selected)?.value || warrantyOptions[0]?.value || "standard"
+    return warrantyOptions.find(w => w.selected)?.value && warrantyOptions[0]?.value || "standard"
   }, [warrantyOptions])
 
killedBy: usePurchaseCalculator warranty selection falls back to the first option, then to "standard", when nothing is flagged
statusReason: expected 'standard' to be 'extended' // Object.is equality

[Killed] ArrayDeclaration
products/product-detail/hooks/usePurchaseCalculator.ts:78:6
 }: PurchaseCalculatorInput) => {
   const defaultWarranty = useMemo(() => {
     return warrantyOptions.find((w) => w.selected)?.value || warrantyOptions[0]?.value || "standard"
-  }, [warrantyOptions])
+  }, [])
 
   const [quantity, setQuantity] = useState(1)
killedBy: usePurchaseCalculator warranty selection overwrites the user's pick when the resolved default warranty changes
statusReason: expected 'extended' to be 'premium' // Object.is equality

[Killed] BlockStatement
products/product-detail/hooks/usePurchaseCalculator.ts:83:19
   const [quantity, setQuantity] = useState(1)
   const [selectedWarranty, setSelectedWarranty] = useState(defaultWarranty)
 
-  useEffect(() => {
-    if (quantity > stockCount) {
-      setQuantity(stockCount || 1)
-    }
-  }, [stockCount, quantity])
+  useEffect(() => {}, [stockCount, quantity])
 
   useEffect(() => {
killedBy: usePurchaseCalculator stock clamping clamps the quantity down to the available stock
statusReason: expected 10 to be 5 // Object.is equality

[Killed] ConditionalExpression
products/product-detail/hooks/usePurchaseCalculator.ts:84:9
   const [selectedWarranty, setSelectedWarranty] = useState(defaultWarranty)
 
   useEffect(() => {
-    if (quantity > stockCount) {
+    if (false) {
       setQuantity(stockCount || 1)
     }
killedBy: usePurchaseCalculator stock clamping clamps the quantity down to the available stock
statusReason: expected 10 to be 5 // Object.is equality

[Killed] ConditionalExpression
products/product-detail/hooks/usePurchaseCalculator.ts:84:9
   const [selectedWarranty, setSelectedWarranty] = useState(defaultWarranty)
 
   useEffect(() => {
-    if (quantity > stockCount) {
+    if (true) {
       setQuantity(stockCount || 1)
     }
killedBy: usePurchaseCalculator tier resolution picks the first tier for the smallest quantity
statusReason: expected '50+' to be '1-9' // Object.is equality

[Killed] LogicalOperator
products/product-detail/hooks/usePurchaseCalculator.ts:85:19
 
   useEffect(() => {
     if (quantity > stockCount) {
-      setQuantity(stockCount || 1)
+      setQuantity(stockCount && 1)
     }
   }, [stockCount, quantity])
killedBy: usePurchaseCalculator stock clamping clamps the quantity down to the available stock
statusReason: expected 1 to be 5 // Object.is equality

[Killed] ConditionalExpression
products/product-detail/hooks/usePurchaseCalculator.ts:85:19
 
   useEffect(() => {
     if (quantity > stockCount) {
-      setQuantity(stockCount || 1)
+      setQuantity(true)
     }
   }, [stockCount, quantity])
killedBy: usePurchaseCalculator stock clamping clamps the quantity down to the available stock
statusReason: expected true to be 5 // Object.is equality

[Killed] BlockStatement
products/product-detail/hooks/usePurchaseCalculator.ts:89:19
     }
   }, [stockCount, quantity])
 
-  useEffect(() => {
-    setSelectedWarranty(defaultWarranty)
-  }, [defaultWarranty])
+  useEffect(() => {}, [defaultWarranty])
 
   const activeTier = useMemo(() => resolveBulkPricing(bulkPricing, quantity), [bulkPricing, quantity])
killedBy: usePurchaseCalculator warranty selection overwrites the user's pick when the resolved default warranty changes
statusReason: expected 'extended' to be 'premium' // Object.is equality

[Killed] CallExpression
products/product-detail/hooks/usePurchaseCalculator.ts:90:5
   }, [stockCount, quantity])
 
   useEffect(() => {
-    setSelectedWarranty(defaultWarranty)
+    ;
   }, [defaultWarranty])
 
killedBy: usePurchaseCalculator warranty selection overwrites the user's pick when the resolved default warranty changes
statusReason: expected 'extended' to be 'premium' // Object.is equality

[Killed] ArrowFunction
products/product-detail/hooks/usePurchaseCalculator.ts:93:30
     setSelectedWarranty(defaultWarranty)
   }, [defaultWarranty])
 
-  const activeTier = useMemo(() => resolveBulkPricing(bulkPricing, quantity), [bulkPricing, quantity])
+  const activeTier = useMemo(() => undefined, [bulkPricing, quantity])
   const unitPrice = useMemo(() => {
     if (activeTier) return parsePrice(activeTier.price)
killedBy: usePurchaseCalculator tier resolution picks the first tier for the smallest quantity
statusReason: expected undefined to be '1-9' // Object.is equality

[Killed] BlockStatement
products/product-detail/hooks/usePurchaseCalculator.ts:94:35
   }, [defaultWarranty])
 
   const activeTier = useMemo(() => resolveBulkPricing(bulkPricing, quantity), [bulkPricing, quantity])
-  const unitPrice = useMemo(() => {
-    if (activeTier) return parsePrice(activeTier.price)
-    if (selectedSupplierPrice) return parsePrice(selectedSupplierPrice)
-    return parsePrice(orderSummary.productPrice)
-  }, [activeTier, orderSummary.productPrice, selectedSupplierPrice])
+  const unitPrice = useMemo(() => {}, [activeTier, orderSummary.productPrice, selectedSupplierPrice])
 
   const warrantyPrice = useMemo(() => {
killedBy: usePurchaseCalculator tier resolution picks the first tier for the smallest quantity
statusReason: expected undefined to be 100 // Object.is equality

[Killed] ConditionalExpression
products/product-detail/hooks/usePurchaseCalculator.ts:95:9
 
   const activeTier = useMemo(() => resolveBulkPricing(bulkPricing, quantity), [bulkPricing, quantity])
   const unitPrice = useMemo(() => {
-    if (activeTier) return parsePrice(activeTier.price)
+    if (true) return parsePrice(activeTier.price)
     if (selectedSupplierPrice) return parsePrice(selectedSupplierPrice)
     return parsePrice(orderSummary.productPrice)
killedBy: usePurchaseCalculator fallback chain when no tier matches uses the selected supplier price when bulkPricing is empty
statusReason: Cannot read properties of undefined (reading 'price')

[Killed] ConditionalExpression
products/product-detail/hooks/usePurchaseCalculator.ts:95:9
 
   const activeTier = useMemo(() => resolveBulkPricing(bulkPricing, quantity), [bulkPricing, quantity])
   const unitPrice = useMemo(() => {
-    if (activeTier) return parsePrice(activeTier.price)
+    if (false) return parsePrice(activeTier.price)
     if (selectedSupplierPrice) return parsePrice(selectedSupplierPrice)
     return parsePrice(orderSummary.productPrice)
killedBy: usePurchaseCalculator tier resolution picks the first tier for the smallest quantity
statusReason: expected +0 to be 100 // Object.is equality

[Killed] ConditionalExpression
products/product-detail/hooks/usePurchaseCalculator.ts:96:9
   const activeTier = useMemo(() => resolveBulkPricing(bulkPricing, quantity), [bulkPricing, quantity])
   const unitPrice = useMemo(() => {
     if (activeTier) return parsePrice(activeTier.price)
-    if (selectedSupplierPrice) return parsePrice(selectedSupplierPrice)
+    if (false) return parsePrice(selectedSupplierPrice)
     return parsePrice(orderSummary.productPrice)
   }, [activeTier, orderSummary.productPrice, selectedSupplierPrice])
killedBy: usePurchaseCalculator fallback chain when no tier matches uses the selected supplier price when bulkPricing is empty
statusReason: expected 999 to be 42.5 // Object.is equality

[Killed] ConditionalExpression
products/product-detail/hooks/usePurchaseCalculator.ts:96:9
   const activeTier = useMemo(() => resolveBulkPricing(bulkPricing, quantity), [bulkPricing, quantity])
   const unitPrice = useMemo(() => {
     if (activeTier) return parsePrice(activeTier.price)
-    if (selectedSupplierPrice) return parsePrice(selectedSupplierPrice)
+    if (true) return parsePrice(selectedSupplierPrice)
     return parsePrice(orderSummary.productPrice)
   }, [activeTier, orderSummary.productPrice, selectedSupplierPrice])
killedBy: usePurchaseCalculator fallback chain when no tier matches uses the order summary product price when there is no tier and no supplier price
statusReason: expected +0 to be 999 // Object.is equality

[Killed] ArrayDeclaration
products/product-detail/hooks/usePurchaseCalculator.ts:98:6
     if (activeTier) return parsePrice(activeTier.price)
     if (selectedSupplierPrice) return parsePrice(selectedSupplierPrice)
     return parsePrice(orderSummary.productPrice)
-  }, [activeTier, orderSummary.productPrice, selectedSupplierPrice])
+  }, [])
 
   const warrantyPrice = useMemo(() => {
killedBy: usePurchaseCalculator tier resolution moves quantity 10 to the second tier
statusReason: expected 100 to be 90 // Object.is equality

[Killed] BlockStatement
products/product-detail/hooks/usePurchaseCalculator.ts:100:39
     return parsePrice(orderSummary.productPrice)
   }, [activeTier, orderSummary.productPrice, selectedSupplierPrice])
 
-  const warrantyPrice = useMemo(() => {
-    const selected = warrantyOptions.find((w) => w.value === selectedWarranty)
-    return parsePrice(selected?.price || orderSummary.warranty)
-  }, [orderSummary.warranty, selectedWarranty, warrantyOptions])
+  const warrantyPrice = useMemo(() => {}, [orderSummary.warranty, selectedWarranty, warrantyOptions])
 
   const shippingFeeUnitPrice = selectedSupplierShippingFee
killedBy: usePurchaseCalculator price string parsing treats an unparseable price as zero instead of leaking NaN
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
products/product-detail/hooks/usePurchaseCalculator.ts:101:50
   }, [activeTier, orderSummary.productPrice, selectedSupplierPrice])
 
   const warrantyPrice = useMemo(() => {
-    const selected = warrantyOptions.find((w) => w.value === selectedWarranty)
+    const selected = warrantyOptions.find((w) => true)
     return parsePrice(selected?.price || orderSummary.warranty)
   }, [orderSummary.warranty, selectedWarranty, warrantyOptions])
killedBy: usePurchaseCalculator warranty selection adds the chosen warranty price to the subtotal
statusReason: expected +0 to be 299 // Object.is equality

[Killed] ConditionalExpression
products/product-detail/hooks/usePurchaseCalculator.ts:101:50
   }, [activeTier, orderSummary.productPrice, selectedSupplierPrice])
 
   const warrantyPrice = useMemo(() => {
-    const selected = warrantyOptions.find((w) => w.value === selectedWarranty)
+    const selected = warrantyOptions.find((w) => false)
     return parsePrice(selected?.price || orderSummary.warranty)
   }, [orderSummary.warranty, selectedWarranty, warrantyOptions])
killedBy: usePurchaseCalculator warranty selection adds the chosen warranty price to the subtotal
statusReason: expected +0 to be 299 // Object.is equality
