[Killed] ConditionalExpression
products/product-detail/hooks/usePurchaseCalculator.ts:102:23
 
   const warrantyPrice = useMemo(() => {
     const selected = warrantyOptions.find((w) => w.value === selectedWarranty)
-    return parsePrice(selected?.price || orderSummary.warranty)
+    return parsePrice(true)
   }, [orderSummary.warranty, selectedWarranty, warrantyOptions])
 
killedBy: usePurchaseCalculator tier resolution picks the first tier for the smallest quantity
statusReason: priceString.replace is not a function

[Killed] OptionalChaining
products/product-detail/hooks/usePurchaseCalculator.ts:102:23
 
   const warrantyPrice = useMemo(() => {
     const selected = warrantyOptions.find((w) => w.value === selectedWarranty)
-    return parsePrice(selected?.price || orderSummary.warranty)
+    return parsePrice(selected.price || orderSummary.warranty)
   }, [orderSummary.warranty, selectedWarranty, warrantyOptions])
 
killedBy: usePurchaseCalculator warranty selection falls back to the first option, then to "standard", when nothing is flagged
statusReason: Cannot read properties of undefined (reading 'price')

[Killed] ArithmeticOperator
products/product-detail/hooks/usePurchaseCalculator.ts:109:28
     ? parsePrice(selectedSupplierShippingFee)
     : parsePrice(orderSummary.shipping)
   const heavyShippingFeeUnitPrice = selectedSupplierHeavyShippingFee ? parsePrice(selectedSupplierHeavyShippingFee) : 0
-  const shippingFeePrice = shippingFeeUnitPrice * quantity
+  const shippingFeePrice = shippingFeeUnitPrice / quantity
   const heavyShippingFeePrice = heavyShippingFeeUnitPrice * quantity
   const shippingPrice = shippingFeePrice + heavyShippingFeePrice
killedBy: usePurchaseCalculator totals computes productTotal, subtotal, tax and total from the resolved unit price
statusReason: expected 5 to be 20 // Object.is equality

[Killed] ArithmeticOperator
products/product-detail/hooks/usePurchaseCalculator.ts:110:33
     : parsePrice(orderSummary.shipping)
   const heavyShippingFeeUnitPrice = selectedSupplierHeavyShippingFee ? parsePrice(selectedSupplierHeavyShippingFee) : 0
   const shippingFeePrice = shippingFeeUnitPrice * quantity
-  const heavyShippingFeePrice = heavyShippingFeeUnitPrice * quantity
+  const heavyShippingFeePrice = heavyShippingFeeUnitPrice / quantity
   const shippingPrice = shippingFeePrice + heavyShippingFeePrice
   const productTotal = unitPrice * quantity
killedBy: usePurchaseCalculator totals multiplies the heavy shipping surcharge per unit rather than charging it once
statusReason: expected 7.5 to be 750 // Object.is equality

[Killed] ArithmeticOperator
products/product-detail/hooks/usePurchaseCalculator.ts:111:25
   const heavyShippingFeeUnitPrice = selectedSupplierHeavyShippingFee ? parsePrice(selectedSupplierHeavyShippingFee) : 0
   const shippingFeePrice = shippingFeeUnitPrice * quantity
   const heavyShippingFeePrice = heavyShippingFeeUnitPrice * quantity
-  const shippingPrice = shippingFeePrice + heavyShippingFeePrice
+  const shippingPrice = shippingFeePrice - heavyShippingFeePrice
   const productTotal = unitPrice * quantity
   const subtotal = productTotal + warrantyPrice
killedBy: usePurchaseCalculator totals multiplies the heavy shipping surcharge per unit rather than charging it once
statusReason: expected -650 to be 850 // Object.is equality

[Killed] ArithmeticOperator
products/product-detail/hooks/usePurchaseCalculator.ts:112:24
   const shippingFeePrice = shippingFeeUnitPrice * quantity
   const heavyShippingFeePrice = heavyShippingFeeUnitPrice * quantity
   const shippingPrice = shippingFeePrice + heavyShippingFeePrice
-  const productTotal = unitPrice * quantity
+  const productTotal = unitPrice / quantity
   const subtotal = productTotal + warrantyPrice
   const tax = subtotal * 0.1
killedBy: usePurchaseCalculator totals computes productTotal, subtotal, tax and total from the resolved unit price
statusReason: expected 50 to be 200 // Object.is equality

[Killed] ArithmeticOperator
products/product-detail/hooks/usePurchaseCalculator.ts:113:20
   const heavyShippingFeePrice = heavyShippingFeeUnitPrice * quantity
   const shippingPrice = shippingFeePrice + heavyShippingFeePrice
   const productTotal = unitPrice * quantity
-  const subtotal = productTotal + warrantyPrice
+  const subtotal = productTotal - warrantyPrice
   const tax = subtotal * 0.1
   const total = subtotal + shippingPrice + tax
killedBy: usePurchaseCalculator warranty selection adds the chosen warranty price to the subtotal
statusReason: expected -199 to be 399 // Object.is equality

[Killed] ArithmeticOperator
products/product-detail/hooks/usePurchaseCalculator.ts:114:15
   const shippingPrice = shippingFeePrice + heavyShippingFeePrice
   const productTotal = unitPrice * quantity
   const subtotal = productTotal + warrantyPrice
-  const tax = subtotal * 0.1
+  const tax = subtotal / 0.1
   const total = subtotal + shippingPrice + tax
 
killedBy: usePurchaseCalculator totals computes productTotal, subtotal, tax and total from the resolved unit price
statusReason: expected 2500 to be 25 // Object.is equality

[Killed] ArithmeticOperator
products/product-detail/hooks/usePurchaseCalculator.ts:115:17
   const productTotal = unitPrice * quantity
   const subtotal = productTotal + warrantyPrice
   const tax = subtotal * 0.1
-  const total = subtotal + shippingPrice + tax
+  const total = subtotal - shippingPrice + tax
 
   return {
killedBy: usePurchaseCalculator totals computes productTotal, subtotal, tax and total from the resolved unit price
statusReason: expected 255 to be 295 // Object.is equality

[Killed] ArithmeticOperator
products/product-detail/hooks/usePurchaseCalculator.ts:115:17
   const productTotal = unitPrice * quantity
   const subtotal = productTotal + warrantyPrice
   const tax = subtotal * 0.1
-  const total = subtotal + shippingPrice + tax
+  const total = subtotal + shippingPrice - tax
 
   return {
killedBy: usePurchaseCalculator totals computes productTotal, subtotal, tax and total from the resolved unit price
statusReason: expected 245 to be 295 // Object.is equality

[Killed] ObjectLiteral
products/product-detail/hooks/usePurchaseCalculator.ts:117:10
   const tax = subtotal * 0.1
   const total = subtotal + shippingPrice + tax
 
-  return {
-    quantity,
-    setQuantity,
-    selectedWarranty,
-    setSelectedWarranty,
-    activeTier,
-    unitPrice,
-    warrantyPrice,
-    shippingFeePrice,
-    heavyShippingFeePrice,
-    shippingPrice,
-    productTotal,
-    subtotal,
-    tax,
-    total,
-  }
+  return {}
 }
 
killedBy: usePurchaseCalculator tier resolution picks the first tier for the smallest quantity
statusReason: result.current.setQuantity is not a function
