[Killed] BlockStatement
src/proxy.ts:9:62
   const pathname = url.pathname
 
   // Helper function to parse auth cookie (safe parse for URL encoded cookies)
-  const parseAuthCookie = (authCookie: { value: string }) => {
-    try {
-      const decoded = decodeURIComponent(authCookie.value)
-      return JSON.parse(decoded)
-    } catch {
-      try {
-        return JSON.parse(authCookie.value)
-      } catch {
-        return null
-      }
-    }
-  }
+  const parseAuthCookie = (authCookie: { value: string }) => {}
 
   const authCookie = request.cookies.get("auth-storage")
killedBy: proxy role routing matrix 'buyer on their own dashboard passes t…'
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/proxy.ts:10:9
 
   // Helper function to parse auth cookie (safe parse for URL encoded cookies)
   const parseAuthCookie = (authCookie: { value: string }) => {
-    try {
-      const decoded = decodeURIComponent(authCookie.value)
-      return JSON.parse(decoded)
-    } catch {
+    try {} catch {
       try {
         return JSON.parse(authCookie.value)
killedBy: proxy role routing matrix 'buyer on their own dashboard passes t…'
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/proxy.ts:13:13
     try {
       const decoded = decodeURIComponent(authCookie.value)
       return JSON.parse(decoded)
-    } catch {
-      try {
-        return JSON.parse(authCookie.value)
-      } catch {
-        return null
-      }
-    }
+    } catch {}
   }
 
killedBy: proxy role routing matrix 'cookie that cannot be URI-decoded fal…'
statusReason: expected 200 to be 307 // Object.is equality

[Killed] BlockStatement
src/proxy.ts:14:11
       const decoded = decodeURIComponent(authCookie.value)
       return JSON.parse(decoded)
     } catch {
-      try {
-        return JSON.parse(authCookie.value)
-      } catch {
+      try {} catch {
         return null
       }
killedBy: proxy role routing matrix 'cookie that cannot be URI-decoded fal…'
statusReason: expected 200 to be 307 // Object.is equality

[Survived] BlockStatement
src/proxy.ts:16:15
     } catch {
       try {
         return JSON.parse(authCookie.value)
-      } catch {
-        return null
-      }
+      } catch {}
     }
   }

[Killed] StringLiteral
src/proxy.ts:22:42
     }
   }
 
-  const authCookie = request.cookies.get("auth-storage")
+  const authCookie = request.cookies.get("")
   let user: { roleName?: string } | null = null
   let isAuthenticated = false
killedBy: proxy role routing matrix 'buyer on their own dashboard passes t…'
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
src/proxy.ts:24:25
 
   const authCookie = request.cookies.get("auth-storage")
   let user: { roleName?: string } | null = null
-  let isAuthenticated = false
+  let isAuthenticated = true
 
   if (authCookie) {

[Killed] BlockStatement
src/proxy.ts:26:19
   let user: { roleName?: string } | null = null
   let isAuthenticated = false
 
-  if (authCookie) {
-    const authData = parseAuthCookie(authCookie)
-    user = authData?.state?.user ?? null
-    isAuthenticated = Boolean(authData?.state?.isAuthenticated)
-  }
+  if (authCookie) {}
 
   // Vendor users can only access vendor dashboard routes
killedBy: proxy role routing matrix 'buyer on their own dashboard passes t…'
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/proxy.ts:26:7
   let user: { roleName?: string } | null = null
   let isAuthenticated = false
 
-  if (authCookie) {
+  if (false) {
     const authData = parseAuthCookie(authCookie)
     user = authData?.state?.user ?? null
killedBy: proxy role routing matrix 'buyer on their own dashboard passes t…'
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/proxy.ts:28:12
 
   if (authCookie) {
     const authData = parseAuthCookie(authCookie)
-    user = authData?.state?.user ?? null
+    user = authData?.state?.user && null
     isAuthenticated = Boolean(authData?.state?.isAuthenticated)
   }
killedBy: proxy role routing matrix 'buyer on their own dashboard passes t…'
statusReason: expected false to be true // Object.is equality

[Killed] OptionalChaining
src/proxy.ts:28:12
 
   if (authCookie) {
     const authData = parseAuthCookie(authCookie)
-    user = authData?.state?.user ?? null
+    user = authData?.state.user ?? null
     isAuthenticated = Boolean(authData?.state?.isAuthenticated)
   }
killedBy: proxy role routing matrix 'cookie with valid JSON but no state k…'
statusReason: Cannot read properties of undefined (reading 'user')

[Killed] OptionalChaining
src/proxy.ts:29:31
   if (authCookie) {
     const authData = parseAuthCookie(authCookie)
     user = authData?.state?.user ?? null
-    isAuthenticated = Boolean(authData?.state?.isAuthenticated)
+    isAuthenticated = Boolean(authData?.state.isAuthenticated)
   }
 
killedBy: proxy role routing matrix 'cookie with valid JSON but no state k…'
statusReason: Cannot read properties of undefined (reading 'isAuthenticated')

[Killed] OptionalChaining
src/proxy.ts:29:31
   if (authCookie) {
     const authData = parseAuthCookie(authCookie)
     user = authData?.state?.user ?? null
-    isAuthenticated = Boolean(authData?.state?.isAuthenticated)
+    isAuthenticated = Boolean(authData.state?.isAuthenticated)
   }
 
killedBy: proxy role routing matrix 'unparseable cookie degrades to anonym…'
statusReason: Cannot read properties of null (reading 'state')

[Killed] ConditionalExpression
src/proxy.ts:34:28
 
   // Vendor users can only access vendor dashboard routes
   // Exception: /register?token=... is the admin-invited signup flow — let it through
-  const isSignupLinkFlow = pathname === "/register" && url.searchParams.has("token")
+  const isSignupLinkFlow = false
   if (user?.roleName === "Vendor" && !pathname.startsWith("/vendor-dashboard") && !isSignupLinkFlow) {
     return NextResponse.redirect(new URL("/vendor-dashboard", request.url))
killedBy: proxy role routing matrix 'vendor on /register?token=abc is let …'
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/proxy.ts:34:28
 
   // Vendor users can only access vendor dashboard routes
   // Exception: /register?token=... is the admin-invited signup flow — let it through
-  const isSignupLinkFlow = pathname === "/register" && url.searchParams.has("token")
+  const isSignupLinkFlow = true
   if (user?.roleName === "Vendor" && !pathname.startsWith("/vendor-dashboard") && !isSignupLinkFlow) {
     return NextResponse.redirect(new URL("/vendor-dashboard", request.url))
killedBy: proxy role routing matrix 'vendor on the home page is pinned to …'
statusReason: expected 200 to be 307 // Object.is equality

[Killed] MethodExpression
src/proxy.ts:35:39
   // Vendor users can only access vendor dashboard routes
   // Exception: /register?token=... is the admin-invited signup flow — let it through
   const isSignupLinkFlow = pathname === "/register" && url.searchParams.has("token")
-  if (user?.roleName === "Vendor" && !pathname.startsWith("/vendor-dashboard") && !isSignupLinkFlow) {
+  if (user?.roleName === "Vendor" && !pathname.endsWith("/vendor-dashboard") && !isSignupLinkFlow) {
     return NextResponse.redirect(new URL("/vendor-dashboard", request.url))
   }
killedBy: proxy role routing matrix 'vendor on their own dashboard passes …'
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/proxy.ts:35:7
   // Vendor users can only access vendor dashboard routes
   // Exception: /register?token=... is the admin-invited signup flow — let it through
   const isSignupLinkFlow = pathname === "/register" && url.searchParams.has("token")
-  if (user?.roleName === "Vendor" && !pathname.startsWith("/vendor-dashboard") && !isSignupLinkFlow) {
+  if (user?.roleName !== "Vendor" && !pathname.startsWith("/vendor-dashboard") && !isSignupLinkFlow) {
     return NextResponse.redirect(new URL("/vendor-dashboard", request.url))
   }
killedBy: proxy role routing matrix 'anonymous on the home page passes thr…'
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/proxy.ts:36:42
   // Exception: /register?token=... is the admin-invited signup flow — let it through
   const isSignupLinkFlow = pathname === "/register" && url.searchParams.has("token")
   if (user?.roleName === "Vendor" && !pathname.startsWith("/vendor-dashboard") && !isSignupLinkFlow) {
-    return NextResponse.redirect(new URL("/vendor-dashboard", request.url))
+    return NextResponse.redirect(new URL("", request.url))
   }
 
killedBy: proxy role routing matrix 'vendor on the home page is pinned to …'
statusReason: expected '/' to be '/vendor-dashboard' // Object.is equality

[Killed] ConditionalExpression
src/proxy.ts:40:7
   }
 
   // Protected dashboard routes logic
-  if (pathname.startsWith("/vendor-dashboard") || pathname.startsWith("/buyer-dashboard")) {
+  if (true) {
     if (!authCookie || !user || !isAuthenticated) {
       const loginUrl = new URL("/login", request.url)
killedBy: proxy role routing matrix 'anonymous on the home page passes thr…'
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/proxy.ts:40:7
   }
 
   // Protected dashboard routes logic
-  if (pathname.startsWith("/vendor-dashboard") || pathname.startsWith("/buyer-dashboard")) {
+  if (pathname.endsWith("/vendor-dashboard") || pathname.startsWith("/buyer-dashboard")) {
     if (!authCookie || !user || !isAuthenticated) {
       const loginUrl = new URL("/login", request.url)
killedBy: proxy role routing matrix 'buyer reaching into the vendor dashbo…'
statusReason: expected 200 to be 307 // Object.is equality

[Killed] ConditionalExpression
src/proxy.ts:41:9
 
   // Protected dashboard routes logic
   if (pathname.startsWith("/vendor-dashboard") || pathname.startsWith("/buyer-dashboard")) {
-    if (!authCookie || !user || !isAuthenticated) {
+    if (true) {
       const loginUrl = new URL("/login", request.url)
       loginUrl.searchParams.set("redirect", pathname)
killedBy: proxy role routing matrix 'buyer on their own dashboard passes t…'
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/proxy.ts:41:9
 
   // Protected dashboard routes logic
   if (pathname.startsWith("/vendor-dashboard") || pathname.startsWith("/buyer-dashboard")) {
-    if (!authCookie || !user || !isAuthenticated) {
+    if (false) {
       const loginUrl = new URL("/login", request.url)
       loginUrl.searchParams.set("redirect", pathname)
killedBy: proxy role routing matrix 'anonymous on a buyer dashboard route …'
statusReason: Cannot read properties of null (reading 'roleName')

[Killed] StringLiteral
src/proxy.ts:42:32
   // Protected dashboard routes logic
   if (pathname.startsWith("/vendor-dashboard") || pathname.startsWith("/buyer-dashboard")) {
     if (!authCookie || !user || !isAuthenticated) {
-      const loginUrl = new URL("/login", request.url)
+      const loginUrl = new URL("", request.url)
       loginUrl.searchParams.set("redirect", pathname)
       return NextResponse.redirect(loginUrl)
killedBy: proxy role routing matrix 'anonymous on a buyer dashboard route …'
statusReason: expected '/buyer-dashboard/orders?redirect=%2Fb…' to be '/login?redirect=%2Fbuyer-dashboard%2F…' // Object.is equality

[Killed] ConditionalExpression
src/proxy.ts:48:53
     }
 
     // Role check between dashboards
-    if (pathname.startsWith("/vendor-dashboard") && user.roleName !== "Vendor") {
+    if (pathname.startsWith("/vendor-dashboard") && true) {
       return NextResponse.redirect(new URL("/buyer-dashboard", request.url))
     }
killedBy: proxy role routing matrix 'vendor on their own dashboard passes …'
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/proxy.ts:48:81
     }
 
     // Role check between dashboards
-    if (pathname.startsWith("/vendor-dashboard") && user.roleName !== "Vendor") {
-      return NextResponse.redirect(new URL("/buyer-dashboard", request.url))
-    }
+    if (pathname.startsWith("/vendor-dashboard") && user.roleName !== "Vendor") {}
 
     if (pathname.startsWith("/buyer-dashboard") && user.roleName === "Vendor") {
killedBy: proxy role routing matrix 'buyer reaching into the vendor dashbo…'
statusReason: expected 200 to be 307 // Object.is equality

[Killed] StringLiteral
src/proxy.ts:49:44
 
     // Role check between dashboards
     if (pathname.startsWith("/vendor-dashboard") && user.roleName !== "Vendor") {
-      return NextResponse.redirect(new URL("/buyer-dashboard", request.url))
+      return NextResponse.redirect(new URL("", request.url))
     }
 
killedBy: proxy role routing matrix 'buyer reaching into the vendor dashbo…'
statusReason: expected '/vendor-dashboard/products' to be '/buyer-dashboard' // Object.is equality

[Killed] LogicalOperator
src/proxy.ts:52:9
       return NextResponse.redirect(new URL("/buyer-dashboard", request.url))
     }
 
-    if (pathname.startsWith("/buyer-dashboard") && user.roleName === "Vendor") {
+    if (pathname.startsWith("/buyer-dashboard") || user.roleName === "Vendor") {
       return NextResponse.redirect(new URL("/vendor-dashboard", request.url))
     }
killedBy: proxy role routing matrix 'buyer on their own dashboard passes t…'
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/proxy.ts:52:52
       return NextResponse.redirect(new URL("/buyer-dashboard", request.url))
     }
 
-    if (pathname.startsWith("/buyer-dashboard") && user.roleName === "Vendor") {
+    if (pathname.startsWith("/buyer-dashboard") && user.roleName !== "Vendor") {
       return NextResponse.redirect(new URL("/vendor-dashboard", request.url))
     }
killedBy: proxy role routing matrix 'buyer on their own dashboard passes t…'
statusReason: expected false to be true // Object.is equality

[NoCoverage] StringLiteral
src/proxy.ts:53:44
     }
 
     if (pathname.startsWith("/buyer-dashboard") && user.roleName === "Vendor") {
-      return NextResponse.redirect(new URL("/vendor-dashboard", request.url))
+      return NextResponse.redirect(new URL("", request.url))
     }
   }

[Survived] ObjectLiteral
src/proxy.ts:60:23
   return NextResponse.next()
 }
 
-export const config = {
-  matcher: ["/((?!api|backend-api|_next/static|_next/image|favicon.ico|qz-tray\\.js).*)"],
-}
+export const config = {}
 

[Killed] ArrayDeclaration
src/proxy.ts:61:12
 }
 
 export const config = {
-  matcher: ["/((?!api|backend-api|_next/static|_next/image|favicon.ico|qz-tray\\.js).*)"],
+  matcher: [],
 }
 
killedBy: proxy config.matcher matcher against / -> true
statusReason: expected false to be true // Object.is equality
