[Killed] BlockStatement
src/stores/cartStore.ts:20:83
  */
 type AutoOrderWrite = AutoOrderPeriod | null | undefined
 
-function findItem(items: CartItem[], userProductId: string): CartItem | undefined {
-  return items.find((item) => item.userProduct.userProductId === userProductId)
-}
+function findItem(items: CartItem[], userProductId: string): CartItem | undefined {}
 
 function resolveAutoOrder(items: CartItem[], userProductId: string, requested: AutoOrderWrite): AutoOrderPeriod | null {
killedBy: useCartPage auto-order flush flushes the pending quantity into the auto-order write instead of racing it
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrowFunction
src/stores/cartStore.ts:21:21
 type AutoOrderWrite = AutoOrderPeriod | null | undefined
 
 function findItem(items: CartItem[], userProductId: string): CartItem | undefined {
-  return items.find((item) => item.userProduct.userProductId === userProductId)
+  return items.find(() => undefined)
 }
 
killedBy: useCartPage auto-order flush flushes the pending quantity into the auto-order write instead of racing it
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/stores/cartStore.ts:21:31
 type AutoOrderWrite = AutoOrderPeriod | null | undefined
 
 function findItem(items: CartItem[], userProductId: string): CartItem | undefined {
-  return items.find((item) => item.userProduct.userProductId === userProductId)
+  return items.find((item) => true)
 }
 
killedBy: cartStore resolveAutoOrder falls back to null when the product is not in the cart
statusReason: expected { userProductId: 'up-unknown', …(2) } to deeply equal { userProductId: 'up-unknown', …(2) }

[Killed] BlockStatement
src/stores/cartStore.ts:24:120
   return items.find((item) => item.userProduct.userProductId === userProductId)
 }
 
-function resolveAutoOrder(items: CartItem[], userProductId: string, requested: AutoOrderWrite): AutoOrderPeriod | null {
-  if (requested !== undefined) {
-    return requested
-  }
-
-  return findItem(items, userProductId)?.autoOrder ?? null
-}
+function resolveAutoOrder(items: CartItem[], userProductId: string, requested: AutoOrderWrite): AutoOrderPeriod | null {}
 
 interface CartStore {
killedBy: cartStore resolveAutoOrder resends the schedule already on the item when autoOrder is omitted
statusReason: expected { userProductId: 'up-1', …(2) } to deeply equal { userProductId: 'up-1', …(2) }

[Killed] ConditionalExpression
src/stores/cartStore.ts:25:7
 }
 
 function resolveAutoOrder(items: CartItem[], userProductId: string, requested: AutoOrderWrite): AutoOrderPeriod | null {
-  if (requested !== undefined) {
+  if (false) {
     return requested
   }
killedBy: cartStore resolveAutoOrder clears the schedule when null is passed explicitly
statusReason: expected { userProductId: 'up-1', …(2) } to deeply equal { userProductId: 'up-1', …(2) }

[Killed] EqualityOperator
src/stores/cartStore.ts:25:7
 }
 
 function resolveAutoOrder(items: CartItem[], userProductId: string, requested: AutoOrderWrite): AutoOrderPeriod | null {
-  if (requested !== undefined) {
+  if (requested === undefined) {
     return requested
   }
killedBy: cartStore resolveAutoOrder resends the schedule already on the item when autoOrder is omitted
statusReason: expected { userProductId: 'up-1', …(2) } to deeply equal { userProductId: 'up-1', …(2) }

[Killed] LogicalOperator
src/stores/cartStore.ts:29:10
     return requested
   }
 
-  return findItem(items, userProductId)?.autoOrder ?? null
+  return findItem(items, userProductId)?.autoOrder && null
 }
 
killedBy: cartStore resolveAutoOrder resends the schedule already on the item when autoOrder is omitted
statusReason: expected { userProductId: 'up-1', …(2) } to deeply equal { userProductId: 'up-1', …(2) }

[Killed] OptionalChaining
src/stores/cartStore.ts:29:10
     return requested
   }
 
-  return findItem(items, userProductId)?.autoOrder ?? null
+  return findItem(items, userProductId).autoOrder ?? null
 }
 
killedBy: cartStore resolveAutoOrder falls back to null when the product is not in the cart
statusReason: expected null to deeply equal { userProductId: 'up-unknown', …(2) }

[Killed] ArrayDeclaration
src/stores/cartStore.ts:50:10
 
 export const useCartStore = create<CartStore>((set, get) => ({
   cartId: null,
-  items: [],
+  items: ["Stryker was here"],
   cartCount: 0,
   isLoading: false,
killedBy: useCartPage mount fetches the cart exactly once and exposes its items
statusReason: Cannot read properties of undefined (reading 'userProductId')

[Killed] BooleanLiteral
src/stores/cartStore.ts:52:14
   cartId: null,
   items: [],
   cartCount: 0,
-  isLoading: false,
+  isLoading: true,
   error: null,
   lastFetchedAt: 0,
killedBy: cartStore defaults starts isLoading false before any fetch is triggered
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/stores/cartStore.ts:56:20
   error: null,
   lastFetchedAt: 0,
 
-  resetCart: () => {
-    inFlightCartFetch = null
-    set({
-      cartId: null,
-      items: [],
-      cartCount: 0,
-      isLoading: false,
-      error: null,
-      lastFetchedAt: 0,
-    })
-  },
+  resetCart: () => {},
 
   fetchCart: async (options = {}) => {
killedBy: cartStore fetchCart de-duplication window issues the request again once the window has elapsed (1001ms)
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/stores/cartStore.ts:69:36
   },
 
   fetchCart: async (options = {}) => {
-    const force = options.force ?? false
+    const force = options.force ?? true
     const now = Date.now()
     const { lastFetchedAt } = get()
killedBy: cartStore fetchCart de-duplication window skips the request when a second fetch lands 500ms after the first
statusReason: expected 2 to be 1 // Object.is equality

[Killed] LogicalOperator
src/stores/cartStore.ts:69:19
   },
 
   fetchCart: async (options = {}) => {
-    const force = options.force ?? false
+    const force = options.force && false
     const now = Date.now()
     const { lastFetchedAt } = get()
killedBy: cartStore fetchCart de-duplication window always requests when force is set, even inside the window
statusReason: expected 1 to be 3 // Object.is equality

[Killed] BooleanLiteral
src/stores/cartStore.ts:73:9
     const now = Date.now()
     const { lastFetchedAt } = get()
 
-    if (!force) {
+    if (force) {
       if (inFlightCartFetch) {
         return inFlightCartFetch
killedBy: cartStore fetchCart de-duplication window skips the request when a second fetch lands 500ms after the first
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/stores/cartStore.ts:73:9
     const now = Date.now()
     const { lastFetchedAt } = get()
 
-    if (!force) {
+    if (false) {
       if (inFlightCartFetch) {
         return inFlightCartFetch
killedBy: cartStore fetchCart de-duplication window skips the request when a second fetch lands 500ms after the first
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/stores/cartStore.ts:74:11
     const { lastFetchedAt } = get()
 
     if (!force) {
-      if (inFlightCartFetch) {
+      if (true) {
         return inFlightCartFetch
       }
killedBy: cartStore fetchCart de-duplication window skips the request when a second fetch lands 500ms after the first
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/stores/cartStore.ts:74:11
     const { lastFetchedAt } = get()
 
     if (!force) {
-      if (inFlightCartFetch) {
+      if (false) {
         return inFlightCartFetch
       }
killedBy: cartStore fetchCart in-flight de-duplication collapses two same-tick fetches into a single request
statusReason: expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
src/stores/cartStore.ts:78:11
         return inFlightCartFetch
       }
 
-      if (now - lastFetchedAt < FETCH_DEDUP_WINDOW_MS) {
+      if (now - lastFetchedAt >= FETCH_DEDUP_WINDOW_MS) {
         return
       }
killedBy: cartStore fetchCart de-duplication window skips the request when a second fetch lands 500ms after the first
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/stores/cartStore.ts:78:11
         return inFlightCartFetch
       }
 
-      if (now - lastFetchedAt < FETCH_DEDUP_WINDOW_MS) {
+      if (now - lastFetchedAt <= FETCH_DEDUP_WINDOW_MS) {
         return
       }
killedBy: cartStore fetchCart de-duplication window fires at exactly 1000ms because the guard is a strict less-than
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/stores/cartStore.ts:84:24
     }
 
     const fetchTask = async () => {
-      set({ isLoading: true, error: null })
+      set({ isLoading: false, error: null })
       try {
         const cart = await cartAPI.getCart()
killedBy: cartStore transient isLoading/error at the start of a write fetchCart
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/stores/cartStore.ts:84:11
     }
 
     const fetchTask = async () => {
-      set({ isLoading: true, error: null })
+      set({})
       try {
         const cart = await cartAPI.getCart()
killedBy: cartStore fetchCart in-flight de-duplication does not block the next fetch after an in-flight request fails
statusReason: expected 'Request failed with status code 500' to be null

[Killed] BlockStatement
src/stores/cartStore.ts:85:11
 
     const fetchTask = async () => {
       set({ isLoading: true, error: null })
-      try {
-        const cart = await cartAPI.getCart()
-        set({
-          cartId: cart.cartId,
-          items: cart.cartItems,
-          cartCount: cart.cartItems.reduce((acc, item) => acc + item.quantity, 0),
-          isLoading: false,
-          lastFetchedAt: Date.now(),
-        })
-      } catch (error: unknown) {
+      try {} catch (error: unknown) {
         if (isAuthHandledError(error)) {
           set({ isLoading: false, lastFetchedAt: Date.now() })
killedBy: cartStore fetchCart de-duplication window skips the request when a second fetch lands 500ms after the first
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/stores/cartStore.ts:90:59
         set({
           cartId: cart.cartId,
           items: cart.cartItems,
-          cartCount: cart.cartItems.reduce((acc, item) => acc + item.quantity, 0),
+          cartCount: cart.cartItems.reduce((acc, item) => acc - item.quantity, 0),
           isLoading: false,
           lastFetchedAt: Date.now(),
killedBy: cartStore fetchCart success state derives cartCount from the sum of quantities, not the item count
statusReason: expected -6 to be 6 // Object.is equality

[Killed] ArrowFunction
src/stores/cartStore.ts:90:44
         set({
           cartId: cart.cartId,
           items: cart.cartItems,
-          cartCount: cart.cartItems.reduce((acc, item) => acc + item.quantity, 0),
+          cartCount: cart.cartItems.reduce(() => undefined, 0),
           isLoading: false,
           lastFetchedAt: Date.now(),
killedBy: cartStore fetchCart success state derives cartCount from the sum of quantities, not the item count
statusReason: expected undefined to be 6 // Object.is equality

[Killed] BooleanLiteral
src/stores/cartStore.ts:91:22
           cartId: cart.cartId,
           items: cart.cartItems,
           cartCount: cart.cartItems.reduce((acc, item) => acc + item.quantity, 0),
-          isLoading: false,
+          isLoading: true,
           lastFetchedAt: Date.now(),
         })
killedBy: cartStore fetchCart success state stores the cartId and clears isLoading
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/stores/cartStore.ts:94:32
           isLoading: false,
           lastFetchedAt: Date.now(),
         })
-      } catch (error: unknown) {
-        if (isAuthHandledError(error)) {
-          set({ isLoading: false, lastFetchedAt: Date.now() })
-          return
-        }
-
-        const status = extractErrorStatus(error)
-
-        // If 400 or 404, it might mean no cart exists yet
-        if (status === 400 || status === 404) {
-          set({ items: [], cartCount: 0, cartId: null, isLoading: false, lastFetchedAt: Date.now() })
-        } else {
-          const message = error instanceof Error ? error.message : "Failed to fetch cart"
-          set({ error: message, isLoading: false })
-        }
-      }
+      } catch (error: unknown) {}
     }
 
killedBy: cartStore fetchCart in-flight de-duplication does not block the next fetch after an in-flight request fails
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/stores/cartStore.ts:95:13
           lastFetchedAt: Date.now(),
         })
       } catch (error: unknown) {
-        if (isAuthHandledError(error)) {
+        if (true) {
           set({ isLoading: false, lastFetchedAt: Date.now() })
           return
killedBy: cartStore fetchCart in-flight de-duplication does not block the next fetch after an in-flight request fails
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/stores/cartStore.ts:95:13
           lastFetchedAt: Date.now(),
         })
       } catch (error: unknown) {
-        if (isAuthHandledError(error)) {
+        if (false) {
           set({ isLoading: false, lastFetchedAt: Date.now() })
           return
killedBy: cartStore fetchCart error matrix swallows an auth-handled 401 without an error but still arms the window
statusReason: expected 'Request failed with status code 401' to be null

[Killed] BooleanLiteral
src/stores/cartStore.ts:96:28
         })
       } catch (error: unknown) {
         if (isAuthHandledError(error)) {
-          set({ isLoading: false, lastFetchedAt: Date.now() })
+          set({ isLoading: true, lastFetchedAt: Date.now() })
           return
         }
killedBy: cartStore fetchCart error matrix swallows an auth-handled 401 without an error but still arms the window
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/stores/cartStore.ts:103:13
         const status = extractErrorStatus(error)
 
         // If 400 or 404, it might mean no cart exists yet
-        if (status === 400 || status === 404) {
+        if (false) {
           set({ items: [], cartCount: 0, cartId: null, isLoading: false, lastFetchedAt: Date.now() })
         } else {
killedBy: cartStore fetchCart error matrix treats 404 as an empty cart without setting an error
statusReason: expected 'Request failed with status code 404' to be null

[Killed] ConditionalExpression
src/stores/cartStore.ts:103:13
         const status = extractErrorStatus(error)
 
         // If 400 or 404, it might mean no cart exists yet
-        if (status === 400 || status === 404) {
+        if (false || status === 404) {
           set({ items: [], cartCount: 0, cartId: null, isLoading: false, lastFetchedAt: Date.now() })
         } else {
killedBy: cartStore fetchCart error matrix treats 400 as an empty cart without setting an error
statusReason: expected 'Request failed with status code 400' to be null

[Killed] BooleanLiteral
src/stores/cartStore.ts:104:67
 
         // If 400 or 404, it might mean no cart exists yet
         if (status === 400 || status === 404) {
-          set({ items: [], cartCount: 0, cartId: null, isLoading: false, lastFetchedAt: Date.now() })
+          set({ items: [], cartCount: 0, cartId: null, isLoading: true, lastFetchedAt: Date.now() })
         } else {
           const message = error instanceof Error ? error.message : "Failed to fetch cart"
killedBy: cartStore fetchCart error matrix treats 404 as an empty cart without setting an error
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/stores/cartStore.ts:105:16
         // If 400 or 404, it might mean no cart exists yet
         if (status === 400 || status === 404) {
           set({ items: [], cartCount: 0, cartId: null, isLoading: false, lastFetchedAt: Date.now() })
-        } else {
-          const message = error instanceof Error ? error.message : "Failed to fetch cart"
-          set({ error: message, isLoading: false })
-        }
+        } else {}
       }
     }
killedBy: cartStore fetchCart in-flight de-duplication does not block the next fetch after an in-flight request fails
statusReason: expected null not to be null

[Killed] StringLiteral
src/stores/cartStore.ts:106:68
         if (status === 400 || status === 404) {
           set({ items: [], cartCount: 0, cartId: null, isLoading: false, lastFetchedAt: Date.now() })
         } else {
-          const message = error instanceof Error ? error.message : "Failed to fetch cart"
+          const message = error instanceof Error ? error.message : ""
           set({ error: message, isLoading: false })
         }
killedBy: cartStore generic error message fallback for a non-Error rejection fetchCart
statusReason: expected '' to be 'Failed to fetch cart' // Object.is equality

[Killed] BooleanLiteral
src/stores/cartStore.ts:107:44
           set({ items: [], cartCount: 0, cartId: null, isLoading: false, lastFetchedAt: Date.now() })
         } else {
           const message = error instanceof Error ? error.message : "Failed to fetch cart"
-          set({ error: message, isLoading: false })
+          set({ error: message, isLoading: true })
         }
       }
killedBy: cartStore fetchCart error matrix sets an error on 500 and leaves lastFetchedAt untouched
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/stores/cartStore.ts:107:15
           set({ items: [], cartCount: 0, cartId: null, isLoading: false, lastFetchedAt: Date.now() })
         } else {
           const message = error instanceof Error ? error.message : "Failed to fetch cart"
-          set({ error: message, isLoading: false })
+          set({})
         }
       }
killedBy: cartStore fetchCart in-flight de-duplication does not block the next fetch after an in-flight request fails
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/stores/cartStore.ts:112:9
       }
     }
 
-    if (force) {
+    if (true) {
       await fetchTask()
       return
killedBy: cartStore fetchCart in-flight de-duplication collapses two same-tick fetches into a single request
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
src/stores/cartStore.ts:118:9
     }
 
     inFlightCartFetch = fetchTask()
-    try {
-      await inFlightCartFetch
-    } finally {
+    try {} finally {
       inFlightCartFetch = null
     }
killedBy: cartStore fetchCart de-duplication window skips the request when a second fetch lands 500ms after the first
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/stores/cartStore.ts:120:15
     inFlightCartFetch = fetchTask()
     try {
       await inFlightCartFetch
-    } finally {
-      inFlightCartFetch = null
-    }
+    } finally {}
   },
 
killedBy: cartStore fetchCart de-duplication window issues the request again once the window has elapsed (1001ms)
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/stores/cartStore.ts:125:64
     }
   },
 
-  addToCart: async (userProductId, quantity = 1, autoOrder) => {
-    set({ isLoading: true, error: null })
-    try {
-      await cartAPI.addItem(userProductId, quantity, resolveAutoOrder(get().items, userProductId, autoOrder))
-      await get().fetchCart({ force: true })
-    } catch (error: unknown) {
-      set({ isLoading: false })
-      if (isAuthHandledError(error)) {
-        throw error
-      }
-
-      const status = extractErrorStatus(error)
-      if (isAuthErrorStatus(status)) {
-        throw error
-      }
-
-      const message = error instanceof Error ? error.message : "Failed to add item"
-      set({ error: message })
-    }
-  },
+  addToCart: async (userProductId, quantity = 1, autoOrder) => {},
 
   removeFromCart: async (userProductId) => {
killedBy: cartStore resolveAutoOrder falls back to null when the product is not in the cart
statusReason: expected null to deeply equal { userProductId: 'up-unknown', …(2) }

[Killed] BooleanLiteral
src/stores/cartStore.ts:126:22
   },
 
   addToCart: async (userProductId, quantity = 1, autoOrder) => {
-    set({ isLoading: true, error: null })
+    set({ isLoading: false, error: null })
     try {
       await cartAPI.addItem(userProductId, quantity, resolveAutoOrder(get().items, userProductId, autoOrder))
killedBy: cartStore transient isLoading/error at the start of a write addToCart
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/stores/cartStore.ts:127:9
 
   addToCart: async (userProductId, quantity = 1, autoOrder) => {
     set({ isLoading: true, error: null })
-    try {
-      await cartAPI.addItem(userProductId, quantity, resolveAutoOrder(get().items, userProductId, autoOrder))
-      await get().fetchCart({ force: true })
-    } catch (error: unknown) {
+    try {} catch (error: unknown) {
       set({ isLoading: false })
       if (isAuthHandledError(error)) {
killedBy: cartStore resolveAutoOrder falls back to null when the product is not in the cart
statusReason: expected null to deeply equal { userProductId: 'up-unknown', …(2) }

[Killed] BooleanLiteral
src/stores/cartStore.ts:129:38
     set({ isLoading: true, error: null })
     try {
       await cartAPI.addItem(userProductId, quantity, resolveAutoOrder(get().items, userProductId, autoOrder))
-      await get().fetchCart({ force: true })
+      await get().fetchCart({ force: false })
     } catch (error: unknown) {
       set({ isLoading: false })
killedBy: cartStore post-write refetch bypasses the de-dup window addToCart
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/stores/cartStore.ts:130:30
     try {
       await cartAPI.addItem(userProductId, quantity, resolveAutoOrder(get().items, userProductId, autoOrder))
       await get().fetchCart({ force: true })
-    } catch (error: unknown) {
-      set({ isLoading: false })
-      if (isAuthHandledError(error)) {
-        throw error
-      }
-
-      const status = extractErrorStatus(error)
-      if (isAuthErrorStatus(status)) {
-        throw error
-      }
-
-      const message = error instanceof Error ? error.message : "Failed to add item"
-      set({ error: message })
-    }
+    } catch (error: unknown) {}
   },
 
killedBy: cartStore addToCart error contract throws on an auth-handled 401
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
src/stores/cartStore.ts:131:24
       await cartAPI.addItem(userProductId, quantity, resolveAutoOrder(get().items, userProductId, autoOrder))
       await get().fetchCart({ force: true })
     } catch (error: unknown) {
-      set({ isLoading: false })
+      set({ isLoading: true })
       if (isAuthHandledError(error)) {
         throw error
killedBy: cartStore addToCart error contract does NOT throw on a 403 - it lands in the error state instead
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/stores/cartStore.ts:132:38
       await get().fetchCart({ force: true })
     } catch (error: unknown) {
       set({ isLoading: false })
-      if (isAuthHandledError(error)) {
-        throw error
-      }
+      if (isAuthHandledError(error)) {}
 
       const status = extractErrorStatus(error)
killedBy: cartStore addToCart auth checks are each independently load-bearing still throws when the interceptor already marked the error auth-handled, even at a non-401 status
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/stores/cartStore.ts:132:11
       await get().fetchCart({ force: true })
     } catch (error: unknown) {
       set({ isLoading: false })
-      if (isAuthHandledError(error)) {
+      if (true) {
         throw error
       }
killedBy: cartStore addToCart error contract does NOT throw on a 403 - it lands in the error state instead
statusReason: promise rejected "AxiosError: Request failed with status co… { …(6) }" instead of resolving

[Killed] ConditionalExpression
src/stores/cartStore.ts:137:11
       }
 
       const status = extractErrorStatus(error)
-      if (isAuthErrorStatus(status)) {
+      if (true) {
         throw error
       }
killedBy: cartStore addToCart error contract does NOT throw on a 403 - it lands in the error state instead
statusReason: promise rejected "AxiosError: Request failed with status co… { …(6) }" instead of resolving

[Killed] ConditionalExpression
src/stores/cartStore.ts:137:11
       }
 
       const status = extractErrorStatus(error)
-      if (isAuthErrorStatus(status)) {
+      if (false) {
         throw error
       }
killedBy: cartStore addToCart auth checks are each independently load-bearing still throws on a 401 even when the interceptor has not marked it auth-handled
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ObjectLiteral
src/stores/cartStore.ts:142:11
       }
 
       const message = error instanceof Error ? error.message : "Failed to add item"
-      set({ error: message })
+      set({})
     }
   },
killedBy: cartStore addToCart error contract does NOT throw on a 403 - it lands in the error state instead
statusReason: expected null to be 'Request failed with status code 403' // Object.is equality

[Killed] BlockStatement
src/stores/cartStore.ts:146:44
     }
   },
 
-  removeFromCart: async (userProductId) => {
-    set({ isLoading: true, error: null })
-    try {
-      await cartAPI.removeItem(userProductId)
-      await get().fetchCart({ force: true })
-    } catch (error: unknown) {
-      if (isAuthHandledError(error)) {
-        set({ isLoading: false })
-        return
-      }
-
-      const message = error instanceof Error ? error.message : "Failed to remove item"
-      set({ error: message, isLoading: false })
-    }
-  },
+  removeFromCart: async (userProductId) => {},
 
   updateQuantity: async (userProductId, quantity, autoOrder) => {
killedBy: cartStore setItemAutoOrder delegates to removeFromCart when the resolved quantity is zero
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/stores/cartStore.ts:147:22
   },
 
   removeFromCart: async (userProductId) => {
-    set({ isLoading: true, error: null })
+    set({ isLoading: false, error: null })
     try {
       await cartAPI.removeItem(userProductId)
killedBy: cartStore transient isLoading/error at the start of a write removeFromCart
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/stores/cartStore.ts:147:9
   },
 
   removeFromCart: async (userProductId) => {
-    set({ isLoading: true, error: null })
+    set({})
     try {
       await cartAPI.removeItem(userProductId)
killedBy: cartStore transient isLoading/error at the start of a write removeFromCart
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/stores/cartStore.ts:148:9
 
   removeFromCart: async (userProductId) => {
     set({ isLoading: true, error: null })
-    try {
-      await cartAPI.removeItem(userProductId)
-      await get().fetchCart({ force: true })
-    } catch (error: unknown) {
+    try {} catch (error: unknown) {
       if (isAuthHandledError(error)) {
         set({ isLoading: false })
killedBy: cartStore setItemAutoOrder delegates to removeFromCart when the resolved quantity is zero
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/stores/cartStore.ts:150:38
     set({ isLoading: true, error: null })
     try {
       await cartAPI.removeItem(userProductId)
-      await get().fetchCart({ force: true })
+      await get().fetchCart({ force: false })
     } catch (error: unknown) {
       if (isAuthHandledError(error)) {
killedBy: useCartPage removing items drops the last item and falls back to the empty view
statusReason: expected 'ready' to be 'empty' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ObjectLiteral
src/stores/cartStore.ts:150:29
     set({ isLoading: true, error: null })
     try {
       await cartAPI.removeItem(userProductId)
-      await get().fetchCart({ force: true })
+      await get().fetchCart({})
     } catch (error: unknown) {
       if (isAuthHandledError(error)) {
killedBy: useCartPage removing items drops the last item and falls back to the empty view
statusReason: expected 'ready' to be 'empty' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/stores/cartStore.ts:151:30
     try {
       await cartAPI.removeItem(userProductId)
       await get().fetchCart({ force: true })
-    } catch (error: unknown) {
-      if (isAuthHandledError(error)) {
-        set({ isLoading: false })
-        return
-      }
-
-      const message = error instanceof Error ? error.message : "Failed to remove item"
-      set({ error: message, isLoading: false })
-    }
+    } catch (error: unknown) {}
   },
 
killedBy: cartStore removeFromCart error contract records a 500 as an error state
statusReason: expected null to be 'Request failed with status code 500' // Object.is equality

[Killed] BooleanLiteral
src/stores/cartStore.ts:153:26
       await get().fetchCart({ force: true })
     } catch (error: unknown) {
       if (isAuthHandledError(error)) {
-        set({ isLoading: false })
+        set({ isLoading: true })
         return
       }
killedBy: cartStore removeFromCart error contract returns silently on an auth-handled 401 - no throw, no error state
statusReason: expected true to be false // Object.is equality
