[Killed] ObjectLiteral
src/stores/cartStore.ts:153:13
       await get().fetchCart({ force: true })
     } catch (error: unknown) {
       if (isAuthHandledError(error)) {
-        set({ isLoading: false })
+        set({})
         return
       }
killedBy: cartStore auth-handled branches reset isLoading on their own, independent of the logout cascade removeFromCart
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/stores/cartStore.ts:158:40
       }
 
       const message = error instanceof Error ? error.message : "Failed to remove item"
-      set({ error: message, isLoading: false })
+      set({ error: message, isLoading: true })
     }
   },
killedBy: cartStore removeFromCart error contract records a 500 as an error state
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/stores/cartStore.ts:158:11
       }
 
       const message = error instanceof Error ? error.message : "Failed to remove item"
-      set({ error: message, isLoading: false })
+      set({})
     }
   },
killedBy: cartStore removeFromCart error contract records a 500 as an error state
statusReason: expected null to be 'Request failed with status code 500' // Object.is equality

[Killed] BlockStatement
src/stores/cartStore.ts:162:65
     }
   },
 
-  updateQuantity: async (userProductId, quantity, autoOrder) => {
-    if (quantity <= 0) {
-      await get().removeFromCart(userProductId)
-      return
-    }
-    set({ isLoading: true, error: null })
-    try {
-      await cartAPI.updateItemQuantity(userProductId, quantity, resolveAutoOrder(get().items, userProductId, autoOrder))
-      await get().fetchCart({ force: true })
-    } catch (error: unknown) {
-      if (isAuthHandledError(error)) {
-        set({ isLoading: false })
-        return
-      }
-
-      const message = error instanceof Error ? error.message : "Failed to update quantity"
-      set({ error: message, isLoading: false })
-    }
-  },
+  updateQuantity: async (userProductId, quantity, autoOrder) => {},
 
   /**
killedBy: useCartPage quantity debounce collapses three rapid clicks into a single PUT carrying the last value
statusReason: expected [] to have a length of 1 but got +0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/stores/cartStore.ts:163:24
   },
 
   updateQuantity: async (userProductId, quantity, autoOrder) => {
-    if (quantity <= 0) {
-      await get().removeFromCart(userProductId)
-      return
-    }
+    if (quantity <= 0) {}
     set({ isLoading: true, error: null })
     try {
killedBy: cartStore updateQuantity error contract delegates to removeFromCart at quantity 0
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/stores/cartStore.ts:163:9
   },
 
   updateQuantity: async (userProductId, quantity, autoOrder) => {
-    if (quantity <= 0) {
+    if (false) {
       await get().removeFromCart(userProductId)
       return
killedBy: cartStore updateQuantity error contract delegates to removeFromCart at quantity 0
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/stores/cartStore.ts:167:22
       await get().removeFromCart(userProductId)
       return
     }
-    set({ isLoading: true, error: null })
+    set({ isLoading: false, error: null })
     try {
       await cartAPI.updateItemQuantity(userProductId, quantity, resolveAutoOrder(get().items, userProductId, autoOrder))
killedBy: cartStore transient isLoading/error at the start of a write updateQuantity
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/stores/cartStore.ts:167:9
       await get().removeFromCart(userProductId)
       return
     }
-    set({ isLoading: true, error: null })
+    set({})
     try {
       await cartAPI.updateItemQuantity(userProductId, quantity, resolveAutoOrder(get().items, userProductId, autoOrder))
killedBy: cartStore transient isLoading/error at the start of a write updateQuantity
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/stores/cartStore.ts:168:9
       return
     }
     set({ isLoading: true, error: null })
-    try {
-      await cartAPI.updateItemQuantity(userProductId, quantity, resolveAutoOrder(get().items, userProductId, autoOrder))
-      await get().fetchCart({ force: true })
-    } catch (error: unknown) {
+    try {} catch (error: unknown) {
       if (isAuthHandledError(error)) {
         set({ isLoading: false })
killedBy: useCartPage quantity debounce collapses three rapid clicks into a single PUT carrying the last value
statusReason: expected [] to have a length of 1 but got +0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/stores/cartStore.ts:170:38
     set({ isLoading: true, error: null })
     try {
       await cartAPI.updateItemQuantity(userProductId, quantity, resolveAutoOrder(get().items, userProductId, autoOrder))
-      await get().fetchCart({ force: true })
+      await get().fetchCart({ force: false })
     } catch (error: unknown) {
       if (isAuthHandledError(error)) {
killedBy: cartStore post-write refetch bypasses the de-dup window updateQuantity
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/stores/cartStore.ts:171:30
     try {
       await cartAPI.updateItemQuantity(userProductId, quantity, resolveAutoOrder(get().items, userProductId, autoOrder))
       await get().fetchCart({ force: true })
-    } catch (error: unknown) {
-      if (isAuthHandledError(error)) {
-        set({ isLoading: false })
-        return
-      }
-
-      const message = error instanceof Error ? error.message : "Failed to update quantity"
-      set({ error: message, isLoading: false })
-    }
+    } catch (error: unknown) {}
   },
 
killedBy: cartStore updateQuantity error contract records a 500 as an error state without throwing
statusReason: expected null to be 'Request failed with status code 500' // Object.is equality

[Killed] StringLiteral
src/stores/cartStore.ts:177:64
         return
       }
 
-      const message = error instanceof Error ? error.message : "Failed to update quantity"
+      const message = error instanceof Error ? error.message : ""
       set({ error: message, isLoading: false })
     }
killedBy: cartStore generic error message fallback for a non-Error rejection updateQuantity
statusReason: expected '' to be 'Failed to update quantity' // Object.is equality

[Killed] BooleanLiteral
src/stores/cartStore.ts:178:40
       }
 
       const message = error instanceof Error ? error.message : "Failed to update quantity"
-      set({ error: message, isLoading: false })
+      set({ error: message, isLoading: true })
     }
   },
killedBy: cartStore updateQuantity error contract records a 500 as an error state without throwing
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/stores/cartStore.ts:178:11
       }
 
       const message = error instanceof Error ? error.message : "Failed to update quantity"
-      set({ error: message, isLoading: false })
+      set({})
     }
   },
killedBy: useCartPage quantity debounce rolls the displayed quantity back when the PUT fails
statusReason: expected "spy" to be called with arguments: [ 'Cart unavailable', Any<String> ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/stores/cartStore.ts:186:67
    * Quantity and schedule share one endpoint, so an explicit `quantity` lets the
    * caller flush a still-debounced quantity edit in the same write.
    */
-  setItemAutoOrder: async (userProductId, autoOrder, quantity) => {
-    const item = findItem(get().items, userProductId)
-    if (!item) return
-
-    const nextQuantity = quantity ?? item.quantity
-    if (nextQuantity <= 0) {
-      await get().removeFromCart(userProductId)
-      return
-    }
-
-    set({ isLoading: true, error: null })
-    try {
-      await cartAPI.updateItemQuantity(userProductId, nextQuantity, autoOrder)
-      await get().fetchCart({ force: true })
-    } catch (error: unknown) {
-      set({ isLoading: false })
-      if (isAuthHandledError(error)) {
-        return
-      }
-
-      throw error
-    }
-  },
+  setItemAutoOrder: async (userProductId, autoOrder, quantity) => {},
 
   clearCart: async () => {
killedBy: cartStore setItemAutoOrder reuses the item's current quantity when none is given
statusReason: expected null to deeply equal { userProductId: 'up-1', …(2) }

[Killed] BooleanLiteral
src/stores/cartStore.ts:188:9
    */
   setItemAutoOrder: async (userProductId, autoOrder, quantity) => {
     const item = findItem(get().items, userProductId)
-    if (!item) return
+    if (item) return
 
     const nextQuantity = quantity ?? item.quantity
killedBy: cartStore setItemAutoOrder is a silent no-op for a product that is not in the cart
statusReason: Cannot read properties of undefined (reading 'quantity')

[Killed] ConditionalExpression
src/stores/cartStore.ts:188:9
    */
   setItemAutoOrder: async (userProductId, autoOrder, quantity) => {
     const item = findItem(get().items, userProductId)
-    if (!item) return
+    if (true) return
 
     const nextQuantity = quantity ?? item.quantity
killedBy: cartStore setItemAutoOrder reuses the item's current quantity when none is given
statusReason: expected null to deeply equal { userProductId: 'up-1', …(2) }

[Killed] LogicalOperator
src/stores/cartStore.ts:190:26
     const item = findItem(get().items, userProductId)
     if (!item) return
 
-    const nextQuantity = quantity ?? item.quantity
+    const nextQuantity = quantity && item.quantity
     if (nextQuantity <= 0) {
       await get().removeFromCart(userProductId)
killedBy: cartStore setItemAutoOrder reuses the item's current quantity when none is given
statusReason: expected { userProductId: 'up-1', …(1) } to deeply equal { userProductId: 'up-1', …(2) }

[Killed] EqualityOperator
src/stores/cartStore.ts:191:9
     if (!item) return
 
     const nextQuantity = quantity ?? item.quantity
-    if (nextQuantity <= 0) {
+    if (nextQuantity > 0) {
       await get().removeFromCart(userProductId)
       return
killedBy: cartStore setItemAutoOrder reuses the item's current quantity when none is given
statusReason: expected null to deeply equal { userProductId: 'up-1', …(2) }

[Killed] ConditionalExpression
src/stores/cartStore.ts:191:9
     if (!item) return
 
     const nextQuantity = quantity ?? item.quantity
-    if (nextQuantity <= 0) {
+    if (false) {
       await get().removeFromCart(userProductId)
       return
killedBy: cartStore setItemAutoOrder delegates to removeFromCart when the resolved quantity is zero
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/stores/cartStore.ts:196:22
       return
     }
 
-    set({ isLoading: true, error: null })
+    set({ isLoading: false, error: null })
     try {
       await cartAPI.updateItemQuantity(userProductId, nextQuantity, autoOrder)
killedBy: cartStore transient isLoading/error at the start of a write setItemAutoOrder
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/stores/cartStore.ts:197:9
     }
 
     set({ isLoading: true, error: null })
-    try {
-      await cartAPI.updateItemQuantity(userProductId, nextQuantity, autoOrder)
-      await get().fetchCart({ force: true })
-    } catch (error: unknown) {
+    try {} catch (error: unknown) {
       set({ isLoading: false })
       if (isAuthHandledError(error)) {
killedBy: cartStore setItemAutoOrder reuses the item's current quantity when none is given
statusReason: expected null to deeply equal { userProductId: 'up-1', …(2) }

[Killed] BooleanLiteral
src/stores/cartStore.ts:199:38
     set({ isLoading: true, error: null })
     try {
       await cartAPI.updateItemQuantity(userProductId, nextQuantity, autoOrder)
-      await get().fetchCart({ force: true })
+      await get().fetchCart({ force: false })
     } catch (error: unknown) {
       set({ isLoading: false })
killedBy: cartStore post-write refetch bypasses the de-dup window setItemAutoOrder
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/stores/cartStore.ts:200:30
     try {
       await cartAPI.updateItemQuantity(userProductId, nextQuantity, autoOrder)
       await get().fetchCart({ force: true })
-    } catch (error: unknown) {
-      set({ isLoading: false })
-      if (isAuthHandledError(error)) {
-        return
-      }
-
-      throw error
-    }
+    } catch (error: unknown) {}
   },
 
killedBy: cartStore setItemAutoOrder rethrows a non-auth failure and clears isLoading
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/stores/cartStore.ts:202:11
       await get().fetchCart({ force: true })
     } catch (error: unknown) {
       set({ isLoading: false })
-      if (isAuthHandledError(error)) {
+      if (false) {
         return
       }
killedBy: cartStore setItemAutoOrder swallows an auth-handled failure without rethrowing
statusReason: promise rejected "AxiosError: Request failed with status co… { …(7) }" instead of resolving

[Killed] BlockStatement
src/stores/cartStore.ts:210:26
     }
   },
 
-  clearCart: async () => {
-    const { cartId } = get()
-    if (!cartId) return
-    set({ isLoading: true, error: null })
-    try {
-      await cartAPI.clearCart(cartId)
-      set({ items: [], cartCount: 0, cartId: null, isLoading: false })
-    } catch (error: unknown) {
-      if (isAuthHandledError(error)) {
-        set({ isLoading: false })
-        return
-      }
-
-      const message = error instanceof Error ? error.message : "Failed to clear cart"
-      set({ error: message, isLoading: false })
-    }
-  },
+  clearCart: async () => {},
 }))
 export type { CartItem }
killedBy: cartStore clearCart empties the local cart after a successful clear
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/stores/cartStore.ts:212:9
 
   clearCart: async () => {
     const { cartId } = get()
-    if (!cartId) return
+    if (cartId) return
     set({ isLoading: true, error: null })
     try {
killedBy: cartStore clearCart is a no-op while cartId is null
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/stores/cartStore.ts:212:9
 
   clearCart: async () => {
     const { cartId } = get()
-    if (!cartId) return
+    if (false) return
     set({ isLoading: true, error: null })
     try {
killedBy: cartStore clearCart is a no-op while cartId is null
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/stores/cartStore.ts:213:22
   clearCart: async () => {
     const { cartId } = get()
     if (!cartId) return
-    set({ isLoading: true, error: null })
+    set({ isLoading: false, error: null })
     try {
       await cartAPI.clearCart(cartId)
killedBy: cartStore transient isLoading/error at the start of a write clearCart
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/stores/cartStore.ts:213:9
   clearCart: async () => {
     const { cartId } = get()
     if (!cartId) return
-    set({ isLoading: true, error: null })
+    set({})
     try {
       await cartAPI.clearCart(cartId)
killedBy: cartStore transient isLoading/error at the start of a write clearCart
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/stores/cartStore.ts:214:9
     const { cartId } = get()
     if (!cartId) return
     set({ isLoading: true, error: null })
-    try {
-      await cartAPI.clearCart(cartId)
-      set({ items: [], cartCount: 0, cartId: null, isLoading: false })
-    } catch (error: unknown) {
+    try {} catch (error: unknown) {
       if (isAuthHandledError(error)) {
         set({ isLoading: false })
killedBy: cartStore clearCart empties the local cart after a successful clear
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/stores/cartStore.ts:216:63
     set({ isLoading: true, error: null })
     try {
       await cartAPI.clearCart(cartId)
-      set({ items: [], cartCount: 0, cartId: null, isLoading: false })
+      set({ items: [], cartCount: 0, cartId: null, isLoading: true })
     } catch (error: unknown) {
       if (isAuthHandledError(error)) {
killedBy: useCartPage clearing the cart empties the cart, closes the confirmation and drops pending writes
statusReason: expected 'loading' to be 'empty' // Object.is equality

[Killed] ObjectLiteral
src/stores/cartStore.ts:216:11
     set({ isLoading: true, error: null })
     try {
       await cartAPI.clearCart(cartId)
-      set({ items: [], cartCount: 0, cartId: null, isLoading: false })
+      set({})
     } catch (error: unknown) {
       if (isAuthHandledError(error)) {
killedBy: cartStore clearCart empties the local cart after a successful clear
statusReason: expected [ { id: 'ci-1', quantity: 2, …(3) } ] to deeply equal []

[Killed] BlockStatement
src/stores/cartStore.ts:217:30
     try {
       await cartAPI.clearCart(cartId)
       set({ items: [], cartCount: 0, cartId: null, isLoading: false })
-    } catch (error: unknown) {
-      if (isAuthHandledError(error)) {
-        set({ isLoading: false })
-        return
-      }
-
-      const message = error instanceof Error ? error.message : "Failed to clear cart"
-      set({ error: message, isLoading: false })
-    }
+    } catch (error: unknown) {}
   },
 }))
killedBy: cartStore clearCart records a 500 as an error state and keeps the items
statusReason: expected null to be 'Request failed with status code 500' // Object.is equality

[Killed] BlockStatement
src/stores/cartStore.ts:218:38
       await cartAPI.clearCart(cartId)
       set({ items: [], cartCount: 0, cartId: null, isLoading: false })
     } catch (error: unknown) {
-      if (isAuthHandledError(error)) {
-        set({ isLoading: false })
-        return
-      }
+      if (isAuthHandledError(error)) {}
 
       const message = error instanceof Error ? error.message : "Failed to clear cart"
killedBy: cartStore clearCart returns silently on an auth-handled 401
statusReason: expected 'Request failed with status code 401' to be null

[Killed] BooleanLiteral
src/stores/cartStore.ts:224:40
       }
 
       const message = error instanceof Error ? error.message : "Failed to clear cart"
-      set({ error: message, isLoading: false })
+      set({ error: message, isLoading: true })
     }
   },
killedBy: cartStore clearCart records a 500 as an error state and keeps the items
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/stores/cartStore.ts:224:11
       }
 
       const message = error instanceof Error ? error.message : "Failed to clear cart"
-      set({ error: message, isLoading: false })
+      set({})
     }
   },
killedBy: cartStore clearCart records a 500 as an error state and keeps the items
statusReason: expected null to be 'Request failed with status code 500' // Object.is equality
