[Killed] StringLiteral
src/stores/checkoutStore.ts:93:14
 }
 
 const initialShippingAddress: ShippingAddress = {
-  firstName: "Michael",
+  firstName: "",
   lastName: "Chen",
   company: "Pacific Dental Group",
killedBy: checkoutStore baseline state ships hardcoded demo data as the shipping address
statusReason: expected { firstName: '', …(7) } to deeply equal { firstName: 'Michael', …(7) }

[Killed] BooleanLiteral
src/stores/checkoutStore.ts:116:22
   poNumber: "",
   department: "",
   specialInstructions: "",
-  applyTaxExemption: true,
+  applyTaxExemption: false,
   saveCard: false,
   cardName: "",
killedBy: checkoutStore defaults starts every field at its documented empty/off default
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/stores/checkoutStore.ts:117:13
   department: "",
   specialInstructions: "",
   applyTaxExemption: true,
-  saveCard: false,
+  saveCard: true,
   cardName: "",
   selectedSavedCardId: "",
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] StringLiteral
src/stores/checkoutStore.ts:118:13
   specialInstructions: "",
   applyTaxExemption: true,
   saveCard: false,
-  cardName: "",
+  cardName: "Stryker was here!",
   selectedSavedCardId: "",
   paymentMethodId: "",
killedBy: checkoutStore defaults starts every field at its documented empty/off default
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] BooleanLiteral
src/stores/checkoutStore.ts:122:21
   selectedSavedCardId: "",
   paymentMethodId: "",
   paymentMethodSummary: "",
-  autoOrderConsent: false,
+  autoOrderConsent: true,
   newCardAutoPaymentConsent: false,
   autoOrderUserProductIds: [],
killedBy: checkoutStore defaults starts every field at its documented empty/off default
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/stores/checkoutStore.ts:123:30
   paymentMethodId: "",
   paymentMethodSummary: "",
   autoOrderConsent: false,
-  newCardAutoPaymentConsent: false,
+  newCardAutoPaymentConsent: true,
   autoOrderUserProductIds: [],
   termsAgreed: false,
killedBy: checkoutStore defaults starts every field at its documented empty/off default
statusReason: expected true to be false // Object.is equality

[Killed] ArrayDeclaration
src/stores/checkoutStore.ts:124:28
   paymentMethodSummary: "",
   autoOrderConsent: false,
   newCardAutoPaymentConsent: false,
-  autoOrderUserProductIds: [],
+  autoOrderUserProductIds: ["Stryker was here"],
   termsAgreed: false,
   selectedShippingEtaText: "",
killedBy: checkoutStore defaults starts every field at its documented empty/off default
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] BooleanLiteral
src/stores/checkoutStore.ts:125:16
   autoOrderConsent: false,
   newCardAutoPaymentConsent: false,
   autoOrderUserProductIds: [],
-  termsAgreed: false,
+  termsAgreed: true,
   selectedShippingEtaText: "",
   selectedVendorShippingMethods: {},
killedBy: checkoutStore defaults starts every field at its documented empty/off default
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/stores/checkoutStore.ts:129:12
   selectedShippingEtaText: "",
   selectedVendorShippingMethods: {},
   selectedShippingCost: 0,
-  setStep: (step) => set({ currentStep: step }),
+  setStep: () => undefined,
   nextStep: () => set((state) => ({ currentStep: Math.min(5, state.currentStep + 1) as CheckoutStep })),
   previousStep: () => set((state) => ({ currentStep: Math.max(1, state.currentStep - 1) as CheckoutStep })),
killedBy: checkoutStore step navigation sets an arbitrary step directly
statusReason: expected 1 to be 4 // Object.is equality

[Killed] ArrowFunction
src/stores/checkoutStore.ts:130:23
   selectedVendorShippingMethods: {},
   selectedShippingCost: 0,
   setStep: (step) => set({ currentStep: step }),
-  nextStep: () => set((state) => ({ currentStep: Math.min(5, state.currentStep + 1) as CheckoutStep })),
+  nextStep: () => set(() => undefined),
   previousStep: () => set((state) => ({ currentStep: Math.max(1, state.currentStep - 1) as CheckoutStep })),
   updateShippingAddress: (address) => set((state) => ({ shippingAddress: { ...state.shippingAddress, ...address } })),
killedBy: useBillingInformation — submit guards advances a non-card payment method without touching Stripe
statusReason: Cannot destructure property 'autoOrderConsent' of 'useCheckoutStore(...)' as it is undefined.

[Killed] ArrowFunction
src/stores/checkoutStore.ts:130:13
   selectedVendorShippingMethods: {},
   selectedShippingCost: 0,
   setStep: (step) => set({ currentStep: step }),
-  nextStep: () => set((state) => ({ currentStep: Math.min(5, state.currentStep + 1) as CheckoutStep })),
+  nextStep: () => undefined,
   previousStep: () => set((state) => ({ currentStep: Math.max(1, state.currentStep - 1) as CheckoutStep })),
   updateShippingAddress: (address) => set((state) => ({ shippingAddress: { ...state.shippingAddress, ...address } })),
killedBy: useFinalReview — happy path charges the card, resolves the status and moves to the confirmation step
statusReason: expected 4 to be 5 // Object.is equality

[Killed] ArrowFunction
src/stores/checkoutStore.ts:131:17
   selectedShippingCost: 0,
   setStep: (step) => set({ currentStep: step }),
   nextStep: () => set((state) => ({ currentStep: Math.min(5, state.currentStep + 1) as CheckoutStep })),
-  previousStep: () => set((state) => ({ currentStep: Math.max(1, state.currentStep - 1) as CheckoutStep })),
+  previousStep: () => undefined,
   updateShippingAddress: (address) => set((state) => ({ shippingAddress: { ...state.shippingAddress, ...address } })),
   updatePaymentMethod: (method) => set((state) => ({ paymentMethod: { ...state.paymentMethod, ...method } })),
killedBy: checkoutStore step navigation walks back down from 5 to 1 without underflowing
statusReason: expected 5 to be 1 // Object.is equality

[Killed] ArrowFunction
src/stores/checkoutStore.ts:131:27
   selectedShippingCost: 0,
   setStep: (step) => set({ currentStep: step }),
   nextStep: () => set((state) => ({ currentStep: Math.min(5, state.currentStep + 1) as CheckoutStep })),
-  previousStep: () => set((state) => ({ currentStep: Math.max(1, state.currentStep - 1) as CheckoutStep })),
+  previousStep: () => set(() => undefined),
   updateShippingAddress: (address) => set((state) => ({ shippingAddress: { ...state.shippingAddress, ...address } })),
   updatePaymentMethod: (method) => set((state) => ({ paymentMethod: { ...state.paymentMethod, ...method } })),
killedBy: checkoutStore step navigation clamps previousStep at 1
statusReason: Cannot read properties of undefined (reading 'previousStep')

[Killed] ArrowFunction
src/stores/checkoutStore.ts:132:43
   setStep: (step) => set({ currentStep: step }),
   nextStep: () => set((state) => ({ currentStep: Math.min(5, state.currentStep + 1) as CheckoutStep })),
   previousStep: () => set((state) => ({ currentStep: Math.max(1, state.currentStep - 1) as CheckoutStep })),
-  updateShippingAddress: (address) => set((state) => ({ shippingAddress: { ...state.shippingAddress, ...address } })),
+  updateShippingAddress: (address) => set(() => undefined),
   updatePaymentMethod: (method) => set((state) => ({ paymentMethod: { ...state.paymentMethod, ...method } })),
   updatePONumber: (po) => set({ poNumber: po }),
killedBy: useShippingDetails — address selection selects the address flagged as default and copies it into the checkout store
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ArrowFunction
src/stores/checkoutStore.ts:132:26
   setStep: (step) => set({ currentStep: step }),
   nextStep: () => set((state) => ({ currentStep: Math.min(5, state.currentStep + 1) as CheckoutStep })),
   previousStep: () => set((state) => ({ currentStep: Math.max(1, state.currentStep - 1) as CheckoutStep })),
-  updateShippingAddress: (address) => set((state) => ({ shippingAddress: { ...state.shippingAddress, ...address } })),
+  updateShippingAddress: () => undefined,
   updatePaymentMethod: (method) => set((state) => ({ paymentMethod: { ...state.paymentMethod, ...method } })),
   updatePONumber: (po) => set({ poNumber: po }),
killedBy: checkoutStore address and order metadata merges partial shipping address updates
statusReason: expected { firstName: 'Michael', …(7) } to match object { firstName: 'Michael', …(2) }
(5 matching properties omitted from actual)

[Killed] ArrowFunction
src/stores/checkoutStore.ts:133:24
   nextStep: () => set((state) => ({ currentStep: Math.min(5, state.currentStep + 1) as CheckoutStep })),
   previousStep: () => set((state) => ({ currentStep: Math.max(1, state.currentStep - 1) as CheckoutStep })),
   updateShippingAddress: (address) => set((state) => ({ shippingAddress: { ...state.shippingAddress, ...address } })),
-  updatePaymentMethod: (method) => set((state) => ({ paymentMethod: { ...state.paymentMethod, ...method } })),
+  updatePaymentMethod: () => undefined,
   updatePONumber: (po) => set({ poNumber: po }),
   updateDepartment: (dept) => set({ department: dept }),
killedBy: checkoutStore payment method accepts the net30 payment type
statusReason: expected 'card' to be 'net30' // Object.is equality

[Killed] ArrowFunction
src/stores/checkoutStore.ts:133:40
   nextStep: () => set((state) => ({ currentStep: Math.min(5, state.currentStep + 1) as CheckoutStep })),
   previousStep: () => set((state) => ({ currentStep: Math.max(1, state.currentStep - 1) as CheckoutStep })),
   updateShippingAddress: (address) => set((state) => ({ shippingAddress: { ...state.shippingAddress, ...address } })),
-  updatePaymentMethod: (method) => set((state) => ({ paymentMethod: { ...state.paymentMethod, ...method } })),
+  updatePaymentMethod: (method) => set(() => undefined),
   updatePONumber: (po) => set({ poNumber: po }),
   updateDepartment: (dept) => set({ department: dept }),
killedBy: checkoutStore payment method accepts the card payment type
statusReason: Cannot read properties of undefined (reading 'paymentMethod')

[Killed] ArrowFunction
src/stores/checkoutStore.ts:134:19
   previousStep: () => set((state) => ({ currentStep: Math.max(1, state.currentStep - 1) as CheckoutStep })),
   updateShippingAddress: (address) => set((state) => ({ shippingAddress: { ...state.shippingAddress, ...address } })),
   updatePaymentMethod: (method) => set((state) => ({ paymentMethod: { ...state.paymentMethod, ...method } })),
-  updatePONumber: (po) => set({ poNumber: po }),
+  updatePONumber: () => undefined,
   updateDepartment: (dept) => set({ department: dept }),
   updateSpecialInstructions: (instructions) => set({ specialInstructions: instructions }),
killedBy: checkoutStore address and order metadata stores the purchase order metadata
statusReason: expected { currentStep: 1, …(44) } to match object { poNumber: 'PO-9001', …(2) }
(51 matching properties omitted from actual)

[Killed] ArrowFunction
src/stores/checkoutStore.ts:135:21
   updateShippingAddress: (address) => set((state) => ({ shippingAddress: { ...state.shippingAddress, ...address } })),
   updatePaymentMethod: (method) => set((state) => ({ paymentMethod: { ...state.paymentMethod, ...method } })),
   updatePONumber: (po) => set({ poNumber: po }),
-  updateDepartment: (dept) => set({ department: dept }),
+  updateDepartment: () => undefined,
   updateSpecialInstructions: (instructions) => set({ specialInstructions: instructions }),
   setApplyTaxExemption: (apply) => set({ applyTaxExemption: apply }),
killedBy: checkoutStore address and order metadata stores the purchase order metadata
statusReason: expected { currentStep: 1, …(44) } to match object { poNumber: 'PO-9001', …(2) }
(51 matching properties omitted from actual)

[Killed] ArrowFunction
src/stores/checkoutStore.ts:136:30
   updatePaymentMethod: (method) => set((state) => ({ paymentMethod: { ...state.paymentMethod, ...method } })),
   updatePONumber: (po) => set({ poNumber: po }),
   updateDepartment: (dept) => set({ department: dept }),
-  updateSpecialInstructions: (instructions) => set({ specialInstructions: instructions }),
+  updateSpecialInstructions: () => undefined,
   setApplyTaxExemption: (apply) => set({ applyTaxExemption: apply }),
   setSaveCard: (save) => set({ saveCard: save }),
killedBy: checkoutStore address and order metadata stores the purchase order metadata
statusReason: expected { currentStep: 1, …(44) } to match object { poNumber: 'PO-9001', …(2) }
(51 matching properties omitted from actual)

[Killed] ArrowFunction
src/stores/checkoutStore.ts:137:25
   updatePONumber: (po) => set({ poNumber: po }),
   updateDepartment: (dept) => set({ department: dept }),
   updateSpecialInstructions: (instructions) => set({ specialInstructions: instructions }),
-  setApplyTaxExemption: (apply) => set({ applyTaxExemption: apply }),
+  setApplyTaxExemption: () => undefined,
   setSaveCard: (save) => set({ saveCard: save }),
   setCardName: (name) => set({ cardName: name }),
killedBy: checkoutStore address and order metadata stores the card save preferences and terms agreement
statusReason: expected { currentStep: 1, …(44) } to match object { saveCard: true, …(3) }
(50 matching properties omitted from actual)

[Killed] ArrowFunction
src/stores/checkoutStore.ts:138:16
   updateDepartment: (dept) => set({ department: dept }),
   updateSpecialInstructions: (instructions) => set({ specialInstructions: instructions }),
   setApplyTaxExemption: (apply) => set({ applyTaxExemption: apply }),
-  setSaveCard: (save) => set({ saveCard: save }),
+  setSaveCard: () => undefined,
   setCardName: (name) => set({ cardName: name }),
   setSelectedSavedCardId: (cardId) => set({ selectedSavedCardId: cardId }),
killedBy: checkoutStore auto order consent flags keeps both consents when a new card is being saved alongside a saved-card upgrade
statusReason: expected { currentStep: 1, …(44) } to match object { saveCard: true, …(2) }
(51 matching properties omitted from actual)

[Killed] ArrowFunction
src/stores/checkoutStore.ts:139:16
   updateSpecialInstructions: (instructions) => set({ specialInstructions: instructions }),
   setApplyTaxExemption: (apply) => set({ applyTaxExemption: apply }),
   setSaveCard: (save) => set({ saveCard: save }),
-  setCardName: (name) => set({ cardName: name }),
+  setCardName: () => undefined,
   setSelectedSavedCardId: (cardId) => set({ selectedSavedCardId: cardId }),
   setPaymentMethodId: (paymentMethodId) => set({ paymentMethodId }),
killedBy: checkoutStore address and order metadata stores the card save preferences and terms agreement
statusReason: expected { currentStep: 1, …(44) } to match object { saveCard: true, …(3) }
(50 matching properties omitted from actual)

[Killed] ObjectLiteral
src/stores/checkoutStore.ts:139:30
   updateSpecialInstructions: (instructions) => set({ specialInstructions: instructions }),
   setApplyTaxExemption: (apply) => set({ applyTaxExemption: apply }),
   setSaveCard: (save) => set({ saveCard: save }),
-  setCardName: (name) => set({ cardName: name }),
+  setCardName: (name) => set({}),
   setSelectedSavedCardId: (cardId) => set({ selectedSavedCardId: cardId }),
   setPaymentMethodId: (paymentMethodId) => set({ paymentMethodId }),
killedBy: checkoutStore address and order metadata stores the card save preferences and terms agreement
statusReason: expected { currentStep: 1, …(44) } to match object { saveCard: true, …(3) }
(50 matching properties omitted from actual)

[Killed] ArrowFunction
src/stores/checkoutStore.ts:140:27
   setApplyTaxExemption: (apply) => set({ applyTaxExemption: apply }),
   setSaveCard: (save) => set({ saveCard: save }),
   setCardName: (name) => set({ cardName: name }),
-  setSelectedSavedCardId: (cardId) => set({ selectedSavedCardId: cardId }),
+  setSelectedSavedCardId: () => undefined,
   setPaymentMethodId: (paymentMethodId) => set({ paymentMethodId }),
   setPaymentMethodSummary: (summary) => set({ paymentMethodSummary: summary }),
killedBy: checkoutStore payment method keeps the saved card selection when switching away from card
statusReason: expected '' to be 'card-123' // Object.is equality

[Killed] ArrowFunction
src/stores/checkoutStore.ts:141:23
   setSaveCard: (save) => set({ saveCard: save }),
   setCardName: (name) => set({ cardName: name }),
   setSelectedSavedCardId: (cardId) => set({ selectedSavedCardId: cardId }),
-  setPaymentMethodId: (paymentMethodId) => set({ paymentMethodId }),
+  setPaymentMethodId: () => undefined,
   setPaymentMethodSummary: (summary) => set({ paymentMethodSummary: summary }),
   setAutoOrderConsent: (consent) => set({ autoOrderConsent: consent }),
killedBy: checkoutStore payment method keeps the saved card selection when switching away from card
statusReason: expected '' to be 'pm_123' // Object.is equality

[Killed] ObjectLiteral
src/stores/checkoutStore.ts:141:48
   setSaveCard: (save) => set({ saveCard: save }),
   setCardName: (name) => set({ cardName: name }),
   setSelectedSavedCardId: (cardId) => set({ selectedSavedCardId: cardId }),
-  setPaymentMethodId: (paymentMethodId) => set({ paymentMethodId }),
+  setPaymentMethodId: (paymentMethodId) => set({}),
   setPaymentMethodSummary: (summary) => set({ paymentMethodSummary: summary }),
   setAutoOrderConsent: (consent) => set({ autoOrderConsent: consent }),
killedBy: useBillingInformation — new card stores the payment method id and a readable summary on success
statusReason: expected '' to be 'pm_new_card' // Object.is equality

[Killed] ArrowFunction
src/stores/checkoutStore.ts:142:28
   setCardName: (name) => set({ cardName: name }),
   setSelectedSavedCardId: (cardId) => set({ selectedSavedCardId: cardId }),
   setPaymentMethodId: (paymentMethodId) => set({ paymentMethodId }),
-  setPaymentMethodSummary: (summary) => set({ paymentMethodSummary: summary }),
+  setPaymentMethodSummary: () => undefined,
   setAutoOrderConsent: (consent) => set({ autoOrderConsent: consent }),
   setNewCardAutoPaymentConsent: (consent) => set({ newCardAutoPaymentConsent: consent }),
killedBy: checkoutStore payment method keeps the saved card selection when switching away from card
statusReason: expected '' to be 'Visa •••• 4242' // Object.is equality

[Killed] ArrowFunction
src/stores/checkoutStore.ts:143:24
   setSelectedSavedCardId: (cardId) => set({ selectedSavedCardId: cardId }),
   setPaymentMethodId: (paymentMethodId) => set({ paymentMethodId }),
   setPaymentMethodSummary: (summary) => set({ paymentMethodSummary: summary }),
-  setAutoOrderConsent: (consent) => set({ autoOrderConsent: consent }),
+  setAutoOrderConsent: () => undefined,
   setNewCardAutoPaymentConsent: (consent) => set({ newCardAutoPaymentConsent: consent }),
   setAutoOrderUserProductIds: (userProductIds) => set({ autoOrderUserProductIds: userProductIds }),
killedBy: checkoutStore auto order consent flags tracks the saved-card consent independently of the new-card consent
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/stores/checkoutStore.ts:144:33
   setPaymentMethodId: (paymentMethodId) => set({ paymentMethodId }),
   setPaymentMethodSummary: (summary) => set({ paymentMethodSummary: summary }),
   setAutoOrderConsent: (consent) => set({ autoOrderConsent: consent }),
-  setNewCardAutoPaymentConsent: (consent) => set({ newCardAutoPaymentConsent: consent }),
+  setNewCardAutoPaymentConsent: () => undefined,
   setAutoOrderUserProductIds: (userProductIds) => set({ autoOrderUserProductIds: userProductIds }),
   setTermsAgreed: (agreed) => set({ termsAgreed: agreed }),
killedBy: checkoutStore auto order consent flags tracks the new-card consent independently of the saved-card consent
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/stores/checkoutStore.ts:145:31
   setPaymentMethodSummary: (summary) => set({ paymentMethodSummary: summary }),
   setAutoOrderConsent: (consent) => set({ autoOrderConsent: consent }),
   setNewCardAutoPaymentConsent: (consent) => set({ newCardAutoPaymentConsent: consent }),
-  setAutoOrderUserProductIds: (userProductIds) => set({ autoOrderUserProductIds: userProductIds }),
+  setAutoOrderUserProductIds: () => undefined,
   setTermsAgreed: (agreed) => set({ termsAgreed: agreed }),
   setSelectedShippingEtaText: (etaText) => set({ selectedShippingEtaText: etaText }),
killedBy: checkoutStore auto order consent flags snapshots the auto order userProductIds
statusReason: expected [] to deeply equal [ 'up-1', 'up-2' ]

[Killed] ArrowFunction
src/stores/checkoutStore.ts:146:19
   setAutoOrderConsent: (consent) => set({ autoOrderConsent: consent }),
   setNewCardAutoPaymentConsent: (consent) => set({ newCardAutoPaymentConsent: consent }),
   setAutoOrderUserProductIds: (userProductIds) => set({ autoOrderUserProductIds: userProductIds }),
-  setTermsAgreed: (agreed) => set({ termsAgreed: agreed }),
+  setTermsAgreed: () => undefined,
   setSelectedShippingEtaText: (etaText) => set({ selectedShippingEtaText: etaText }),
   setSelectedVendorShippingMethods: (methods) =>
killedBy: checkoutStore address and order metadata stores the card save preferences and terms agreement
statusReason: expected { currentStep: 1, …(44) } to match object { saveCard: true, …(3) }
(50 matching properties omitted from actual)

[Killed] ArrowFunction
src/stores/checkoutStore.ts:147:31
   setNewCardAutoPaymentConsent: (consent) => set({ newCardAutoPaymentConsent: consent }),
   setAutoOrderUserProductIds: (userProductIds) => set({ autoOrderUserProductIds: userProductIds }),
   setTermsAgreed: (agreed) => set({ termsAgreed: agreed }),
-  setSelectedShippingEtaText: (etaText) => set({ selectedShippingEtaText: etaText }),
+  setSelectedShippingEtaText: () => undefined,
   setSelectedVendorShippingMethods: (methods) =>
     set((state) => ({
killedBy: checkoutStore shipping selections stores the aggregate shipping cost and eta text
statusReason: expected 'Express Delivery - 2-3 business days' to be 'Ground - 5 business days' // Object.is equality

[Killed] ArrowFunction
src/stores/checkoutStore.ts:148:37
   setAutoOrderUserProductIds: (userProductIds) => set({ autoOrderUserProductIds: userProductIds }),
   setTermsAgreed: (agreed) => set({ termsAgreed: agreed }),
   setSelectedShippingEtaText: (etaText) => set({ selectedShippingEtaText: etaText }),
-  setSelectedVendorShippingMethods: (methods) =>
-    set((state) => ({
-      selectedVendorShippingMethods:
-        typeof methods === "function" ? methods(state.selectedVendorShippingMethods) : methods,
-    })),
+  setSelectedVendorShippingMethods: () => undefined,
   setSelectedShippingCost: (cost) => set({ selectedShippingCost: cost }),
   setOrderPayload: (payload) => set({ orderPayload: payload }),
killedBy: checkoutStore shipping selections replaces the whole record when a plain object is passed
statusReason: expected {} to deeply equal { 'seller-2': { …(3) } }

[Killed] ArrowFunction
src/stores/checkoutStore.ts:149:9
   setTermsAgreed: (agreed) => set({ termsAgreed: agreed }),
   setSelectedShippingEtaText: (etaText) => set({ selectedShippingEtaText: etaText }),
   setSelectedVendorShippingMethods: (methods) =>
-    set((state) => ({
-      selectedVendorShippingMethods:
-        typeof methods === "function" ? methods(state.selectedVendorShippingMethods) : methods,
-    })),
+    set(() => undefined),
   setSelectedShippingCost: (cost) => set({ selectedShippingCost: cost }),
   setOrderPayload: (payload) => set({ orderPayload: payload }),
killedBy: checkoutStore shipping selections replaces the whole record when a plain object is passed
statusReason: Cannot read properties of undefined (reading 'setSelectedVendorShippingMethods')

[Killed] ConditionalExpression
src/stores/checkoutStore.ts:151:9
   setSelectedVendorShippingMethods: (methods) =>
     set((state) => ({
       selectedVendorShippingMethods:
-        typeof methods === "function" ? methods(state.selectedVendorShippingMethods) : methods,
+        false ? methods(state.selectedVendorShippingMethods) : methods,
     })),
   setSelectedShippingCost: (cost) => set({ selectedShippingCost: cost }),
killedBy: useShippingDetails — rate selection records a Shippo rate with its dollar amount and business-day ETA
statusReason: expected undefined to deeply equal { sellerName: 'Acme Dental', …(2) }

[Killed] ConditionalExpression
src/stores/checkoutStore.ts:151:9
   setSelectedVendorShippingMethods: (methods) =>
     set((state) => ({
       selectedVendorShippingMethods:
-        typeof methods === "function" ? methods(state.selectedVendorShippingMethods) : methods,
+        true ? methods(state.selectedVendorShippingMethods) : methods,
     })),
   setSelectedShippingCost: (cost) => set({ selectedShippingCost: cost }),
killedBy: checkoutStore shipping selections replaces the whole record when a plain object is passed
statusReason: methods is not a function

[Killed] ArrowFunction
src/stores/checkoutStore.ts:153:28
       selectedVendorShippingMethods:
         typeof methods === "function" ? methods(state.selectedVendorShippingMethods) : methods,
     })),
-  setSelectedShippingCost: (cost) => set({ selectedShippingCost: cost }),
+  setSelectedShippingCost: () => undefined,
   setOrderPayload: (payload) => set({ orderPayload: payload }),
   setOrderResult: (result) => set({ orderResult: result }),
killedBy: checkoutStore shipping selections stores the aggregate shipping cost and eta text
statusReason: expected +0 to be 24.75 // Object.is equality

[Killed] ObjectLiteral
src/stores/checkoutStore.ts:153:42
       selectedVendorShippingMethods:
         typeof methods === "function" ? methods(state.selectedVendorShippingMethods) : methods,
     })),
-  setSelectedShippingCost: (cost) => set({ selectedShippingCost: cost }),
+  setSelectedShippingCost: (cost) => set({}),
   setOrderPayload: (payload) => set({ orderPayload: payload }),
   setOrderResult: (result) => set({ orderResult: result }),
killedBy: checkoutStore shipping selections stores the aggregate shipping cost and eta text
statusReason: expected +0 to be 24.75 // Object.is equality

[Killed] ArrowFunction
src/stores/checkoutStore.ts:154:20
         typeof methods === "function" ? methods(state.selectedVendorShippingMethods) : methods,
     })),
   setSelectedShippingCost: (cost) => set({ selectedShippingCost: cost }),
-  setOrderPayload: (payload) => set({ orderPayload: payload }),
+  setOrderPayload: () => undefined,
   setOrderResult: (result) => set({ orderResult: result }),
   reset: () =>
killedBy: checkoutStore address and order metadata keeps the order payload and result until reset
statusReason: expected null to deeply equal { addressId: 'address-1', …(2) }

[Killed] ObjectLiteral
src/stores/checkoutStore.ts:154:37
         typeof methods === "function" ? methods(state.selectedVendorShippingMethods) : methods,
     })),
   setSelectedShippingCost: (cost) => set({ selectedShippingCost: cost }),
-  setOrderPayload: (payload) => set({ orderPayload: payload }),
+  setOrderPayload: (payload) => set({}),
   setOrderResult: (result) => set({ orderResult: result }),
   reset: () =>
killedBy: useShippingDetails — submit builds separate shippo and uber orders, carrying the recurrence per line
statusReason: expected null to deeply equal { addressId: 'address-1', …(2) }

[Killed] ArrowFunction
src/stores/checkoutStore.ts:155:19
     })),
   setSelectedShippingCost: (cost) => set({ selectedShippingCost: cost }),
   setOrderPayload: (payload) => set({ orderPayload: payload }),
-  setOrderResult: (result) => set({ orderResult: result }),
+  setOrderResult: () => undefined,
   reset: () =>
     set({
killedBy: checkoutStore address and order metadata keeps the order payload and result until reset
statusReason: expected null to deeply equal { orderId: 'order-1', …(4) }

[Killed] ObjectLiteral
src/stores/checkoutStore.ts:155:35
     })),
   setSelectedShippingCost: (cost) => set({ selectedShippingCost: cost }),
   setOrderPayload: (payload) => set({ orderPayload: payload }),
-  setOrderResult: (result) => set({ orderResult: result }),
+  setOrderResult: (result) => set({}),
   reset: () =>
     set({
killedBy: checkoutStore address and order metadata keeps the order payload and result until reset
statusReason: expected null to deeply equal { orderId: 'order-1', …(4) }

[Killed] ArrowFunction
src/stores/checkoutStore.ts:156:10
   setSelectedShippingCost: (cost) => set({ selectedShippingCost: cost }),
   setOrderPayload: (payload) => set({ orderPayload: payload }),
   setOrderResult: (result) => set({ orderResult: result }),
-  reset: () =>
-    set({
-      currentStep: 1,
-      shippingAddress: initialShippingAddress,
-      paymentMethod: initialPaymentMethod,
-      poNumber: "",
-      department: "",
-      specialInstructions: "",
-      applyTaxExemption: true,
-      saveCard: false,
-      cardName: "",
-      selectedSavedCardId: "",
-      paymentMethodId: "",
-      paymentMethodSummary: "",
-      autoOrderConsent: false,
-      newCardAutoPaymentConsent: false,
-      autoOrderUserProductIds: [],
-      termsAgreed: false,
-      selectedShippingEtaText: "Express Delivery - 2-3 business days",
-      selectedVendorShippingMethods: {},
-      selectedShippingCost: 0,
-      orderPayload: null,
-      orderResult: null,
-    }),
+  reset: () => undefined,
 }))
 
killedBy: checkoutStore reset does not restore the declared initial state writes a hardcoded Express Delivery eta on reset
statusReason: expected 'Ground - 5 business days' to be 'Express Delivery - 2-3 business days' // Object.is equality
