[Killed] StringLiteral
src/stores/checkoutStore.ts:162:19
       shippingAddress: initialShippingAddress,
       paymentMethod: initialPaymentMethod,
       poNumber: "",
-      department: "",
+      department: "Stryker was here!",
       specialInstructions: "",
       applyTaxExemption: true,
killedBy: checkoutStore baseline state defaults every flag and free-text field to empty/false
statusReason: expected { currentStep: 1, …(44) } to match object { …(17) }
(36 matching properties omitted from actual)

[Killed] StringLiteral
src/stores/checkoutStore.ts:169:29
       cardName: "",
       selectedSavedCardId: "",
       paymentMethodId: "",
-      paymentMethodSummary: "",
+      paymentMethodSummary: "Stryker was here!",
       autoOrderConsent: false,
       newCardAutoPaymentConsent: false,
killedBy: checkoutStore baseline state defaults every flag and free-text field to empty/false
statusReason: expected { currentStep: 1, …(44) } to match object { …(17) }
(36 matching properties omitted from actual)
